{
  "paragraphs": [
    {
      "title": "Collaborative Filtering:  Matrix Factorization using Alternating Least Squares (ALS)",
      "text": "%md ![Alternating Least Squares - Matrix Factorization](http://advancedspark.com/img/collaborative-filtering-with-als-matrix-factorization.png)",
      "dateUpdated": "Jun 17, 2016 1:59:18 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "title": true,
        "editorHide": true,
        "editorMode": "ace/mode/markdown",
        "enabled": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1435978153894_1534941045",
      "id": "20150704-024913_884517592",
      "result": {
        "code": "SUCCESS",
        "type": "HTML",
        "msg": "\u003cp\u003e\u003cimg src\u003d\"http://advancedspark.com/img/collaborative-filtering-with-als-matrix-factorization.png\" alt\u003d\"Alternating Least Squares - Matrix Factorization\" /\u003e\u003c/p\u003e\n"
      },
      "dateCreated": "Jul 4, 2015 2:49:13 AM",
      "dateStarted": "Jun 17, 2016 1:59:18 AM",
      "dateFinished": "Jun 17, 2016 1:59:19 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Get Reference Data for Enrichment",
      "text": "val itemsDF \u003d sqlContext.read.format(\"json\")\n  .load(\"file:/root/pipeline/myapps/html/advancedspark.com/json/actors.json\")\n  .withColumnRenamed(\"id\", \"itemId\")\n  .as(\"items\")\n\nz.show(itemsDF.select($\"itemId\", $\"title\", $\"img\", $\"tags\", $\"description\"))",
      "dateUpdated": "Jun 17, 2016 1:59:18 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 175.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "itemId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "title",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "itemId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "title",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456864386968_-1684206029",
      "id": "20160301-203306_1764877860",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "itemId\ttitle\timg\ttags\tdescription\n90001\tLinda Blair\timg/actors/90001.jpg\tSt. Louis, Missouri, United States\tFrom the age of five, Linda Blair had to get used to the spotlight, first as a child model and then as an actress, when out of 600 applicants she was picked for the role of Regan, the possessed child, in The Exorcist. Linda quickly rose to international fame, won the Golden Globe, and seemed to be set to take the Academy Award for that role...\n90002\tShannon Whirry\timg/actors/90002.jpg\tGreen Lake, Wisconsin, United States\tShannon Whirry is not just a talented actress with girl-next-door looks, she captured a generation of viewers\u0027 imaginations by wishing that she actually was the girl-next-door. Born in Green Lake County, Wisconsin, Whirry graduated from high school and packed her bags for New York. She trained at the...\n90003\tRosalind Allen\timg/actors/90003.jpg\tWellington, New Zealand, New Zealand\tRosalind Allen (born Rosalind Ingledew) hails from New Zealand and studied acting there before coming to the United States. Her movie debut was in the film, Perfect, and she continues a long career in television \u0026 film. Famously remembered as the \"It girl\" in the Seinfeld episode, The Marine Biologist...\n90004\tBobbie Phillips\timg/actors/90004.jpg\tSalisbury, North Carolina, United States\tBrains and beauty are two words that have been repeatedly used to describe Bobbie Phillips throughout her career. Graduating high school at 16 years old, Bobbie tried several different career paths. After taking college classes to become a litigation attorney, it was suggested she also take drama classes...\n90005\tKeshia Knight Pulliam\timg/actors/90005.jpg\tNewark, New Jersey, United States\tKeshia Knight Pulliam was born on April 9, 1979 in Newark, New Jersey, USA. She is an actress, known for The Cosby Show (1984), Madea Goes to Jail (2009) and Beauty Shop (2005).\n90006\tTatyana Ali\timg/actors/90006.jpg\tBrooklyn, New York, United States\tOn January 24, 1979, Tatyana Marisol Ali was born to Sonia, who was a nurse from Panama, and Sheriff Ali, a retired police officer from Trinidad. At the age of four she started singing and got a taste of fame when she begged her mother to take her to an audition for Sesame Street. She went on to perform in many productions in her native city...\n90007\tAngell Conwell\timg/actors/90007.jpg\tOrangeburg, South Carolina, United States\tBorn in the tiny town of Orangeburg, South Carolina, Angell Conwell began her journey at a very young age. After winning countless pageants locally, she signed with Wilhelmina\u0027s Kids Division in New York at the age of 10. Angell enjoyed modeling but yearned for more of a challenge. She begged for her parents permission to audition for a role in August Wilson\u0027s highly acclaimed...\n90008\tShannah Laumeister\timg/actors/90008.jpg\tSan Francisco, California, United States\tShannah Laumeister was born on July 23, 1969 in San Francisco, California, USA. She is an actress and director, known for Bullets Over Broadway (1994), Nobody\u0027s Fool (1994) and 61* (2001). She was previously married to Bert Stern.\n90009\tPam Grier\timg/actors/90009.jpg\tWinstom-Salem, North Carolina, United States\tPam Grier was born in Winston-Salem, NC, one of four children of Gwendolyn Sylvia (Samuels), a nurse, and Clarence Ransom Grier Jr., an Air Force mechanic. Pam has been a major African-American star from the early 1970s. Her career started in 1971, when Roger Corman of New World Pictures launched her with The Big Doll House...\n90010\tTiffani Thiessen\timg/actors/90010.jpg\tLong Beach, California, United States\tTiffani-Amber Thiessen was born on January 23, 1974, in Long Beach, California, USA, to Frank Thiessen, a park designer, and Robyn Ernest, a homemaker. She grew up in Long Beach with her parents and her brothers, professional cyclist Todd (b. 1968) and Schuyler (b. 1977). When Tiffani was 8, her uncle...\n90011\tAshley Judd\timg/actors/90011.jpg\tGranada Hills, California, United States\tAshley Judd was born on April 19, 1968 in Granada Hills, California, USA as Ashley Tyler Ciminella. She is an actress and producer, known for Divergent (2014), Heat (1995) and Double Jeopardy (1999). She was previously married to Dario Franchitti.\n90012\tStacey Dash\timg/actors/90012.jpg\tBronx, New York, United States\tStacey Dash was born in the Bronx, New York. Stacy knew that she wanted to act, and from an early age began to act professionally. She made regular appearances on The Cosby Show, The Fresh Prince of Bel-Air, and also St. Elsewhere. At 21 she made her feature film debut in Enemy Territory, which was quickly followed by Moving...\n90013\tSofia Vergara\timg/actors/90013.jpg\tBarranquilla, Atlantico, Colombia\tSofia Margarita Vergara Vergara was born and raised in Barranquilla, Colombia. Her mother, Margarita Vergara Davila de Vergara, is a housewife. Her father, Julio Enrique Vergara Robayo, provides cattle to the meat industry. She has five siblings. She was educated at a private bilingual Spanish/English school...\n90014\tGail O\u0027Grady\timg/actors/90014.jpg\tDetroit, Michigan, United States\tGail O\u0027Grady was born on January 23, 1963 in Detroit, Michigan, USA as Gail Ann O\u0027Grady. She is an actress and producer, known for American Dreams (2002), Deuce Bigalow: Male Gigolo (1999) and NYPD Blue (1993). She was previously married to John Stamatakis, Anthony J Pellegrino, Steve Fenton, Severin Wunderman, Jeffrey Byron and Richard Dasko.\n90015\tBarbara Niven\timg/actors/90015.jpg\tPortland, Oregon, United States\tBarbara Niven was born on February 26, 1953 in Portland, Oregon, USA as Barbara Lee Bucholz. She is an actress and producer, known for A Perfect Ending (2012), Pensacola: Wings of Gold (1997) and The Rat Pack (1998).\n10001\tLeonardo DiCaprio\timg/actors/10001.jpg\tHollywood, California, United States\tFew actors in the world have had a career quite as diverse as Leonardo DiCaprio\u0027s. DiCaprio has gone from relatively humble beginnings, as a supporting cast member of the sitcom Growing Pains and low budget horror movies, such as Critters 3, to a major teenage heartthrob in the 1990s, as the hunky lead actor in movies such as Romeo + Juliet and Titanic...\n10002\tAnthony Hopkins\timg/actors/10002.jpg\tPort Talbot, Glamorgan, Wales\tAnthony Hopkins was born on December 31, 1937, in Margam, Wales, to Muriel Anne (Yeats) and Richard Arthur Hopkins, a baker. His parents were both of half Welsh and half English descent. Influenced by Richard Burton, he decided to study at College of Music and Drama and graduated in 1957. In 1965, he moved to London and joined the National Theatre...\n10003\tAl Pacino\timg/actors/10003.jpg\tManhattan, New York, United States\tOne of the greatest actors in all of film history, Al Pacino established himself during one of film\u0027s greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents...\n10004\tMorgan Freeman\timg/actors/10004.jpg\tMemphis, Tennessee, United States\tWith an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born in June 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended...\n10005\tJames Gandolfini\timg/actors/10005.jpg\tWestwood, New Jersey, United States\tJames Gandolfini was born in Westwood, New Jersey, to Santa (Penna), a high school lunchlady, and James Joseph Gandolfini, Sr., a bricklayer and head school janitor. His parents were both of Italian origin. Gandolfini began acting in the New York theater. His Broadway debut was in the 1992 revival of \"A Streetcar Named Desire\" with Jessica Lange and Alec Baldwin...\n10006\tTom Cruise\timg/actors/10006.jpg\tSyracuse, New York, United States\tIf you had told fourteen-year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not-too-distant future he would be considered one of the top hundred movie stars of all time, he would have probably grinned and told you that his ambition was to become a priest. None the less, this sensitive, deeply religious youngster who...\n10007\tDenzel Washington\timg/actors/10007.jpg\tMount Vernon, New York, United States\tDenzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis (Lowe), from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University...\n10008\tRobert De Niro\timg/actors/10008.jpg\tManhattan, New York, United States\tRobert De Niro, thought of as one of the greatest American actors of all time, was born in New York City, to artists Virginia (Admiral) and Robert De Niro Sr. His paternal grandfather was of Italian descent, and his other ancestry is Irish, Dutch, English, French, and German. He was trained at the Stella Adler Conservatory and the American Workshop...\n10009\tChazz Palminteri\timg/actors/10009.jpg\tBronx, New York, United States\tBronx-born and raised Chazz Palminteri was a natural choice to continue the Italianate torch in film. In the tradition set forth in the 1970s by such icons as director Martin Scorsese and actors Robert De Niro, Al Pacino, John Cazale and Joe Pesci, Palminteri has brought grit, muscle and an evocative realism to the sidewalks of his New York neighborhood...\n10010\tTom Hanks\timg/actors/10010.jpg\tConcord, California, United States\tThomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an itinerant cook. His father had English, and some German, ancestry, while his mother\u0027s family, originally surnamed \"Fraga\", was entirely Portuguese. Tom grew up in what he has called a \"fractured\" family...\n10011\tJohn Travolta\timg/actors/10011.jpg\tEnglewood, New York, United States\tJohn Travolta was born in Englewood, New Jersey, one of six children of Helen Travolta Helen Cecilia Burke) and Salvatore Travolta. His father was of Italian descent and his mother was of Irish ancestry. His father owned a tire repair shop called Travolta Tires in Hillsdale, NJ. Travolta appeared in a local production of \"Who\u0027ll Save the Plowboy?\"...\n10012\tJohnny Depp\timg/actors/10012.jpg\tOwensboro, Kentucky, United States\tJohnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15...\n10013\tMark Wahlberg\timg/actors/10013.jpg\tBoston, Massachusetts, United States\tAmerican actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to respected actor. A Best Supporting Actor Oscar nominee for The Departed who went on to receive positive critical reviews for his performance in The Fighter, Wahlberg also is a solid comedy actor, proven by his starring role in Ted...\n10014\tJames Franco\timg/actors/10014.jpg\tPalo Alto, California, United States\tKnown for his breakthrough starring role on Freaks and Geeks, James Franco was born in Palo Alto, California on April 19, 1978. His mother, Betsy Franco, is Jewish, and his father, Douglas Eugene \"Doug\" Franco, was of Portuguese and Swedish descent, and ran a Silicon Valley business. James\u0027s mother, a writer, has occasionally acted...\n10015\tClive Owen\timg/actors/10015.jpg\tCoventry, Warwickshire, England\tDarkly handsome British actor Clive Owen is one of a handful of stars best known for his art house films but how has handle more mainstream action films lately with equal measures of grace and skill. Owen typically is cast as characters whose primary traits are a balance of physical strength, intellect...\n"
      },
      "dateCreated": "Mar 1, 2016 8:33:06 PM",
      "dateStarted": "Jun 17, 2016 1:59:20 AM",
      "dateFinished": "Jun 17, 2016 2:00:02 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Get Live Ratings from Cassandra",
      "text": "val cassandraConfig \u003d Map(\"keyspace\" -\u003e \"advancedspark\", \"table\" -\u003e \"item_ratings\")\n\nval itemRatingsDF \u003d sqlContext.read.format(\"org.apache.spark.sql.cassandra\")\n  .options(cassandraConfig)\n  .load()\n  .select($\"userid\", $\"itemid\", $\"rating\", $\"timestamp\")\n  .withColumnRenamed(\"userid\", \"userId\")\n  .withColumnRenamed(\"itemid\", \"itemId\")\n  .as(\"itemRatings\")\n  \nz.show(itemRatingsDF.sort($\"userId\" asc))",
      "dateUpdated": "Jun 17, 2016 1:59:20 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 294.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456864425764_-1117794352",
      "id": "20160301-203345_1180596367",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\titemId\trating\ttimestamp\n5980\t90014\t1.0\t1466100222000\n5980\t10001\t1.0\t1466100186000\n5980\t10012\t1.0\t1466100190000\n5980\t90010\t1.0\t1466100182000\n5980\t10002\t1.0\t1466100186000\n5980\t90011\t1.0\t1466100210000\n21141\t90003\t1.0\t1466099804000\n21141\t10002\t1.0\t1466099810000\n21141\t10003\t1.0\t1466099812000\n21141\t10004\t1.0\t1466099812000\n21141\t90001\t1.0\t1466099800000\n21141\t90002\t1.0\t1466099802000\n21619\t10013\t1.0\t1465049318000\n21619\t10014\t1.0\t1465049318000\n21619\t90001\t1.0\t1465049312000\n21619\t90013\t1.0\t1465049314000\n21619\t90015\t1.0\t1465049314000\n21619\t10012\t1.0\t1465049318000\n27981\t10006\t1.0\t1465047836000\n27981\t90011\t1.0\t1465047834000\n27981\t10007\t1.0\t1465047836000\n27981\t10008\t1.0\t1465047836000\n27981\t90009\t1.0\t1465047834000\n27981\t90010\t1.0\t1465047834000\n28024\t10006\t1.0\t1466100188000\n28024\t10001\t1.0\t1466100176000\n28024\t10004\t1.0\t1466100192000\n28024\t90006\t1.0\t1466100196000\n28024\t90003\t1.0\t1466100194000\n28024\t90007\t1.0\t1466100196000\n28865\t90004\t1.0\t1466100094000\n28865\t90009\t1.0\t1466100092000\n28865\t10001\t1.0\t1466100062000\n28865\t90011\t1.0\t1466100082000\n28865\t10003\t1.0\t1466100158000\n28865\t10007\t1.0\t1466100066000\n30699\t90011\t1.0\t1466091806000\n30699\t10001\t1.0\t1466091806000\n32940\t10007\t1.0\t1466100188000\n32940\t10015\t1.0\t1466100182000\n32940\t90012\t1.0\t1466100192000\n32940\t90013\t1.0\t1466100192000\n32940\t10005\t1.0\t1466100186000\n32940\t90015\t1.0\t1466100194000\n34615\t90011\t1.0\t1466092108000\n34615\t90014\t1.0\t1466092112000\n34615\t90002\t1.0\t1466092112000\n34615\t10006\t1.0\t1466092100000\n34615\t10012\t1.0\t1466092104000\n34615\t10014\t1.0\t1466092102000\n34643\t10006\t1.0\t1466091870000\n34643\t90011\t1.0\t1466091880000\n36401\t90005\t1.0\t1466100116000\n36401\t10010\t1.0\t1466100122000\n36401\t90006\t1.0\t1466100116000\n36401\t90007\t1.0\t1466100118000\n36401\t10009\t1.0\t1466100122000\n36401\t10008\t1.0\t1466100122000\n38808\t10012\t1.0\t1466100048000\n38808\t90005\t1.0\t1466100044000\n38808\t90007\t1.0\t1466100044000\n38808\t10013\t1.0\t1466100050000\n38808\t90006\t1.0\t1466100044000\n38808\t10011\t1.0\t1466100048000\n39819\t10012\t1.0\t1466100092000\n39819\t90007\t1.0\t1466100180000\n39819\t10004\t1.0\t1466100070000\n39819\t10007\t1.0\t1466100056000\n39819\t90003\t1.0\t1466100534000\n39819\t90004\t1.0\t1466100536000\n39819\t10001\t1.0\t1466100060000\n39819\t90010\t1.0\t1466100174000\n39819\t90013\t1.0\t1466100066000\n39819\t90015\t1.0\t1466100064000\n39819\t10006\t1.0\t1466100054000\n39819\t90005\t1.0\t1466100536000\n44954\t90011\t1.0\t1466091714000\n44954\t10001\t1.0\t1466091704000\n46843\t10009\t1.0\t1466100188000\n46843\t10012\t1.0\t1466100234000\n46843\t10005\t1.0\t1466100180000\n46843\t10007\t1.0\t1466100180000\n46843\t10013\t1.0\t1466100236000\n46843\t10014\t1.0\t1466100236000\n46843\t90004\t1.0\t1466100176000\n46843\t10006\t1.0\t1466100180000\n46843\t90005\t1.0\t1466100178000\n46843\t10001\t1.0\t1466100134000\n57462\t90011\t1.0\t1466092060000\n57462\t10003\t1.0\t1466092056000\n57462\t10013\t1.0\t1466092082000\n57462\t10001\t1.0\t1466092046000\n57462\t10006\t1.0\t1466092024000\n57462\t10012\t1.0\t1466092066000\n57462\t10014\t1.0\t1466092050000\n57462\t10010\t1.0\t1466092054000\n61945\t10011\t1.0\t1466100100000\n61945\t90005\t1.0\t1466100112000\n61945\t10004\t1.0\t1466100164000\n61945\t90006\t1.0\t1466100112000\n61945\t10005\t1.0\t1466100162000\n61945\t90007\t1.0\t1466100112000\n61945\t10007\t1.0\t1466100108000\n66348\t10010\t1.0\t1466099670000\n66348\t10011\t1.0\t1466099672000\n66348\t10012\t1.0\t1466099672000\n66348\t90015\t1.0\t1466099670000\n66348\t90013\t1.0\t1466099668000\n66348\t90014\t1.0\t1466099670000\n68754\t90009\t1.0\t1466100158000\n68754\t90010\t1.0\t1466100186000\n70281\t90006\t1.0\t1466103828000\n72875\t10012\t1.0\t1466100056000\n72875\t90003\t1.0\t1466100094000\n72875\t90008\t1.0\t1466100084000\n72875\t10002\t1.0\t1466100050000\n72875\t90015\t1.0\t1466100090000\n72875\t10010\t1.0\t1466100058000\n79586\t10007\t1.0\t1466100840000\n79586\t10008\t1.0\t1466100154000\n79586\t10010\t1.0\t1466100156000\n79586\t90002\t1.0\t1466100126000\n79586\t90008\t1.0\t1466100180000\n79586\t90011\t1.0\t1466100186000\n79586\t90012\t1.0\t1466100842000\n79586\t90015\t1.0\t1466100184000\n79586\t10006\t1.0\t1466100840000\n79586\t90013\t1.0\t1466100842000\n79586\t90014\t1.0\t1466100842000\n80374\t10013\t1.0\t1466051476000\n80374\t10001\t1.0\t1466051472000\n80374\t90003\t1.0\t1466051470000\n80374\t90009\t1.0\t1466051472000\n80374\t10006\t1.0\t1466051474000\n80374\t90010\t1.0\t1466051472000\n80374\t90004\t1.0\t1466051470000\n80374\t10007\t1.0\t1466051474000\n80374\t90015\t1.0\t1466051472000\n80374\t10012\t1.0\t1466051474000\n82059\t90005\t1.0\t1466100190000\n82059\t90007\t1.0\t1466100186000\n82059\t10004\t1.0\t1466100180000\n82059\t90008\t1.0\t1466100190000\n82059\t90006\t1.0\t1466100186000\n82059\t10010\t1.0\t1466100184000\n82059\t10011\t1.0\t1466100176000\n85152\t90013\t1.0\t1466100116000\n85152\t10012\t1.0\t1466100090000\n85152\t90004\t1.0\t1466100116000\n85152\t10006\t1.0\t1466100074000\n85152\t90015\t1.0\t1466100114000\n85152\t10001\t1.0\t1466100088000\n88190\t10009\t1.0\t1466100122000\n88190\t10010\t1.0\t1466100068000\n88190\t10014\t1.0\t1466100124000\n88190\t90010\t1.0\t1466100058000\n88190\t90013\t1.0\t1466100054000\n88190\t90012\t1.0\t1466100054000\n88190\t10008\t1.0\t1466100062000\n88190\t10004\t1.0\t1466100046000\n89887\t90001\t1.0\t1466092202000\n89887\t90009\t1.0\t1466092200000\n89887\t10005\t1.0\t1466092202000\n89887\t90011\t1.0\t1466092200000\n89887\t10006\t1.0\t1466092202000\n89887\t10007\t1.0\t1466092202000\n90162\t10010\t1.0\t1466100206000\n90162\t10011\t1.0\t1466100192000\n90162\t10013\t1.0\t1466099708000\n90162\t90011\t1.0\t1466100194000\n90162\t10001\t1.0\t1466099706000\n90162\t90001\t1.0\t1466100194000\n90162\t90005\t1.0\t1466099702000\n90162\t90014\t1.0\t1466099704000\n90162\t90007\t1.0\t1466100186000\n90162\t10007\t1.0\t1466100190000\n90162\t90006\t1.0\t1466100186000\n90162\t10008\t1.0\t1466099708000\n97911\t10001\t1.0\t1466100194000\n97911\t10006\t1.0\t1466100192000\n97911\t10010\t1.0\t1466100194000\n97911\t90001\t1.0\t1466100198000\n97911\t90004\t1.0\t1466100196000\n97911\t90013\t1.0\t1466100188000\n97911\t90014\t1.0\t1466100188000\n"
      },
      "dateCreated": "Mar 1, 2016 8:33:45 PM",
      "dateStarted": "Jun 17, 2016 1:59:29 AM",
      "dateFinished": "Jun 17, 2016 2:00:06 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Train ALS Model With the training dataset",
      "text": "import org.apache.spark.ml.recommendation.ALS\n\nval rank \u003d 5 // this is k, number of latent factors we think exist\nval maxIterations \u003d 10\nval convergenceThreshold \u003d 0.01\nval implicitPrefs \u003d false\nval alpha \u003d 1.0\nval nonnegative \u003d true\n\nval als \u003d new ALS()\n  .setRank(rank)\n  .setMaxIter(maxIterations)\n  .setRegParam(convergenceThreshold)\n  .setImplicitPrefs(implicitPrefs)\n  .setAlpha(alpha)\n  .setNonnegative(nonnegative)\n  .setUserCol(\"userId\")\n  .setItemCol(\"itemId\")\n  .setRatingCol(\"rating\")\n  .setPredictionCol(\"prediction\")",
      "dateUpdated": "Jun 17, 2016 1:59:21 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "title": true,
        "editorHide": false,
        "editorMode": "ace/mode/scala",
        "enabled": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1435978256373_-160526409",
      "id": "20150704-025056_169923529",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import org.apache.spark.ml.recommendation.ALS\nrank: Int \u003d 5\nmaxIterations: Int \u003d 10\nconvergenceThreshold: Double \u003d 0.01\nimplicitPrefs: Boolean \u003d false\nalpha: Double \u003d 1.0\nnonnegative: Boolean \u003d true\nals: org.apache.spark.ml.recommendation.ALS \u003d als_0c206698ac34\n"
      },
      "dateCreated": "Jul 4, 2015 2:50:56 AM",
      "dateStarted": "Jun 17, 2016 2:00:02 AM",
      "dateFinished": "Jun 17, 2016 2:00:08 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Setup ML Pipeline",
      "text": "import org.apache.spark.ml.Pipeline\n\nval pipeline \u003d new Pipeline()\n  .setStages(Array(als))",
      "dateUpdated": "Jun 17, 2016 1:59:21 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465835947993_-1356802902",
      "id": "20160613-163907_1047105704",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import org.apache.spark.ml.Pipeline\npipeline: org.apache.spark.ml.Pipeline \u003d pipeline_80b4ea5600aa\n"
      },
      "dateCreated": "Jun 13, 2016 4:39:07 PM",
      "dateStarted": "Jun 17, 2016 2:00:06 AM",
      "dateFinished": "Jun 17, 2016 2:00:08 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Setup Model Evaluator",
      "text": "import org.apache.spark.ml.evaluation.RegressionEvaluator\n\nval modelEvaluator \u003d new RegressionEvaluator()\n  .setMetricName(\"rmse\")\n  .setLabelCol(\"rating\")\n  .setPredictionCol(\"prediction\")",
      "dateUpdated": "Jun 17, 2016 1:59:21 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464992813458_-888489907",
      "id": "20160603-222653_1839242653",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import org.apache.spark.ml.evaluation.RegressionEvaluator\nmodelEvaluator: org.apache.spark.ml.evaluation.RegressionEvaluator \u003d regEval_965dc6e69d59\n"
      },
      "dateCreated": "Jun 3, 2016 10:26:53 PM",
      "dateStarted": "Jun 17, 2016 2:00:08 AM",
      "dateFinished": "Jun 17, 2016 2:00:09 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Build Param Grid Search",
      "text": "import org.apache.spark.ml.tuning.ParamGridBuilder\n\nval paramGrid \u003d new ParamGridBuilder()\n  .addGrid(als.rank, Array(5, 10, 15))\n  .addGrid(als.maxIter, Array(10, 20))\n  .addGrid(als.regParam, Array(.01, .001))\n  .build()\n  \nparamGrid.size",
      "dateUpdated": "Jun 17, 2016 1:59:22 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464996331980_906433755",
      "id": "20160603-232531_2131104428",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import org.apache.spark.ml.tuning.ParamGridBuilder\nparamGrid: Array[org.apache.spark.ml.param.ParamMap] \u003d \nArray({\n\tals_0c206698ac34-maxIter: 10,\n\tals_0c206698ac34-rank: 5,\n\tals_0c206698ac34-regParam: 0.01\n}, {\n\tals_0c206698ac34-maxIter: 20,\n\tals_0c206698ac34-rank: 5,\n\tals_0c206698ac34-regParam: 0.01\n}, {\n\tals_0c206698ac34-maxIter: 10,\n\tals_0c206698ac34-rank: 10,\n\tals_0c206698ac34-regParam: 0.01\n}, {\n\tals_0c206698ac34-maxIter: 20,\n\tals_0c206698ac34-rank: 10,\n\tals_0c206698ac34-regParam: 0.01\n}, {\n\tals_0c206698ac34-maxIter: 10,\n\tals_0c206698ac34-rank: 15,\n\tals_0c206698ac34-regParam: 0.01\n}, {\n\tals_0c206698ac34-maxIter: 20,\n\tals_0c206698ac34-rank: 15,\n\tals_0c206698ac34-regParam: 0.01\n}, {\n\tals_0c206698ac34-maxIter: 10,\n\tals_0c206698ac34-rank: 5,\n\tals_0c206698ac34-regParam: 0.001\n}, {\n\tals_0c206698ac34-maxIter: 20,\n\tals_0c206698ac34-rank: 5...res16: Int \u003d 12\n"
      },
      "dateCreated": "Jun 3, 2016 11:25:31 PM",
      "dateStarted": "Jun 17, 2016 2:00:08 AM",
      "dateFinished": "Jun 17, 2016 2:00:10 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Setup Cross Validator",
      "text": "import org.apache.spark.ml.tuning.CrossValidator\n\nval numFolds \u003d 2\n\nval modelValidator \u003d new CrossValidator()\n  .setEstimator(pipeline)\n  .setEvaluator(modelEvaluator)\n  .setEstimatorParamMaps(paramGrid)\n  .setNumFolds(numFolds) ",
      "dateUpdated": "Jun 17, 2016 1:59:23 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465836085091_-166573695",
      "id": "20160613-164125_1299071014",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import org.apache.spark.ml.tuning.CrossValidator\nnumFolds: Int \u003d 2\nmodelValidator: org.apache.spark.ml.tuning.CrossValidator \u003d cv_d4313b1d57d7\n"
      },
      "dateCreated": "Jun 13, 2016 4:41:25 PM",
      "dateStarted": "Jun 17, 2016 2:00:09 AM",
      "dateFinished": "Jun 17, 2016 2:00:10 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Train CrossValidator Model To Find Best Model",
      "text": "val crossValidatorModel \u003d modelValidator.fit(itemRatingsDF)",
      "dateUpdated": "Jun 17, 2016 1:59:23 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465836110814_1533459839",
      "id": "20160613-164150_1050480637",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "crossValidatorModel: org.apache.spark.ml.tuning.CrossValidatorModel \u003d cv_d4313b1d57d7\n"
      },
      "dateCreated": "Jun 13, 2016 4:41:50 PM",
      "dateStarted": "Jun 17, 2016 2:00:10 AM",
      "dateFinished": "Jun 17, 2016 2:02:53 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Find Best Param Grid Options",
      "text": "val avgMetricsParamGrid \u003d crossValidatorModel.avgMetrics\n\nval combined \u003d paramGrid.zip(avgMetricsParamGrid)\n  .sortBy(paramGridMetricTuple \u003d\u003e (1 - paramGridMetricTuple._2))\n  .take(1)(0)._1",
      "dateUpdated": "Jun 17, 2016 1:59:23 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465836131716_924802403",
      "id": "20160613-164211_11503343",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "avgMetricsParamGrid: Array[Double] \u003d Array(NaN, NaN, NaN, NaN, NaN, NaN, NaN, NaN, NaN, NaN, NaN, NaN)\ncombined: org.apache.spark.ml.param.ParamMap \u003d \n{\n\tals_0c206698ac34-maxIter: 10,\n\tals_0c206698ac34-rank: 5,\n\tals_0c206698ac34-regParam: 0.01\n}\n"
      },
      "dateCreated": "Jun 13, 2016 4:42:11 PM",
      "dateStarted": "Jun 17, 2016 2:00:10 AM",
      "dateFinished": "Jun 17, 2016 2:02:54 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Find Best Pipeline Model",
      "text": "import org.apache.spark.ml.PipelineModel\n\nval bestPipelineModel \u003d crossValidatorModel.bestModel.asInstanceOf[PipelineModel]",
      "dateUpdated": "Jun 17, 2016 1:59:25 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465836167704_823289991",
      "id": "20160613-164247_421530178",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import org.apache.spark.ml.PipelineModel\nbestPipelineModel: org.apache.spark.ml.PipelineModel \u003d pipeline_c303976d870b\n"
      },
      "dateCreated": "Jun 13, 2016 4:42:47 PM",
      "dateStarted": "Jun 17, 2016 2:02:54 AM",
      "dateFinished": "Jun 17, 2016 2:02:55 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Extract Best Recomendation Model",
      "text": "import org.apache.spark.ml.recommendation.ALSModel\n\nval bestRecommendationModel \u003d bestPipelineModel.stages(0).asInstanceOf[ALSModel]",
      "dateUpdated": "Jun 17, 2016 1:59:25 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465836184603_1803092197",
      "id": "20160613-164304_1411945185",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import org.apache.spark.ml.recommendation.ALSModel\nbestRecommendationModel: org.apache.spark.ml.recommendation.ALSModel \u003d als_0c206698ac34\n"
      },
      "dateCreated": "Jun 13, 2016 4:43:04 PM",
      "dateStarted": "Jun 17, 2016 2:02:55 AM",
      "dateFinished": "Jun 17, 2016 2:02:55 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Find all (User, item) pairs without an existing Rating",
      "text": "val allDistinctUsersDF \u003d itemRatingsDF.select($\"userId\").dropDuplicates()\n\nval allDistinctUserItemPairsDF \u003d allDistinctUsersDF\n  .join(itemsDF.select($\"itemId\"))\n  .select($\"userId\", $\"itemId\")\n  .distinct()\n  .coalesce(1)\n\nz.show(allDistinctUserItemPairsDF.sort($\"userId\", $\"itemId\"))",
      "dateUpdated": "Jun 17, 2016 1:59:25 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 288.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1461100304691_419185220",
      "id": "20160419-211144_1773438539",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\titemId\n5980\t10001\n5980\t10002\n5980\t10003\n5980\t10004\n5980\t10005\n5980\t10006\n5980\t10007\n5980\t10008\n5980\t10009\n5980\t10010\n5980\t10011\n5980\t10012\n5980\t10013\n5980\t10014\n5980\t10015\n5980\t90001\n5980\t90002\n5980\t90003\n5980\t90004\n5980\t90005\n5980\t90006\n5980\t90007\n5980\t90008\n5980\t90009\n5980\t90010\n5980\t90011\n5980\t90012\n5980\t90013\n5980\t90014\n5980\t90015\n21141\t10001\n21141\t10002\n21141\t10003\n21141\t10004\n21141\t10005\n21141\t10006\n21141\t10007\n21141\t10008\n21141\t10009\n21141\t10010\n21141\t10011\n21141\t10012\n21141\t10013\n21141\t10014\n21141\t10015\n21141\t90001\n21141\t90002\n21141\t90003\n21141\t90004\n21141\t90005\n21141\t90006\n21141\t90007\n21141\t90008\n21141\t90009\n21141\t90010\n21141\t90011\n21141\t90012\n21141\t90013\n21141\t90014\n21141\t90015\n21619\t10001\n21619\t10002\n21619\t10003\n21619\t10004\n21619\t10005\n21619\t10006\n21619\t10007\n21619\t10008\n21619\t10009\n21619\t10010\n21619\t10011\n21619\t10012\n21619\t10013\n21619\t10014\n21619\t10015\n21619\t90001\n21619\t90002\n21619\t90003\n21619\t90004\n21619\t90005\n21619\t90006\n21619\t90007\n21619\t90008\n21619\t90009\n21619\t90010\n21619\t90011\n21619\t90012\n21619\t90013\n21619\t90014\n21619\t90015\n27981\t10001\n27981\t10002\n27981\t10003\n27981\t10004\n27981\t10005\n27981\t10006\n27981\t10007\n27981\t10008\n27981\t10009\n27981\t10010\n27981\t10011\n27981\t10012\n27981\t10013\n27981\t10014\n27981\t10015\n27981\t90001\n27981\t90002\n27981\t90003\n27981\t90004\n27981\t90005\n27981\t90006\n27981\t90007\n27981\t90008\n27981\t90009\n27981\t90010\n27981\t90011\n27981\t90012\n27981\t90013\n27981\t90014\n27981\t90015\n28024\t10001\n28024\t10002\n28024\t10003\n28024\t10004\n28024\t10005\n28024\t10006\n28024\t10007\n28024\t10008\n28024\t10009\n28024\t10010\n28024\t10011\n28024\t10012\n28024\t10013\n28024\t10014\n28024\t10015\n28024\t90001\n28024\t90002\n28024\t90003\n28024\t90004\n28024\t90005\n28024\t90006\n28024\t90007\n28024\t90008\n28024\t90009\n28024\t90010\n28024\t90011\n28024\t90012\n28024\t90013\n28024\t90014\n28024\t90015\n28865\t10001\n28865\t10002\n28865\t10003\n28865\t10004\n28865\t10005\n28865\t10006\n28865\t10007\n28865\t10008\n28865\t10009\n28865\t10010\n28865\t10011\n28865\t10012\n28865\t10013\n28865\t10014\n28865\t10015\n28865\t90001\n28865\t90002\n28865\t90003\n28865\t90004\n28865\t90005\n28865\t90006\n28865\t90007\n28865\t90008\n28865\t90009\n28865\t90010\n28865\t90011\n28865\t90012\n28865\t90013\n28865\t90014\n28865\t90015\n30699\t10001\n30699\t10002\n30699\t10003\n30699\t10004\n30699\t10005\n30699\t10006\n30699\t10007\n30699\t10008\n30699\t10009\n30699\t10010\n30699\t10011\n30699\t10012\n30699\t10013\n30699\t10014\n30699\t10015\n30699\t90001\n30699\t90002\n30699\t90003\n30699\t90004\n30699\t90005\n30699\t90006\n30699\t90007\n30699\t90008\n30699\t90009\n30699\t90010\n30699\t90011\n30699\t90012\n30699\t90013\n30699\t90014\n30699\t90015\n32940\t10001\n32940\t10002\n32940\t10003\n32940\t10004\n32940\t10005\n32940\t10006\n32940\t10007\n32940\t10008\n32940\t10009\n32940\t10010\n32940\t10011\n32940\t10012\n32940\t10013\n32940\t10014\n32940\t10015\n32940\t90001\n32940\t90002\n32940\t90003\n32940\t90004\n32940\t90005\n32940\t90006\n32940\t90007\n32940\t90008\n32940\t90009\n32940\t90010\n32940\t90011\n32940\t90012\n32940\t90013\n32940\t90014\n32940\t90015\n34615\t10001\n34615\t10002\n34615\t10003\n34615\t10004\n34615\t10005\n34615\t10006\n34615\t10007\n34615\t10008\n34615\t10009\n34615\t10010\n34615\t10011\n34615\t10012\n34615\t10013\n34615\t10014\n34615\t10015\n34615\t90001\n34615\t90002\n34615\t90003\n34615\t90004\n34615\t90005\n34615\t90006\n34615\t90007\n34615\t90008\n34615\t90009\n34615\t90010\n34615\t90011\n34615\t90012\n34615\t90013\n34615\t90014\n34615\t90015\n34643\t10001\n34643\t10002\n34643\t10003\n34643\t10004\n34643\t10005\n34643\t10006\n34643\t10007\n34643\t10008\n34643\t10009\n34643\t10010\n34643\t10011\n34643\t10012\n34643\t10013\n34643\t10014\n34643\t10015\n34643\t90001\n34643\t90002\n34643\t90003\n34643\t90004\n34643\t90005\n34643\t90006\n34643\t90007\n34643\t90008\n34643\t90009\n34643\t90010\n34643\t90011\n34643\t90012\n34643\t90013\n34643\t90014\n34643\t90015\n36401\t10001\n36401\t10002\n36401\t10003\n36401\t10004\n36401\t10005\n36401\t10006\n36401\t10007\n36401\t10008\n36401\t10009\n36401\t10010\n36401\t10011\n36401\t10012\n36401\t10013\n36401\t10014\n36401\t10015\n36401\t90001\n36401\t90002\n36401\t90003\n36401\t90004\n36401\t90005\n36401\t90006\n36401\t90007\n36401\t90008\n36401\t90009\n36401\t90010\n36401\t90011\n36401\t90012\n36401\t90013\n36401\t90014\n36401\t90015\n38808\t10001\n38808\t10002\n38808\t10003\n38808\t10004\n38808\t10005\n38808\t10006\n38808\t10007\n38808\t10008\n38808\t10009\n38808\t10010\n38808\t10011\n38808\t10012\n38808\t10013\n38808\t10014\n38808\t10015\n38808\t90001\n38808\t90002\n38808\t90003\n38808\t90004\n38808\t90005\n38808\t90006\n38808\t90007\n38808\t90008\n38808\t90009\n38808\t90010\n38808\t90011\n38808\t90012\n38808\t90013\n38808\t90014\n38808\t90015\n39819\t10001\n39819\t10002\n39819\t10003\n39819\t10004\n39819\t10005\n39819\t10006\n39819\t10007\n39819\t10008\n39819\t10009\n39819\t10010\n39819\t10011\n39819\t10012\n39819\t10013\n39819\t10014\n39819\t10015\n39819\t90001\n39819\t90002\n39819\t90003\n39819\t90004\n39819\t90005\n39819\t90006\n39819\t90007\n39819\t90008\n39819\t90009\n39819\t90010\n39819\t90011\n39819\t90012\n39819\t90013\n39819\t90014\n39819\t90015\n44954\t10001\n44954\t10002\n44954\t10003\n44954\t10004\n44954\t10005\n44954\t10006\n44954\t10007\n44954\t10008\n44954\t10009\n44954\t10010\n44954\t10011\n44954\t10012\n44954\t10013\n44954\t10014\n44954\t10015\n44954\t90001\n44954\t90002\n44954\t90003\n44954\t90004\n44954\t90005\n44954\t90006\n44954\t90007\n44954\t90008\n44954\t90009\n44954\t90010\n44954\t90011\n44954\t90012\n44954\t90013\n44954\t90014\n44954\t90015\n46843\t10001\n46843\t10002\n46843\t10003\n46843\t10004\n46843\t10005\n46843\t10006\n46843\t10007\n46843\t10008\n46843\t10009\n46843\t10010\n46843\t10011\n46843\t10012\n46843\t10013\n46843\t10014\n46843\t10015\n46843\t90001\n46843\t90002\n46843\t90003\n46843\t90004\n46843\t90005\n46843\t90006\n46843\t90007\n46843\t90008\n46843\t90009\n46843\t90010\n46843\t90011\n46843\t90012\n46843\t90013\n46843\t90014\n46843\t90015\n57462\t10001\n57462\t10002\n57462\t10003\n57462\t10004\n57462\t10005\n57462\t10006\n57462\t10007\n57462\t10008\n57462\t10009\n57462\t10010\n57462\t10011\n57462\t10012\n57462\t10013\n57462\t10014\n57462\t10015\n57462\t90001\n57462\t90002\n57462\t90003\n57462\t90004\n57462\t90005\n57462\t90006\n57462\t90007\n57462\t90008\n57462\t90009\n57462\t90010\n57462\t90011\n57462\t90012\n57462\t90013\n57462\t90014\n57462\t90015\n61945\t10001\n61945\t10002\n61945\t10003\n61945\t10004\n61945\t10005\n61945\t10006\n61945\t10007\n61945\t10008\n61945\t10009\n61945\t10010\n61945\t10011\n61945\t10012\n61945\t10013\n61945\t10014\n61945\t10015\n61945\t90001\n61945\t90002\n61945\t90003\n61945\t90004\n61945\t90005\n61945\t90006\n61945\t90007\n61945\t90008\n61945\t90009\n61945\t90010\n61945\t90011\n61945\t90012\n61945\t90013\n61945\t90014\n61945\t90015\n66348\t10001\n66348\t10002\n66348\t10003\n66348\t10004\n66348\t10005\n66348\t10006\n66348\t10007\n66348\t10008\n66348\t10009\n66348\t10010\n66348\t10011\n66348\t10012\n66348\t10013\n66348\t10014\n66348\t10015\n66348\t90001\n66348\t90002\n66348\t90003\n66348\t90004\n66348\t90005\n66348\t90006\n66348\t90007\n66348\t90008\n66348\t90009\n66348\t90010\n66348\t90011\n66348\t90012\n66348\t90013\n66348\t90014\n66348\t90015\n68754\t10001\n68754\t10002\n68754\t10003\n68754\t10004\n68754\t10005\n68754\t10006\n68754\t10007\n68754\t10008\n68754\t10009\n68754\t10010\n68754\t10011\n68754\t10012\n68754\t10013\n68754\t10014\n68754\t10015\n68754\t90001\n68754\t90002\n68754\t90003\n68754\t90004\n68754\t90005\n68754\t90006\n68754\t90007\n68754\t90008\n68754\t90009\n68754\t90010\n68754\t90011\n68754\t90012\n68754\t90013\n68754\t90014\n68754\t90015\n70281\t10001\n70281\t10002\n70281\t10003\n70281\t10004\n70281\t10005\n70281\t10006\n70281\t10007\n70281\t10008\n70281\t10009\n70281\t10010\n70281\t10011\n70281\t10012\n70281\t10013\n70281\t10014\n70281\t10015\n70281\t90001\n70281\t90002\n70281\t90003\n70281\t90004\n70281\t90005\n70281\t90006\n70281\t90007\n70281\t90008\n70281\t90009\n70281\t90010\n70281\t90011\n70281\t90012\n70281\t90013\n70281\t90014\n70281\t90015\n72875\t10001\n72875\t10002\n72875\t10003\n72875\t10004\n72875\t10005\n72875\t10006\n72875\t10007\n72875\t10008\n72875\t10009\n72875\t10010\n72875\t10011\n72875\t10012\n72875\t10013\n72875\t10014\n72875\t10015\n72875\t90001\n72875\t90002\n72875\t90003\n72875\t90004\n72875\t90005\n72875\t90006\n72875\t90007\n72875\t90008\n72875\t90009\n72875\t90010\n72875\t90011\n72875\t90012\n72875\t90013\n72875\t90014\n72875\t90015\n79586\t10001\n79586\t10002\n79586\t10003\n79586\t10004\n79586\t10005\n79586\t10006\n79586\t10007\n79586\t10008\n79586\t10009\n79586\t10010\n79586\t10011\n79586\t10012\n79586\t10013\n79586\t10014\n79586\t10015\n79586\t90001\n79586\t90002\n79586\t90003\n79586\t90004\n79586\t90005\n79586\t90006\n79586\t90007\n79586\t90008\n79586\t90009\n79586\t90010\n79586\t90011\n79586\t90012\n79586\t90013\n79586\t90014\n79586\t90015\n80374\t10001\n80374\t10002\n80374\t10003\n80374\t10004\n80374\t10005\n80374\t10006\n80374\t10007\n80374\t10008\n80374\t10009\n80374\t10010\n80374\t10011\n80374\t10012\n80374\t10013\n80374\t10014\n80374\t10015\n80374\t90001\n80374\t90002\n80374\t90003\n80374\t90004\n80374\t90005\n80374\t90006\n80374\t90007\n80374\t90008\n80374\t90009\n80374\t90010\n80374\t90011\n80374\t90012\n80374\t90013\n80374\t90014\n80374\t90015\n82059\t10001\n82059\t10002\n82059\t10003\n82059\t10004\n82059\t10005\n82059\t10006\n82059\t10007\n82059\t10008\n82059\t10009\n82059\t10010\n82059\t10011\n82059\t10012\n82059\t10013\n82059\t10014\n82059\t10015\n82059\t90001\n82059\t90002\n82059\t90003\n82059\t90004\n82059\t90005\n82059\t90006\n82059\t90007\n82059\t90008\n82059\t90009\n82059\t90010\n82059\t90011\n82059\t90012\n82059\t90013\n82059\t90014\n82059\t90015\n85152\t10001\n85152\t10002\n85152\t10003\n85152\t10004\n85152\t10005\n85152\t10006\n85152\t10007\n85152\t10008\n85152\t10009\n85152\t10010\n85152\t10011\n85152\t10012\n85152\t10013\n85152\t10014\n85152\t10015\n85152\t90001\n85152\t90002\n85152\t90003\n85152\t90004\n85152\t90005\n85152\t90006\n85152\t90007\n85152\t90008\n85152\t90009\n85152\t90010\n85152\t90011\n85152\t90012\n85152\t90013\n85152\t90014\n85152\t90015\n88190\t10001\n88190\t10002\n88190\t10003\n88190\t10004\n88190\t10005\n88190\t10006\n88190\t10007\n88190\t10008\n88190\t10009\n88190\t10010\n88190\t10011\n88190\t10012\n88190\t10013\n88190\t10014\n88190\t10015\n88190\t90001\n88190\t90002\n88190\t90003\n88190\t90004\n88190\t90005\n88190\t90006\n88190\t90007\n88190\t90008\n88190\t90009\n88190\t90010\n88190\t90011\n88190\t90012\n88190\t90013\n88190\t90014\n88190\t90015\n89887\t10001\n89887\t10002\n89887\t10003\n89887\t10004\n89887\t10005\n89887\t10006\n89887\t10007\n89887\t10008\n89887\t10009\n89887\t10010\n89887\t10011\n89887\t10012\n89887\t10013\n89887\t10014\n89887\t10015\n89887\t90001\n89887\t90002\n89887\t90003\n89887\t90004\n89887\t90005\n89887\t90006\n89887\t90007\n89887\t90008\n89887\t90009\n89887\t90010\n89887\t90011\n89887\t90012\n89887\t90013\n89887\t90014\n89887\t90015\n90162\t10001\n90162\t10002\n90162\t10003\n90162\t10004\n90162\t10005\n90162\t10006\n90162\t10007\n90162\t10008\n90162\t10009\n90162\t10010\n90162\t10011\n90162\t10012\n90162\t10013\n90162\t10014\n90162\t10015\n90162\t90001\n90162\t90002\n90162\t90003\n90162\t90004\n90162\t90005\n90162\t90006\n90162\t90007\n90162\t90008\n90162\t90009\n90162\t90010\n90162\t90011\n90162\t90012\n90162\t90013\n90162\t90014\n90162\t90015\n97911\t10001\n97911\t10002\n97911\t10003\n97911\t10004\n97911\t10005\n97911\t10006\n97911\t10007\n97911\t10008\n97911\t10009\n97911\t10010\n97911\t10011\n97911\t10012\n97911\t10013\n97911\t10014\n97911\t10015\n97911\t90001\n97911\t90002\n97911\t90003\n97911\t90004\n97911\t90005\n97911\t90006\n97911\t90007\n97911\t90008\n97911\t90009\n97911\t90010\n97911\t90011\n97911\t90012\n97911\t90013\n97911\t90014\n97911\t90015\n"
      },
      "dateCreated": "Apr 19, 2016 9:11:44 PM",
      "dateStarted": "Jun 17, 2016 2:02:55 AM",
      "dateFinished": "Jun 17, 2016 2:02:58 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Generate Recommendations for (user, Item) Pairs without existing ratings",
      "text": "val recommendationsDF \u003d bestRecommendationModel.transform(allDistinctUserItemPairsDF)\n  .as(\"recommendations\")\n  .cache()\n  \nz.show(recommendationsDF.sort($\"userId\", $\"itemId\"))",
      "dateUpdated": "Jun 17, 2016 2:23:10 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464991903856_-1906023745",
      "id": "20160603-221143_1134516290",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "recommendationsDF: org.apache.spark.sql.DataFrame \u003d [userId: int, itemId: bigint, prediction: float]\n"
      },
      "dateCreated": "Jun 3, 2016 10:11:43 PM",
      "dateStarted": "Jun 17, 2016 2:02:56 AM",
      "dateFinished": "Jun 17, 2016 2:03:00 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Enrich the Recommendations",
      "text": "val enrichedRecommendationsDF \u003d \n   recommendationsDF.join(itemsDF, $\"items.itemId\" \u003d\u003d\u003d $\"recommendations.itemId\")\n   .select($\"userId\", $\"items.itemId\", $\"title\", $\"tags\", $\"prediction\", $\"img\")\n   .sort($\"userId\", $\"prediction\" desc, $\"items.itemId\")\n   .na.drop(Seq(\"prediction\"))\n   \nz.show(enrichedRecommendationsDF.select($\"userId\", $\"itemId\", $\"title\", $\"prediction\"))",
      "dateUpdated": "Jun 17, 2016 1:59:27 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 294.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464987868025_89875713",
      "id": "20160603-210428_1545017316",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\titemId\ttitle\tprediction\n5980\t10011\tJohn Travolta\t1.0209402\n5980\t10009\tChazz Palminteri\t1.0084537\n5980\t90007\tAngell Conwell\t1.0064986\n5980\t10006\tTom Cruise\t1.0052832\n5980\t10008\tRobert De Niro\t1.0041333\n5980\t10001\tLeonardo DiCaprio\t1.001754\n5980\t10010\tTom Hanks\t0.9996849\n5980\t10012\tJohnny Depp\t0.99960995\n5980\t90010\tTiffani Thiessen\t0.99946874\n5980\t10002\tAnthony Hopkins\t0.9993752\n5980\t90014\tGail O\u0027Grady\t0.9989812\n5980\t90009\tPam Grier\t0.9989714\n5980\t90011\tAshley Judd\t0.998726\n5980\t90015\tBarbara Niven\t0.9924766\n5980\t90006\tTatyana Ali\t0.9887809\n5980\t90005\tKeshia Knight Pulliam\t0.9885423\n5980\t10007\tDenzel Washington\t0.98449755\n5980\t10004\tMorgan Freeman\t0.96888846\n5980\t10005\tJames Gandolfini\t0.96827364\n5980\t10013\tMark Wahlberg\t0.9662345\n5980\t90013\tSofia Vergara\t0.9395701\n5980\t90004\tBobbie Phillips\t0.93834\n5980\t90001\tLinda Blair\t0.9095619\n5980\t90003\tRosalind Allen\t0.8634298\n5980\t10014\tJames Franco\t0.8620511\n5980\t90008\tShannah Laumeister\t0.80944574\n5980\t10003\tAl Pacino\t0.72481537\n5980\t90002\tShannon Whirry\t0.7001362\n5980\t90012\tStacey Dash\t0.47778273\n5980\t10015\tClive Owen\t0.28739804\n21141\t10014\tJames Franco\t1.0298843\n21141\t90004\tBobbie Phillips\t1.029716\n21141\t10005\tJames Gandolfini\t1.0289905\n21141\t10001\tLeonardo DiCaprio\t1.0235033\n21141\t10006\tTom Cruise\t1.0219728\n21141\t10012\tJohnny Depp\t1.0203068\n21141\t10009\tChazz Palminteri\t1.0139447\n21141\t90014\tGail O\u0027Grady\t1.0021034\n21141\t90011\tAshley Judd\t1.0006576\n21141\t10002\tAnthony Hopkins\t1.0005192\n21141\t90003\tRosalind Allen\t1.0003161\n21141\t90001\tLinda Blair\t0.99995273\n21141\t10004\tMorgan Freeman\t0.99944645\n21141\t90002\tShannon Whirry\t0.9991468\n21141\t10003\tAl Pacino\t0.9977234\n21141\t90015\tBarbara Niven\t0.9944966\n21141\t90005\tKeshia Knight Pulliam\t0.98964\n21141\t10007\tDenzel Washington\t0.9882703\n21141\t90013\tSofia Vergara\t0.9711784\n21141\t90010\tTiffani Thiessen\t0.9649779\n21141\t10011\tJohn Travolta\t0.95333314\n21141\t10013\tMark Wahlberg\t0.9481988\n21141\t90007\tAngell Conwell\t0.9383023\n21141\t90006\tTatyana Ali\t0.9269475\n21141\t90009\tPam Grier\t0.92265165\n21141\t10008\tRobert De Niro\t0.9038657\n21141\t10010\tTom Hanks\t0.8819663\n21141\t90008\tShannah Laumeister\t0.7943734\n21141\t90012\tStacey Dash\t0.6185258\n21141\t10015\tClive Owen\t0.48892266\n21619\t90004\tBobbie Phillips\t1.0359355\n21619\t10012\tJohnny Depp\t1.0011355\n21619\t90015\tBarbara Niven\t0.99982655\n21619\t10013\tMark Wahlberg\t0.9995149\n21619\t90013\tSofia Vergara\t0.99950206\n21619\t10014\tJames Franco\t0.9993589\n21619\t10001\tLeonardo DiCaprio\t0.99885356\n21619\t10006\tTom Cruise\t0.99870753\n21619\t90001\tLinda Blair\t0.9986216\n21619\t10005\tJames Gandolfini\t0.99509215\n21619\t10009\tChazz Palminteri\t0.9938929\n21619\t90005\tKeshia Knight Pulliam\t0.9743254\n21619\t10007\tDenzel Washington\t0.9727103\n21619\t90011\tAshley Judd\t0.9367481\n21619\t10011\tJohn Travolta\t0.93041825\n21619\t90014\tGail O\u0027Grady\t0.9222268\n21619\t90006\tTatyana Ali\t0.90861475\n21619\t10010\tTom Hanks\t0.9043147\n21619\t90007\tAngell Conwell\t0.9032316\n21619\t90009\tPam Grier\t0.8991815\n21619\t10004\tMorgan Freeman\t0.88628936\n21619\t10002\tAnthony Hopkins\t0.87594205\n21619\t10008\tRobert De Niro\t0.87102795\n21619\t90010\tTiffani Thiessen\t0.8671758\n21619\t90003\tRosalind Allen\t0.8467749\n21619\t90008\tShannah Laumeister\t0.73351103\n21619\t10003\tAl Pacino\t0.69946486\n21619\t90002\tShannon Whirry\t0.6844826\n21619\t90012\tStacey Dash\t0.506091\n21619\t10015\tClive Owen\t0.33512402\n27981\t10001\tLeonardo DiCaprio\t1.0245693\n27981\t10009\tChazz Palminteri\t1.0100505\n27981\t90009\tPam Grier\t1.0011265\n27981\t10006\tTom Cruise\t1.0004905\n27981\t90011\tAshley Judd\t0.99997044\n27981\t10007\tDenzel Washington\t0.99918103\n27981\t90010\tTiffani Thiessen\t0.9989511\n27981\t10008\tRobert De Niro\t0.9984618\n27981\t90005\tKeshia Knight Pulliam\t0.99491125\n27981\t90006\tTatyana Ali\t0.9797224\n27981\t90007\tAngell Conwell\t0.97101426\n27981\t10013\tMark Wahlberg\t0.9639591\n27981\t10012\tJohnny Depp\t0.9639223\n27981\t10005\tJames Gandolfini\t0.9549588\n27981\t10011\tJohn Travolta\t0.95461327\n27981\t10010\tTom Hanks\t0.939605\n27981\t10004\tMorgan Freeman\t0.9162731\n27981\t90015\tBarbara Niven\t0.90344673\n27981\t90004\tBobbie Phillips\t0.8976822\n27981\t10002\tAnthony Hopkins\t0.8944925\n27981\t90014\tGail O\u0027Grady\t0.85078025\n27981\t10014\tJames Franco\t0.8482121\n27981\t90013\tSofia Vergara\t0.81193554\n27981\t90001\tLinda Blair\t0.7927447\n27981\t90003\tRosalind Allen\t0.79248583\n27981\t90008\tShannah Laumeister\t0.78377056\n27981\t10003\tAl Pacino\t0.60613275\n27981\t90002\tShannon Whirry\t0.57422423\n27981\t90012\tStacey Dash\t0.39881775\n27981\t10015\tClive Owen\t0.2556518\n28024\t90005\tKeshia Knight Pulliam\t1.0163808\n28024\t10009\tChazz Palminteri\t1.0081905\n28024\t10004\tMorgan Freeman\t1.0005531\n28024\t10001\tLeonardo DiCaprio\t1.0001059\n28024\t90007\tAngell Conwell\t1.0000536\n28024\t90006\tTatyana Ali\t1.0000329\n28024\t10006\tTom Cruise\t0.99963415\n28024\t90003\tRosalind Allen\t0.9974345\n28024\t10012\tJohnny Depp\t0.99512994\n28024\t10013\tMark Wahlberg\t0.99143183\n28024\t10011\tJohn Travolta\t0.99109113\n28024\t90004\tBobbie Phillips\t0.9854568\n28024\t90009\tPam Grier\t0.9836996\n28024\t90015\tBarbara Niven\t0.9829861\n28024\t90010\tTiffani Thiessen\t0.9828218\n28024\t10005\tJames Gandolfini\t0.9771342\n28024\t10007\tDenzel Washington\t0.97607744\n28024\t10002\tAnthony Hopkins\t0.97402227\n28024\t10014\tJames Franco\t0.9391276\n28024\t10010\tTom Hanks\t0.9391153\n28024\t90011\tAshley Judd\t0.93653667\n28024\t10008\tRobert De Niro\t0.936342\n28024\t90001\tLinda Blair\t0.9352701\n28024\t90013\tSofia Vergara\t0.90499127\n28024\t90008\tShannah Laumeister\t0.8806263\n28024\t90014\tGail O\u0027Grady\t0.8794954\n28024\t10003\tAl Pacino\t0.77861\n28024\t90002\tShannon Whirry\t0.7524612\n28024\t90012\tStacey Dash\t0.6013796\n28024\t10015\tClive Owen\t0.4604788\n28865\t10002\tAnthony Hopkins\t1.0593374\n28865\t90003\tRosalind Allen\t1.0449154\n28865\t90010\tTiffani Thiessen\t1.0363435\n28865\t90014\tGail O\u0027Grady\t1.0208311\n28865\t10005\tJames Gandolfini\t1.0200907\n28865\t10009\tChazz Palminteri\t1.0194862\n28865\t10004\tMorgan Freeman\t1.018719\n28865\t90001\tLinda Blair\t1.0167549\n28865\t10006\tTom Cruise\t1.006906\n28865\t10001\tLeonardo DiCaprio\t1.0022031\n28865\t10007\tDenzel Washington\t1.0007274\n28865\t90004\tBobbie Phillips\t0.9995917\n28865\t90009\tPam Grier\t0.9990057\n28865\t90011\tAshley Judd\t0.99832004\n28865\t10003\tAl Pacino\t0.99721044\n28865\t10012\tJohnny Depp\t0.99384165\n28865\t90015\tBarbara Niven\t0.9914104\n28865\t90005\tKeshia Knight Pulliam\t0.9889686\n28865\t10014\tJames Franco\t0.9809787\n28865\t90007\tAngell Conwell\t0.977884\n28865\t90002\tShannon Whirry\t0.9761485\n28865\t10011\tJohn Travolta\t0.9749881\n28865\t90013\tSofia Vergara\t0.9712661\n28865\t10008\tRobert De Niro\t0.9625642\n28865\t90006\tTatyana Ali\t0.9608332\n28865\t10013\tMark Wahlberg\t0.94604933\n28865\t10010\tTom Hanks\t0.90713334\n28865\t90008\tShannah Laumeister\t0.8030499\n28865\t90012\tStacey Dash\t0.6663289\n28865\t10015\tClive Owen\t0.51748466\n30699\t10001\tLeonardo DiCaprio\t1.0001408\n30699\t90011\tAshley Judd\t0.99940157\n30699\t10006\tTom Cruise\t0.86449313\n30699\t10009\tChazz Palminteri\t0.7912998\n30699\t10012\tJohnny Depp\t0.78962904\n30699\t10008\tRobert De Niro\t0.78571\n30699\t90009\tPam Grier\t0.780195\n30699\t90005\tKeshia Knight Pulliam\t0.77497387\n30699\t90006\tTatyana Ali\t0.77343065\n30699\t90010\tTiffani Thiessen\t0.76854897\n30699\t10010\tTom Hanks\t0.75925076\n30699\t10007\tDenzel Washington\t0.75896895\n30699\t10013\tMark Wahlberg\t0.75647897\n30699\t10011\tJohn Travolta\t0.75609547\n30699\t90007\tAngell Conwell\t0.7397666\n30699\t90004\tBobbie Phillips\t0.7245861\n30699\t90015\tBarbara Niven\t0.7224626\n30699\t10005\tJames Gandolfini\t0.7132757\n30699\t90014\tGail O\u0027Grady\t0.70771444\n30699\t10014\tJames Franco\t0.70054996\n30699\t90013\tSofia Vergara\t0.68852836\n30699\t10002\tAnthony Hopkins\t0.6616212\n30699\t10004\tMorgan Freeman\t0.65769804\n30699\t90001\tLinda Blair\t0.63358116\n30699\t90008\tShannah Laumeister\t0.57996976\n30699\t90003\tRosalind Allen\t0.5764947\n30699\t90002\tShannon Whirry\t0.47758707\n30699\t10003\tAl Pacino\t0.47724628\n30699\t90012\tStacey Dash\t0.32539392\n30699\t10015\tClive Owen\t0.20969753\n32940\t90003\tRosalind Allen\t1.3546615\n32940\t10003\tAl Pacino\t1.1521003\n32940\t10001\tLeonardo DiCaprio\t1.1416616\n32940\t90010\tTiffani Thiessen\t1.1352477\n32940\t90002\tShannon Whirry\t1.1150414\n32940\t10014\tJames Franco\t1.1010132\n32940\t90009\tPam Grier\t1.1006181\n32940\t90001\tLinda Blair\t1.0941416\n32940\t90004\tBobbie Phillips\t1.088293\n32940\t10002\tAnthony Hopkins\t1.0866525\n32940\t10004\tMorgan Freeman\t1.0824353\n32940\t10006\tTom Cruise\t1.063761\n32940\t90011\tAshley Judd\t1.050073\n32940\t10009\tChazz Palminteri\t1.035897\n32940\t90006\tTatyana Ali\t1.0319026\n32940\t90005\tKeshia Knight Pulliam\t1.0282038\n32940\t10005\tJames Gandolfini\t1.0002142\n32940\t90015\tBarbara Niven\t1.0000681\n32940\t90013\tSofia Vergara\t0.9999176\n32940\t90012\tStacey Dash\t0.9999033\n32940\t10007\tDenzel Washington\t0.99981236\n32940\t10015\tClive Owen\t0.99346596\n32940\t90007\tAngell Conwell\t0.9934135\n32940\t10012\tJohnny Depp\t0.9928874\n32940\t10011\tJohn Travolta\t0.9810018\n32940\t10013\tMark Wahlberg\t0.96861386\n32940\t10008\tRobert De Niro\t0.9294747\n32940\t90008\tShannah Laumeister\t0.9168315\n32940\t90014\tGail O\u0027Grady\t0.89970267\n32940\t10010\tTom Hanks\t0.8586972\n34615\t10001\tLeonardo DiCaprio\t1.0155718\n34615\t90004\tBobbie Phillips\t1.0021303\n34615\t10006\tTom Cruise\t1.0006423\n34615\t10014\tJames Franco\t1.0001161\n34615\t90014\tGail O\u0027Grady\t0.9999709\n34615\t90011\tAshley Judd\t0.99980354\n34615\t10012\tJohnny Depp\t0.9995138\n34615\t90002\tShannon Whirry\t0.9970867\n34615\t10003\tAl Pacino\t0.9859032\n34615\t10002\tAnthony Hopkins\t0.98368734\n34615\t90001\tLinda Blair\t0.9829559\n34615\t10005\tJames Gandolfini\t0.9827373\n34615\t90015\tBarbara Niven\t0.9814057\n34615\t10009\tChazz Palminteri\t0.9786612\n34615\t90003\tRosalind Allen\t0.9783651\n34615\t10004\tMorgan Freeman\t0.96974385\n34615\t90013\tSofia Vergara\t0.9612347\n34615\t90005\tKeshia Knight Pulliam\t0.9579621\n34615\t10007\tDenzel Washington\t0.9411446\n34615\t10011\tJohn Travolta\t0.936674\n34615\t90010\tTiffani Thiessen\t0.9225333\n34615\t90007\tAngell Conwell\t0.91402125\n34615\t10013\tMark Wahlberg\t0.9138881\n34615\t90006\tTatyana Ali\t0.9008821\n34615\t90009\tPam Grier\t0.88010985\n34615\t10010\tTom Hanks\t0.8769321\n34615\t10008\tRobert De Niro\t0.8766407\n34615\t90008\tShannah Laumeister\t0.788229\n34615\t90012\tStacey Dash\t0.6200684\n34615\t10015\tClive Owen\t0.4802459\n34643\t10001\tLeonardo DiCaprio\t1.0543225\n34643\t90011\tAshley Judd\t0.9999476\n34643\t10006\tTom Cruise\t0.99954\n34643\t10012\tJohnny Depp\t0.9596251\n34643\t10009\tChazz Palminteri\t0.93792206\n34643\t10013\tMark Wahlberg\t0.9336988\n34643\t90005\tKeshia Knight Pulliam\t0.93314046\n34643\t10007\tDenzel Washington\t0.90741247\n34643\t90004\tBobbie Phillips\t0.90680605\n34643\t90006\tTatyana Ali\t0.89706457\n34643\t10011\tJohn Travolta\t0.8897974\n34643\t90015\tBarbara Niven\t0.88263756\n34643\t10005\tJames Gandolfini\t0.877325\n34643\t90009\tPam Grier\t0.87355006\n34643\t90007\tAngell Conwell\t0.86960304\n34643\t10010\tTom Hanks\t0.86874586\n34643\t10008\tRobert De Niro\t0.8685934\n34643\t10014\tJames Franco\t0.86588323\n34643\t90010\tTiffani Thiessen\t0.86150384\n34643\t90013\tSofia Vergara\t0.8246054\n34643\t10004\tMorgan Freeman\t0.80190235\n34643\t90014\tGail O\u0027Grady\t0.7936913\n34643\t10002\tAnthony Hopkins\t0.7649652\n34643\t90001\tLinda Blair\t0.7568533\n34643\t90003\tRosalind Allen\t0.6986307\n34643\t90008\tShannah Laumeister\t0.69850147\n34643\t10003\tAl Pacino\t0.5461156\n34643\t90002\tShannon Whirry\t0.5400192\n34643\t90012\tStacey Dash\t0.34711033\n34643\t10015\tClive Owen\t0.24480563\n36401\t10001\tLeonardo DiCaprio\t1.0541246\n36401\t90011\tAshley Judd\t1.0247298\n36401\t10006\tTom Cruise\t1.0139654\n36401\t10011\tJohn Travolta\t1.0024744\n36401\t10009\tChazz Palminteri\t1.0006331\n36401\t90006\tTatyana Ali\t1.0004517\n36401\t90007\tAngell Conwell\t0.999618\n36401\t90005\tKeshia Knight Pulliam\t0.9995169\n36401\t10010\tTom Hanks\t0.9993069\n36401\t10008\tRobert De Niro\t0.9986481\n36401\t90009\tPam Grier\t0.9918442\n36401\t10012\tJohnny Depp\t0.9865226\n36401\t90010\tTiffani Thiessen\t0.97671807\n36401\t10013\tMark Wahlberg\t0.97371507\n36401\t10007\tDenzel Washington\t0.9702507\n36401\t90015\tBarbara Niven\t0.95033896\n36401\t10004\tMorgan Freeman\t0.9290148\n36401\t10005\tJames Gandolfini\t0.92538494\n36401\t10002\tAnthony Hopkins\t0.9103037\n36401\t90004\tBobbie Phillips\t0.904506\n36401\t90014\tGail O\u0027Grady\t0.88130134\n36401\t90013\tSofia Vergara\t0.8508142\n36401\t90008\tShannah Laumeister\t0.8354467\n36401\t10014\tJames Franco\t0.8253678\n36401\t90001\tLinda Blair\t0.80561066\n36401\t90003\tRosalind Allen\t0.7954776\n36401\t10003\tAl Pacino\t0.5741432\n36401\t90002\tShannon Whirry\t0.5514522\n36401\t90012\tStacey Dash\t0.4019391\n36401\t10015\tClive Owen\t0.23984575\n38808\t90005\tKeshia Knight Pulliam\t1.0018545\n38808\t10011\tJohn Travolta\t1.0009296\n38808\t10001\tLeonardo DiCaprio\t1.0004976\n38808\t90006\tTatyana Ali\t1.0002519\n38808\t10006\tTom Cruise\t0.99990684\n38808\t10012\tJohnny Depp\t0.9993721\n38808\t10013\tMark Wahlberg\t0.998878\n38808\t90007\tAngell Conwell\t0.9969387\n38808\t10009\tChazz Palminteri\t0.98728955\n38808\t10010\tTom Hanks\t0.96675795\n38808\t90009\tPam Grier\t0.9598349\n38808\t10007\tDenzel Washington\t0.9571948\n38808\t90015\tBarbara Niven\t0.956627\n38808\t90011\tAshley Judd\t0.9445896\n38808\t10008\tRobert De Niro\t0.9440291\n38808\t90010\tTiffani Thiessen\t0.9417326\n38808\t10005\tJames Gandolfini\t0.9358082\n38808\t10004\tMorgan Freeman\t0.93493736\n38808\t90004\tBobbie Phillips\t0.9266479\n38808\t10002\tAnthony Hopkins\t0.89414287\n38808\t90013\tSofia Vergara\t0.8569926\n38808\t90014\tGail O\u0027Grady\t0.84776175\n38808\t10014\tJames Franco\t0.84749204\n38808\t90008\tShannah Laumeister\t0.83192617\n38808\t90001\tLinda Blair\t0.8184301\n38808\t90003\tRosalind Allen\t0.8122783\n38808\t10003\tAl Pacino\t0.5762199\n38808\t90002\tShannon Whirry\t0.55090684\n38808\t90012\tStacey Dash\t0.40306053\n38808\t10015\tClive Owen\t0.2505258\n39819\t90001\tLinda Blair\t1.020588\n39819\t10009\tChazz Palminteri\t1.0182782\n39819\t10002\tAnthony Hopkins\t1.0159423\n39819\t10011\tJohn Travolta\t1.0129678\n39819\t10005\tJames Gandolfini\t1.0118868\n39819\t90009\tPam Grier\t1.0112863\n39819\t90006\tTatyana Ali\t1.005957\n39819\t90015\tBarbara Niven\t1.0042262\n39819\t90004\tBobbie Phillips\t1.0019618\n39819\t10006\tTom Cruise\t1.0016088\n39819\t90005\tKeshia Knight Pulliam\t1.0003664\n39819\t90010\tTiffani Thiessen\t1.0003209\n39819\t90007\tAngell Conwell\t0.99999416\n39819\t10001\tLeonardo DiCaprio\t0.999689\n39819\t10004\tMorgan Freeman\t0.9993262\n39819\t10012\tJohnny Depp\t0.9993163\n39819\t10007\tDenzel Washington\t0.9979452\n39819\t90003\tRosalind Allen\t0.99597895\n39819\t90013\tSofia Vergara\t0.9944218\n39819\t10013\tMark Wahlberg\t0.9931984\n39819\t90014\tGail O\u0027Grady\t0.97836864\n39819\t10008\tRobert De Niro\t0.9645179\n39819\t90011\tAshley Judd\t0.96395874\n39819\t10010\tTom Hanks\t0.95990896\n39819\t10014\tJames Franco\t0.95923305\n39819\t90008\tShannah Laumeister\t0.8237233\n39819\t10003\tAl Pacino\t0.8223096\n39819\t90002\tShannon Whirry\t0.78942776\n39819\t90012\tStacey Dash\t0.6475547\n39819\t10015\tClive Owen\t0.4537004\n44954\t10001\tLeonardo DiCaprio\t1.0001408\n44954\t90011\tAshley Judd\t0.99940157\n44954\t10006\tTom Cruise\t0.86449313\n44954\t10009\tChazz Palminteri\t0.7912998\n44954\t10012\tJohnny Depp\t0.78962904\n44954\t10008\tRobert De Niro\t0.78571\n44954\t90009\tPam Grier\t0.780195\n44954\t90005\tKeshia Knight Pulliam\t0.77497387\n44954\t90006\tTatyana Ali\t0.77343065\n44954\t90010\tTiffani Thiessen\t0.76854897\n44954\t10010\tTom Hanks\t0.75925076\n44954\t10007\tDenzel Washington\t0.75896895\n44954\t10013\tMark Wahlberg\t0.75647897\n44954\t10011\tJohn Travolta\t0.75609547\n44954\t90007\tAngell Conwell\t0.7397666\n44954\t90004\tBobbie Phillips\t0.7245861\n44954\t90015\tBarbara Niven\t0.7224626\n44954\t10005\tJames Gandolfini\t0.7132757\n44954\t90014\tGail O\u0027Grady\t0.70771444\n44954\t10014\tJames Franco\t0.70054996\n44954\t90013\tSofia Vergara\t0.68852836\n44954\t10002\tAnthony Hopkins\t0.6616212\n44954\t10004\tMorgan Freeman\t0.65769804\n44954\t90001\tLinda Blair\t0.63358116\n44954\t90008\tShannah Laumeister\t0.57996976\n44954\t90003\tRosalind Allen\t0.5764947\n44954\t90002\tShannon Whirry\t0.47758707\n44954\t10003\tAl Pacino\t0.47724628\n44954\t90012\tStacey Dash\t0.32539392\n44954\t10015\tClive Owen\t0.20969753\n46843\t10009\tChazz Palminteri\t1.0042107\n46843\t10006\tTom Cruise\t1.003411\n46843\t10005\tJames Gandolfini\t1.0027337\n46843\t10013\tMark Wahlberg\t1.0011772\n46843\t90004\tBobbie Phillips\t1.0007689\n46843\t10001\tLeonardo DiCaprio\t0.9996432\n46843\t90005\tKeshia Knight Pulliam\t0.99779075\n46843\t10012\tJohnny Depp\t0.99731255\n46843\t10014\tJames Franco\t0.9961534\n46843\t10007\tDenzel Washington\t0.9936874\n46843\t90011\tAshley Judd\t0.9141592\n46843\t90015\tBarbara Niven\t0.9133915\n46843\t90006\tTatyana Ali\t0.9085245\n46843\t10011\tJohn Travolta\t0.8810263\n46843\t90007\tAngell Conwell\t0.879131\n46843\t90009\tPam Grier\t0.87828916\n46843\t10004\tMorgan Freeman\t0.8691922\n46843\t90010\tTiffani Thiessen\t0.8672489\n46843\t10008\tRobert De Niro\t0.8528371\n46843\t90013\tSofia Vergara\t0.8526795\n46843\t90001\tLinda Blair\t0.8473419\n46843\t10010\tTom Hanks\t0.842045\n46843\t10002\tAnthony Hopkins\t0.78842944\n46843\t90014\tGail O\u0027Grady\t0.78510404\n46843\t90003\tRosalind Allen\t0.77356625\n46843\t90008\tShannah Laumeister\t0.7325234\n46843\t10003\tAl Pacino\t0.62416995\n46843\t90002\tShannon Whirry\t0.61028785\n46843\t90012\tStacey Dash\t0.3899278\n46843\t10015\tClive Owen\t0.2906377\n57462\t10002\tAnthony Hopkins\t1.1438079\n57462\t90003\tRosalind Allen\t1.1345353\n57462\t10004\tMorgan Freeman\t1.1117616\n57462\t90001\tLinda Blair\t1.1114867\n57462\t10005\tJames Gandolfini\t1.0794078\n57462\t90010\tTiffani Thiessen\t1.0752771\n57462\t10009\tChazz Palminteri\t1.067927\n57462\t90009\tPam Grier\t1.0661342\n57462\t90007\tAngell Conwell\t1.0605853\n57462\t90014\tGail O\u0027Grady\t1.055963\n57462\t90015\tBarbara Niven\t1.0511026\n57462\t10007\tDenzel Washington\t1.048225\n57462\t90005\tKeshia Knight Pulliam\t1.0474997\n57462\t10011\tJohn Travolta\t1.0438538\n57462\t90006\tTatyana Ali\t1.0352058\n57462\t90004\tBobbie Phillips\t1.0303476\n57462\t10008\tRobert De Niro\t1.0194141\n57462\t90013\tSofia Vergara\t1.0105686\n57462\t10012\tJohnny Depp\t1.0067633\n57462\t10001\tLeonardo DiCaprio\t1.002325\n57462\t10006\tTom Cruise\t0.9999912\n57462\t90011\tAshley Judd\t0.99882746\n57462\t10014\tJames Franco\t0.9977849\n57462\t10013\tMark Wahlberg\t0.99746966\n57462\t10010\tTom Hanks\t0.99632514\n57462\t10003\tAl Pacino\t0.9960734\n57462\t90002\tShannon Whirry\t0.96291023\n57462\t90008\tShannah Laumeister\t0.9273749\n57462\t90012\tStacey Dash\t0.7524688\n57462\t10015\tClive Owen\t0.53093266\n61945\t10009\tChazz Palminteri\t1.0058472\n61945\t90005\tKeshia Knight Pulliam\t1.0034189\n61945\t10011\tJohn Travolta\t0.9997746\n61945\t90007\tAngell Conwell\t0.9993907\n61945\t90006\tTatyana Ali\t0.9993236\n61945\t10007\tDenzel Washington\t0.99872065\n61945\t10005\tJames Gandolfini\t0.99870485\n61945\t10004\tMorgan Freeman\t0.9983984\n61945\t90009\tPam Grier\t0.98672724\n61945\t90010\tTiffani Thiessen\t0.9798288\n61945\t10012\tJohnny Depp\t0.97880226\n61945\t10013\tMark Wahlberg\t0.9787208\n61945\t10006\tTom Cruise\t0.9694402\n61945\t10008\tRobert De Niro\t0.9570504\n61945\t10001\tLeonardo DiCaprio\t0.9541271\n61945\t10010\tTom Hanks\t0.953695\n61945\t90015\tBarbara Niven\t0.95284367\n61945\t10002\tAnthony Hopkins\t0.94690436\n61945\t90004\tBobbie Phillips\t0.9338217\n61945\t90011\tAshley Judd\t0.91284674\n61945\t90014\tGail O\u0027Grady\t0.8829645\n61945\t10014\tJames Franco\t0.8713789\n61945\t90003\tRosalind Allen\t0.8686967\n61945\t90013\tSofia Vergara\t0.8656391\n61945\t90001\tLinda Blair\t0.8646975\n61945\t90008\tShannah Laumeister\t0.8473739\n61945\t10003\tAl Pacino\t0.6736824\n61945\t90002\tShannon Whirry\t0.6386592\n61945\t90012\tStacey Dash\t0.45588744\n61945\t10015\tClive Owen\t0.29817778\n66348\t10001\tLeonardo DiCaprio\t1.0527365\n66348\t90011\tAshley Judd\t1.0350113\n66348\t10006\tTom Cruise\t1.0152583\n66348\t90015\tBarbara Niven\t1.0014102\n66348\t10012\tJohnny Depp\t1.0004766\n66348\t10011\tJohn Travolta\t1.0000252\n66348\t90014\tGail O\u0027Grady\t0.9991832\n66348\t10010\tTom Hanks\t0.99862516\n66348\t90013\tSofia Vergara\t0.998248\n66348\t10009\tChazz Palminteri\t0.9707757\n66348\t10013\tMark Wahlberg\t0.9564172\n66348\t90004\tBobbie Phillips\t0.95471305\n66348\t90006\tTatyana Ali\t0.9491452\n66348\t90005\tKeshia Knight Pulliam\t0.94810855\n66348\t10008\tRobert De Niro\t0.94738454\n66348\t90007\tAngell Conwell\t0.94697237\n66348\t90009\tPam Grier\t0.932446\n66348\t10007\tDenzel Washington\t0.9323849\n66348\t90001\tLinda Blair\t0.9264096\n66348\t10005\tJames Gandolfini\t0.91912806\n66348\t10002\tAnthony Hopkins\t0.9189368\n66348\t90010\tTiffani Thiessen\t0.9053762\n66348\t10004\tMorgan Freeman\t0.8828714\n66348\t10014\tJames Franco\t0.8766076\n66348\t90003\tRosalind Allen\t0.7875984\n66348\t90008\tShannah Laumeister\t0.752218\n66348\t10003\tAl Pacino\t0.6442809\n66348\t90002\tShannon Whirry\t0.63545895\n66348\t90012\tStacey Dash\t0.46604547\n66348\t10015\tClive Owen\t0.26272404\n68754\t10001\tLeonardo DiCaprio\t1.0135002\n68754\t90009\tPam Grier\t1.0000343\n68754\t90010\tTiffani Thiessen\t0.9993835\n68754\t90011\tAshley Judd\t0.9853277\n68754\t10006\tTom Cruise\t0.977126\n68754\t10009\tChazz Palminteri\t0.97189224\n68754\t10008\tRobert De Niro\t0.9650606\n68754\t10007\tDenzel Washington\t0.9628978\n68754\t90005\tKeshia Knight Pulliam\t0.9593644\n68754\t90006\tTatyana Ali\t0.95575696\n68754\t90007\tAngell Conwell\t0.94706434\n68754\t10013\tMark Wahlberg\t0.93167526\n68754\t10011\tJohn Travolta\t0.9311121\n68754\t10012\tJohnny Depp\t0.93005425\n68754\t10005\tJames Gandolfini\t0.9122823\n68754\t10010\tTom Hanks\t0.8964645\n68754\t10004\tMorgan Freeman\t0.892176\n68754\t90015\tBarbara Niven\t0.8737166\n68754\t10002\tAnthony Hopkins\t0.8727987\n68754\t90004\tBobbie Phillips\t0.8678118\n68754\t90014\tGail O\u0027Grady\t0.8128204\n68754\t10014\tJames Franco\t0.81126374\n68754\t90003\tRosalind Allen\t0.7959035\n68754\t90013\tSofia Vergara\t0.7877289\n68754\t90001\tLinda Blair\t0.76267606\n68754\t90008\tShannah Laumeister\t0.752577\n68754\t10003\tAl Pacino\t0.6054454\n68754\t90002\tShannon Whirry\t0.5678659\n68754\t90012\tStacey Dash\t0.4033316\n68754\t10015\tClive Owen\t0.29792202\n70281\t10001\tLeonardo DiCaprio\t1.0117449\n70281\t90006\tTatyana Ali\t0.9997205\n70281\t90005\tKeshia Knight Pulliam\t0.98192716\n70281\t10006\tTom Cruise\t0.9809835\n70281\t10013\tMark Wahlberg\t0.96877533\n70281\t10012\tJohnny Depp\t0.9683074\n70281\t10011\tJohn Travolta\t0.9667493\n70281\t10009\tChazz Palminteri\t0.9657032\n70281\t90007\tAngell Conwell\t0.96513796\n70281\t90011\tAshley Judd\t0.95996433\n70281\t10010\tTom Hanks\t0.93642473\n70281\t90009\tPam Grier\t0.93556446\n70281\t10007\tDenzel Washington\t0.93448544\n70281\t10008\tRobert De Niro\t0.9238453\n70281\t90010\tTiffani Thiessen\t0.9189079\n70281\t10005\tJames Gandolfini\t0.91460073\n70281\t10004\tMorgan Freeman\t0.9057009\n70281\t90015\tBarbara Niven\t0.893928\n70281\t90004\tBobbie Phillips\t0.88695765\n70281\t10002\tAnthony Hopkins\t0.85387856\n70281\t10014\tJames Franco\t0.837217\n70281\t90008\tShannah Laumeister\t0.8213912\n70281\t90013\tSofia Vergara\t0.79958445\n70281\t90014\tGail O\u0027Grady\t0.79528546\n70281\t90003\tRosalind Allen\t0.78394413\n70281\t90001\tLinda Blair\t0.77132994\n70281\t10003\tAl Pacino\t0.5500529\n70281\t90002\tShannon Whirry\t0.5276382\n70281\t90012\tStacey Dash\t0.41839117\n70281\t10015\tClive Owen\t0.2591149\n72875\t10004\tMorgan Freeman\t1.0679209\n72875\t90007\tAngell Conwell\t1.0513954\n72875\t90005\tKeshia Knight Pulliam\t1.0467067\n72875\t90006\tTatyana Ali\t1.0413773\n72875\t10011\tJohn Travolta\t1.0379621\n72875\t10009\tChazz Palminteri\t1.0153284\n72875\t10010\tTom Hanks\t1.0003701\n72875\t10012\tJohnny Depp\t1.0002414\n72875\t90015\tBarbara Niven\t0.99984664\n72875\t10002\tAnthony Hopkins\t0.9997708\n72875\t90008\tShannah Laumeister\t0.9988556\n72875\t90003\tRosalind Allen\t0.9986552\n72875\t10013\tMark Wahlberg\t0.99728614\n72875\t90009\tPam Grier\t0.9839741\n72875\t10001\tLeonardo DiCaprio\t0.9816707\n72875\t10005\tJames Gandolfini\t0.98144186\n72875\t10006\tTom Cruise\t0.9800997\n72875\t90010\tTiffani Thiessen\t0.9790275\n72875\t10007\tDenzel Washington\t0.9761319\n72875\t90004\tBobbie Phillips\t0.96177304\n72875\t10008\tRobert De Niro\t0.95034117\n72875\t90011\tAshley Judd\t0.9151038\n72875\t90001\tLinda Blair\t0.89496756\n72875\t10014\tJames Franco\t0.89273953\n72875\t90014\tGail O\u0027Grady\t0.8617339\n72875\t90013\tSofia Vergara\t0.85963535\n72875\t10003\tAl Pacino\t0.727939\n72875\t90002\tShannon Whirry\t0.70440304\n72875\t90012\tStacey Dash\t0.5646663\n72875\t10015\tClive Owen\t0.40878475\n79586\t90003\tRosalind Allen\t1.2606084\n79586\t10002\tAnthony Hopkins\t1.164947\n79586\t90001\tLinda Blair\t1.1478903\n79586\t90006\tTatyana Ali\t1.1320674\n79586\t10004\tMorgan Freeman\t1.1271973\n79586\t90007\tAngell Conwell\t1.0854375\n79586\t10011\tJohn Travolta\t1.0705339\n79586\t90009\tPam Grier\t1.0604444\n79586\t90010\tTiffani Thiessen\t1.0594103\n79586\t90005\tKeshia Knight Pulliam\t1.0560372\n79586\t10005\tJames Gandolfini\t1.0560226\n79586\t10009\tChazz Palminteri\t1.049202\n79586\t10014\tJames Franco\t1.0408356\n79586\t10003\tAl Pacino\t1.030951\n79586\t10001\tLeonardo DiCaprio\t1.0288854\n79586\t90004\tBobbie Phillips\t1.0188992\n79586\t10013\tMark Wahlberg\t1.0125139\n79586\t10012\tJohnny Depp\t1.0060327\n79586\t90015\tBarbara Niven\t1.002777\n79586\t90011\tAshley Judd\t1.0012448\n79586\t10010\tTom Hanks\t1.0012112\n79586\t90014\tGail O\u0027Grady\t0.99994236\n79586\t10006\tTom Cruise\t0.9999018\n79586\t10008\tRobert De Niro\t0.9994195\n79586\t10007\tDenzel Washington\t0.99907446\n79586\t90002\tShannon Whirry\t0.99896455\n79586\t90013\tSofia Vergara\t0.99807405\n79586\t90008\tShannah Laumeister\t0.9979181\n79586\t90012\tStacey Dash\t0.99317145\n79586\t10015\tClive Owen\t0.6900368\n80374\t90005\tKeshia Knight Pulliam\t1.0293174\n80374\t10009\tChazz Palminteri\t1.024504\n80374\t10004\tMorgan Freeman\t1.0230527\n80374\t90007\tAngell Conwell\t1.0103621\n80374\t10005\tJames Gandolfini\t1.0021284\n80374\t10006\tTom Cruise\t1.0014929\n80374\t90006\tTatyana Ali\t1.0013549\n80374\t90009\tPam Grier\t1.0008928\n80374\t10012\tJohnny Depp\t1.0006884\n80374\t10011\tJohn Travolta\t1.0006148\n80374\t10007\tDenzel Washington\t1.0002991\n80374\t10013\tMark Wahlberg\t1.0000123\n80374\t90015\tBarbara Niven\t0.9998535\n80374\t10001\tLeonardo DiCaprio\t0.9995769\n80374\t90010\tTiffani Thiessen\t0.9982281\n80374\t90004\tBobbie Phillips\t0.9981613\n80374\t90003\tRosalind Allen\t0.9971439\n80374\t10002\tAnthony Hopkins\t0.9855927\n80374\t10010\tTom Hanks\t0.9502544\n80374\t10008\tRobert De Niro\t0.9477792\n80374\t90001\tLinda Blair\t0.9453024\n80374\t10014\tJames Franco\t0.9440506\n80374\t90011\tAshley Judd\t0.93717587\n80374\t90013\tSofia Vergara\t0.9135976\n80374\t90008\tShannah Laumeister\t0.89367306\n80374\t90014\tGail O\u0027Grady\t0.892002\n80374\t10003\tAl Pacino\t0.7808381\n80374\t90002\tShannon Whirry\t0.75136745\n80374\t90012\tStacey Dash\t0.57913446\n80374\t10015\tClive Owen\t0.4470567\n82059\t90007\tAngell Conwell\t1.0007997\n82059\t10011\tJohn Travolta\t1.0007222\n82059\t90005\tKeshia Knight Pulliam\t1.0001943\n82059\t90006\tTatyana Ali\t0.9996321\n82059\t10004\tMorgan Freeman\t0.9995845\n82059\t10010\tTom Hanks\t0.99900866\n82059\t90008\tShannah Laumeister\t0.9976494\n82059\t10001\tLeonardo DiCaprio\t0.9602489\n82059\t10012\tJohnny Depp\t0.9585051\n82059\t10009\tChazz Palminteri\t0.95506364\n82059\t90015\tBarbara Niven\t0.9456186\n82059\t10013\tMark Wahlberg\t0.94414943\n82059\t10006\tTom Cruise\t0.9323799\n82059\t10007\tDenzel Washington\t0.90395564\n82059\t10002\tAnthony Hopkins\t0.9036887\n82059\t10005\tJames Gandolfini\t0.9029046\n82059\t10008\tRobert De Niro\t0.8979136\n82059\t90011\tAshley Judd\t0.8946779\n82059\t90009\tPam Grier\t0.89109164\n82059\t90004\tBobbie Phillips\t0.8847834\n82059\t90010\tTiffani Thiessen\t0.8748516\n82059\t90003\tRosalind Allen\t0.854895\n82059\t10014\tJames Franco\t0.80629665\n82059\t90014\tGail O\u0027Grady\t0.7913848\n82059\t90001\tLinda Blair\t0.77748305\n82059\t90013\tSofia Vergara\t0.77642137\n82059\t10003\tAl Pacino\t0.569189\n82059\t90002\tShannon Whirry\t0.56148636\n82059\t90012\tStacey Dash\t0.44459242\n82059\t10015\tClive Owen\t0.27922362\n85152\t10012\tJohnny Depp\t1.0001428\n85152\t10001\tLeonardo DiCaprio\t1.0000838\n85152\t10006\tTom Cruise\t0.999956\n85152\t90015\tBarbara Niven\t0.9999555\n85152\t90004\tBobbie Phillips\t0.9998347\n85152\t90013\tSofia Vergara\t0.99815726\n85152\t10013\tMark Wahlberg\t0.9658247\n85152\t10009\tChazz Palminteri\t0.95116496\n85152\t10011\tJohn Travolta\t0.9397129\n85152\t90011\tAshley Judd\t0.93801725\n85152\t90005\tKeshia Knight Pulliam\t0.9344014\n85152\t90014\tGail O\u0027Grady\t0.9288577\n85152\t10014\tJames Franco\t0.92808664\n85152\t90001\tLinda Blair\t0.9260228\n85152\t10005\tJames Gandolfini\t0.9253708\n85152\t10007\tDenzel Washington\t0.9208574\n85152\t10010\tTom Hanks\t0.9150624\n85152\t90007\tAngell Conwell\t0.8851836\n85152\t90006\tTatyana Ali\t0.8823684\n85152\t90009\tPam Grier\t0.86537987\n85152\t10008\tRobert De Niro\t0.85220945\n85152\t10004\tMorgan Freeman\t0.84557736\n85152\t10002\tAnthony Hopkins\t0.84165573\n85152\t90010\tTiffani Thiessen\t0.83721364\n85152\t90003\tRosalind Allen\t0.77049756\n85152\t90008\tShannah Laumeister\t0.7019973\n85152\t10003\tAl Pacino\t0.63544405\n85152\t90002\tShannon Whirry\t0.6289075\n85152\t90012\tStacey Dash\t0.41938734\n85152\t10015\tClive Owen\t0.28187525\n88190\t90003\tRosalind Allen\t1.1593403\n88190\t90001\tLinda Blair\t1.1222217\n88190\t10002\tAnthony Hopkins\t1.0966305\n88190\t90011\tAshley Judd\t1.0944141\n88190\t10001\tLeonardo DiCaprio\t1.0936552\n88190\t90006\tTatyana Ali\t1.0932348\n88190\t10011\tJohn Travolta\t1.0227075\n88190\t90007\tAngell Conwell\t1.0222878\n88190\t90009\tPam Grier\t1.0174185\n88190\t90014\tGail O\u0027Grady\t1.0056438\n88190\t10009\tChazz Palminteri\t1.0011345\n88190\t10004\tMorgan Freeman\t1.001077\n88190\t90010\tTiffani Thiessen\t1.0003536\n88190\t90013\tSofia Vergara\t1.0002177\n88190\t10006\tTom Cruise\t0.99949944\n88190\t10014\tJames Franco\t0.99928486\n88190\t10010\tTom Hanks\t0.99911344\n88190\t10008\tRobert De Niro\t0.9988526\n88190\t90012\tStacey Dash\t0.9939704\n88190\t90005\tKeshia Knight Pulliam\t0.992516\n88190\t10005\tJames Gandolfini\t0.9658575\n88190\t10012\tJohnny Depp\t0.96585613\n88190\t90004\tBobbie Phillips\t0.9646819\n88190\t10013\tMark Wahlberg\t0.9624557\n88190\t90015\tBarbara Niven\t0.95447004\n88190\t10003\tAl Pacino\t0.9442177\n88190\t10007\tDenzel Washington\t0.9339181\n88190\t90002\tShannon Whirry\t0.9252145\n88190\t90008\tShannah Laumeister\t0.90652317\n88190\t10015\tClive Owen\t0.6397082\n89887\t10001\tLeonardo DiCaprio\t1.0293643\n89887\t10009\tChazz Palminteri\t1.0173286\n89887\t90015\tBarbara Niven\t1.0019073\n89887\t10006\tTom Cruise\t1.0010678\n89887\t10005\tJames Gandolfini\t1.0000775\n89887\t10007\tDenzel Washington\t0.9999432\n89887\t90011\tAshley Judd\t0.99965805\n89887\t90009\tPam Grier\t0.9990643\n89887\t90001\tLinda Blair\t0.998067\n89887\t10013\tMark Wahlberg\t0.9969369\n89887\t90005\tKeshia Knight Pulliam\t0.9955338\n89887\t90004\tBobbie Phillips\t0.99534804\n89887\t10012\tJohnny Depp\t0.9876029\n89887\t10011\tJohn Travolta\t0.9841326\n89887\t90013\tSofia Vergara\t0.98084027\n89887\t90007\tAngell Conwell\t0.97499883\n89887\t90006\tTatyana Ali\t0.971447\n89887\t90010\tTiffani Thiessen\t0.96813476\n89887\t10010\tTom Hanks\t0.96192527\n89887\t10008\tRobert De Niro\t0.96105605\n89887\t10002\tAnthony Hopkins\t0.95850885\n89887\t90014\tGail O\u0027Grady\t0.9571299\n89887\t10004\tMorgan Freeman\t0.94651496\n89887\t10014\tJames Franco\t0.9414656\n89887\t90003\tRosalind Allen\t0.9009873\n89887\t90008\tShannah Laumeister\t0.79163486\n89887\t10003\tAl Pacino\t0.72046643\n89887\t90002\tShannon Whirry\t0.69016033\n89887\t90012\tStacey Dash\t0.54872614\n89887\t10015\tClive Owen\t0.35241246\n90162\t10009\tChazz Palminteri\t1.0245717\n90162\t10001\tLeonardo DiCaprio\t1.0041226\n90162\t10011\tJohn Travolta\t1.0038347\n90162\t90005\tKeshia Knight Pulliam\t1.0013697\n90162\t10005\tJames Gandolfini\t1.0011313\n90162\t10006\tTom Cruise\t1.0006788\n90162\t90015\tBarbara Niven\t1.000509\n90162\t10007\tDenzel Washington\t1.0004816\n90162\t90014\tGail O\u0027Grady\t0.9991852\n90162\t10013\tMark Wahlberg\t0.9988503\n90162\t10008\tRobert De Niro\t0.99879616\n90162\t90007\tAngell Conwell\t0.99870646\n90162\t10010\tTom Hanks\t0.99835646\n90162\t90006\tTatyana Ali\t0.99802387\n90162\t10012\tJohnny Depp\t0.9972095\n90162\t90011\tAshley Judd\t0.9969865\n90162\t90001\tLinda Blair\t0.99677014\n90162\t10002\tAnthony Hopkins\t0.9950888\n90162\t90009\tPam Grier\t0.99464846\n90162\t90013\tSofia Vergara\t0.9787728\n90162\t90004\tBobbie Phillips\t0.9746057\n90162\t90010\tTiffani Thiessen\t0.9714699\n90162\t10004\tMorgan Freeman\t0.95311654\n90162\t10014\tJames Franco\t0.9238733\n90162\t90003\tRosalind Allen\t0.8890714\n90162\t90008\tShannah Laumeister\t0.80315256\n90162\t10003\tAl Pacino\t0.72103244\n90162\t90002\tShannon Whirry\t0.6929622\n90162\t90012\tStacey Dash\t0.55466706\n90162\t10015\tClive Owen\t0.3022465\n97911\t90015\tBarbara Niven\t1.031993\n97911\t10012\tJohnny Depp\t1.0134175\n97911\t10009\tChazz Palminteri\t1.0115331\n97911\t10011\tJohn Travolta\t1.0110059\n97911\t90013\tSofia Vergara\t1.0007817\n97911\t10006\tTom Cruise\t1.0003192\n97911\t10001\tLeonardo DiCaprio\t1.0001649\n97911\t90004\tBobbie Phillips\t1.0001358\n97911\t10010\tTom Hanks\t0.9993063\n97911\t90014\tGail O\u0027Grady\t0.99892473\n97911\t90001\tLinda Blair\t0.9978949\n97911\t90005\tKeshia Knight Pulliam\t0.9976179\n97911\t10013\tMark Wahlberg\t0.9952332\n97911\t10005\tJames Gandolfini\t0.99403095\n97911\t90007\tAngell Conwell\t0.9859015\n97911\t10007\tDenzel Washington\t0.98027176\n97911\t10002\tAnthony Hopkins\t0.9780914\n97911\t90006\tTatyana Ali\t0.9725075\n97911\t90011\tAshley Judd\t0.97176313\n97911\t10004\tMorgan Freeman\t0.96407837\n97911\t90009\tPam Grier\t0.9520225\n97911\t10008\tRobert De Niro\t0.95188284\n97911\t10014\tJames Franco\t0.93560326\n97911\t90010\tTiffani Thiessen\t0.9284007\n97911\t90003\tRosalind Allen\t0.8882201\n97911\t90008\tShannah Laumeister\t0.8272313\n97911\t10003\tAl Pacino\t0.72657573\n97911\t90002\tShannon Whirry\t0.71050864\n97911\t90012\tStacey Dash\t0.5303352\n97911\t10015\tClive Owen\t0.30956128\n"
      },
      "dateCreated": "Jun 3, 2016 9:04:28 PM",
      "dateStarted": "Jun 17, 2016 2:02:59 AM",
      "dateFinished": "Jun 17, 2016 2:03:09 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Store Recommendations in ElasticSearch",
      "text": "import org.elasticsearch.spark.sql._\n\nval esConfig \u003d Map(\"pushdown\" -\u003e \"true\", \"es.nodes\" -\u003e \"127.0.0.1\", \"es.port\" -\u003e \"9200\")\n\nenrichedRecommendationsDF.write.format(\"org.elasticsearch.spark.sql\")\n  .mode(\"overwrite\")\n  .options(esConfig)\n  .save(\"advancedspark/personalized-als\")\n\nz.show(enrichedRecommendationsDF)",
      "dateUpdated": "Jun 17, 2016 1:59:27 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "editorHide": false,
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1460922825977_-689845777",
      "id": "20160417-195345_2022099383",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\titemId\ttitle\ttags\tprediction\timg\n5980\t10011\tJohn Travolta\tEnglewood, New York, United States\t1.0209402\timg/actors/10011.jpg\n5980\t10009\tChazz Palminteri\tBronx, New York, United States\t1.0084537\timg/actors/10009.jpg\n5980\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t1.0064986\timg/actors/90007.jpg\n5980\t10006\tTom Cruise\tSyracuse, New York, United States\t1.0052832\timg/actors/10006.jpg\n5980\t10008\tRobert De Niro\tManhattan, New York, United States\t1.0041333\timg/actors/10008.jpg\n5980\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.001754\timg/actors/10001.jpg\n5980\t10010\tTom Hanks\tConcord, California, United States\t0.9996849\timg/actors/10010.jpg\n5980\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.99960995\timg/actors/10012.jpg\n5980\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.99946874\timg/actors/90010.jpg\n5980\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9993752\timg/actors/10002.jpg\n5980\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9989812\timg/actors/90014.jpg\n5980\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9989714\timg/actors/90009.jpg\n5980\t90011\tAshley Judd\tGranada Hills, California, United States\t0.998726\timg/actors/90011.jpg\n5980\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9924766\timg/actors/90015.jpg\n5980\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9887809\timg/actors/90006.jpg\n5980\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9885423\timg/actors/90005.jpg\n5980\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98449755\timg/actors/10007.jpg\n5980\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.96888846\timg/actors/10004.jpg\n5980\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.96827364\timg/actors/10005.jpg\n5980\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9662345\timg/actors/10013.jpg\n5980\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9395701\timg/actors/90013.jpg\n5980\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.93834\timg/actors/90004.jpg\n5980\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9095619\timg/actors/90001.jpg\n5980\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.8634298\timg/actors/90003.jpg\n5980\t10014\tJames Franco\tPalo Alto, California, United States\t0.8620511\timg/actors/10014.jpg\n5980\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.80944574\timg/actors/90008.jpg\n5980\t10003\tAl Pacino\tManhattan, New York, United States\t0.72481537\timg/actors/10003.jpg\n5980\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.7001362\timg/actors/90002.jpg\n5980\t90012\tStacey Dash\tBronx, New York, United States\t0.47778273\timg/actors/90012.jpg\n5980\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.28739804\timg/actors/10015.jpg\n21141\t10014\tJames Franco\tPalo Alto, California, United States\t1.0298843\timg/actors/10014.jpg\n21141\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t1.029716\timg/actors/90004.jpg\n21141\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t1.0289905\timg/actors/10005.jpg\n21141\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0235033\timg/actors/10001.jpg\n21141\t10006\tTom Cruise\tSyracuse, New York, United States\t1.0219728\timg/actors/10006.jpg\n21141\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t1.0203068\timg/actors/10012.jpg\n21141\t10009\tChazz Palminteri\tBronx, New York, United States\t1.0139447\timg/actors/10009.jpg\n21141\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t1.0021034\timg/actors/90014.jpg\n21141\t90011\tAshley Judd\tGranada Hills, California, United States\t1.0006576\timg/actors/90011.jpg\n21141\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t1.0005192\timg/actors/10002.jpg\n21141\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t1.0003161\timg/actors/90003.jpg\n21141\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.99995273\timg/actors/90001.jpg\n21141\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.99944645\timg/actors/10004.jpg\n21141\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9991468\timg/actors/90002.jpg\n21141\t10003\tAl Pacino\tManhattan, New York, United States\t0.9977234\timg/actors/10003.jpg\n21141\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9944966\timg/actors/90015.jpg\n21141\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.98964\timg/actors/90005.jpg\n21141\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9882703\timg/actors/10007.jpg\n21141\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9711784\timg/actors/90013.jpg\n21141\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9649779\timg/actors/90010.jpg\n21141\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.95333314\timg/actors/10011.jpg\n21141\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9481988\timg/actors/10013.jpg\n21141\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9383023\timg/actors/90007.jpg\n21141\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9269475\timg/actors/90006.jpg\n21141\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.92265165\timg/actors/90009.jpg\n21141\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9038657\timg/actors/10008.jpg\n21141\t10010\tTom Hanks\tConcord, California, United States\t0.8819663\timg/actors/10010.jpg\n21141\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.7943734\timg/actors/90008.jpg\n21141\t90012\tStacey Dash\tBronx, New York, United States\t0.6185258\timg/actors/90012.jpg\n21141\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.48892266\timg/actors/10015.jpg\n21619\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t1.0359355\timg/actors/90004.jpg\n21619\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t1.0011355\timg/actors/10012.jpg\n21619\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.99982655\timg/actors/90015.jpg\n21619\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9995149\timg/actors/10013.jpg\n21619\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.99950206\timg/actors/90013.jpg\n21619\t10014\tJames Franco\tPalo Alto, California, United States\t0.9993589\timg/actors/10014.jpg\n21619\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.99885356\timg/actors/10001.jpg\n21619\t10006\tTom Cruise\tSyracuse, New York, United States\t0.99870753\timg/actors/10006.jpg\n21619\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9986216\timg/actors/90001.jpg\n21619\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.99509215\timg/actors/10005.jpg\n21619\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9938929\timg/actors/10009.jpg\n21619\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9743254\timg/actors/90005.jpg\n21619\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9727103\timg/actors/10007.jpg\n21619\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9367481\timg/actors/90011.jpg\n21619\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.93041825\timg/actors/10011.jpg\n21619\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9222268\timg/actors/90014.jpg\n21619\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.90861475\timg/actors/90006.jpg\n21619\t10010\tTom Hanks\tConcord, California, United States\t0.9043147\timg/actors/10010.jpg\n21619\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9032316\timg/actors/90007.jpg\n21619\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.8991815\timg/actors/90009.jpg\n21619\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.88628936\timg/actors/10004.jpg\n21619\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.87594205\timg/actors/10002.jpg\n21619\t10008\tRobert De Niro\tManhattan, New York, United States\t0.87102795\timg/actors/10008.jpg\n21619\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.8671758\timg/actors/90010.jpg\n21619\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.8467749\timg/actors/90003.jpg\n21619\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.73351103\timg/actors/90008.jpg\n21619\t10003\tAl Pacino\tManhattan, New York, United States\t0.69946486\timg/actors/10003.jpg\n21619\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.6844826\timg/actors/90002.jpg\n21619\t90012\tStacey Dash\tBronx, New York, United States\t0.506091\timg/actors/90012.jpg\n21619\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.33512402\timg/actors/10015.jpg\n27981\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0245693\timg/actors/10001.jpg\n27981\t10009\tChazz Palminteri\tBronx, New York, United States\t1.0100505\timg/actors/10009.jpg\n27981\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t1.0011265\timg/actors/90009.jpg\n27981\t10006\tTom Cruise\tSyracuse, New York, United States\t1.0004905\timg/actors/10006.jpg\n27981\t90011\tAshley Judd\tGranada Hills, California, United States\t0.99997044\timg/actors/90011.jpg\n27981\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.99918103\timg/actors/10007.jpg\n27981\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9989511\timg/actors/90010.jpg\n27981\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9984618\timg/actors/10008.jpg\n27981\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.99491125\timg/actors/90005.jpg\n27981\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9797224\timg/actors/90006.jpg\n27981\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.97101426\timg/actors/90007.jpg\n27981\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9639591\timg/actors/10013.jpg\n27981\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9639223\timg/actors/10012.jpg\n27981\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9549588\timg/actors/10005.jpg\n27981\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.95461327\timg/actors/10011.jpg\n27981\t10010\tTom Hanks\tConcord, California, United States\t0.939605\timg/actors/10010.jpg\n27981\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9162731\timg/actors/10004.jpg\n27981\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.90344673\timg/actors/90015.jpg\n27981\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.8976822\timg/actors/90004.jpg\n27981\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.8944925\timg/actors/10002.jpg\n27981\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.85078025\timg/actors/90014.jpg\n27981\t10014\tJames Franco\tPalo Alto, California, United States\t0.8482121\timg/actors/10014.jpg\n27981\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.81193554\timg/actors/90013.jpg\n27981\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.7927447\timg/actors/90001.jpg\n27981\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.79248583\timg/actors/90003.jpg\n27981\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.78377056\timg/actors/90008.jpg\n27981\t10003\tAl Pacino\tManhattan, New York, United States\t0.60613275\timg/actors/10003.jpg\n27981\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.57422423\timg/actors/90002.jpg\n27981\t90012\tStacey Dash\tBronx, New York, United States\t0.39881775\timg/actors/90012.jpg\n27981\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.2556518\timg/actors/10015.jpg\n28024\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t1.0163808\timg/actors/90005.jpg\n28024\t10009\tChazz Palminteri\tBronx, New York, United States\t1.0081905\timg/actors/10009.jpg\n28024\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t1.0005531\timg/actors/10004.jpg\n28024\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0001059\timg/actors/10001.jpg\n28024\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t1.0000536\timg/actors/90007.jpg\n28024\t90006\tTatyana Ali\tBrooklyn, New York, United States\t1.0000329\timg/actors/90006.jpg\n28024\t10006\tTom Cruise\tSyracuse, New York, United States\t0.99963415\timg/actors/10006.jpg\n28024\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9974345\timg/actors/90003.jpg\n28024\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.99512994\timg/actors/10012.jpg\n28024\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.99143183\timg/actors/10013.jpg\n28024\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.99109113\timg/actors/10011.jpg\n28024\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9854568\timg/actors/90004.jpg\n28024\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9836996\timg/actors/90009.jpg\n28024\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9829861\timg/actors/90015.jpg\n28024\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9828218\timg/actors/90010.jpg\n28024\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9771342\timg/actors/10005.jpg\n28024\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.97607744\timg/actors/10007.jpg\n28024\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.97402227\timg/actors/10002.jpg\n28024\t10014\tJames Franco\tPalo Alto, California, United States\t0.9391276\timg/actors/10014.jpg\n28024\t10010\tTom Hanks\tConcord, California, United States\t0.9391153\timg/actors/10010.jpg\n28024\t90011\tAshley Judd\tGranada Hills, California, United States\t0.93653667\timg/actors/90011.jpg\n28024\t10008\tRobert De Niro\tManhattan, New York, United States\t0.936342\timg/actors/10008.jpg\n28024\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9352701\timg/actors/90001.jpg\n28024\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.90499127\timg/actors/90013.jpg\n28024\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.8806263\timg/actors/90008.jpg\n28024\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.8794954\timg/actors/90014.jpg\n28024\t10003\tAl Pacino\tManhattan, New York, United States\t0.77861\timg/actors/10003.jpg\n28024\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.7524612\timg/actors/90002.jpg\n28024\t90012\tStacey Dash\tBronx, New York, United States\t0.6013796\timg/actors/90012.jpg\n28024\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.4604788\timg/actors/10015.jpg\n28865\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t1.0593374\timg/actors/10002.jpg\n28865\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t1.0449154\timg/actors/90003.jpg\n28865\t90010\tTiffani Thiessen\tLong Beach, California, United States\t1.0363435\timg/actors/90010.jpg\n28865\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t1.0208311\timg/actors/90014.jpg\n28865\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t1.0200907\timg/actors/10005.jpg\n28865\t10009\tChazz Palminteri\tBronx, New York, United States\t1.0194862\timg/actors/10009.jpg\n28865\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t1.018719\timg/actors/10004.jpg\n28865\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t1.0167549\timg/actors/90001.jpg\n28865\t10006\tTom Cruise\tSyracuse, New York, United States\t1.006906\timg/actors/10006.jpg\n28865\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0022031\timg/actors/10001.jpg\n28865\t10007\tDenzel Washington\tMount Vernon, New York, United States\t1.0007274\timg/actors/10007.jpg\n28865\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9995917\timg/actors/90004.jpg\n28865\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9990057\timg/actors/90009.jpg\n28865\t90011\tAshley Judd\tGranada Hills, California, United States\t0.99832004\timg/actors/90011.jpg\n28865\t10003\tAl Pacino\tManhattan, New York, United States\t0.99721044\timg/actors/10003.jpg\n28865\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.99384165\timg/actors/10012.jpg\n28865\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9914104\timg/actors/90015.jpg\n28865\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9889686\timg/actors/90005.jpg\n28865\t10014\tJames Franco\tPalo Alto, California, United States\t0.9809787\timg/actors/10014.jpg\n28865\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.977884\timg/actors/90007.jpg\n28865\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9761485\timg/actors/90002.jpg\n28865\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9749881\timg/actors/10011.jpg\n28865\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9712661\timg/actors/90013.jpg\n28865\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9625642\timg/actors/10008.jpg\n28865\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9608332\timg/actors/90006.jpg\n28865\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.94604933\timg/actors/10013.jpg\n28865\t10010\tTom Hanks\tConcord, California, United States\t0.90713334\timg/actors/10010.jpg\n28865\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.8030499\timg/actors/90008.jpg\n28865\t90012\tStacey Dash\tBronx, New York, United States\t0.6663289\timg/actors/90012.jpg\n28865\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.51748466\timg/actors/10015.jpg\n30699\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0001408\timg/actors/10001.jpg\n30699\t90011\tAshley Judd\tGranada Hills, California, United States\t0.99940157\timg/actors/90011.jpg\n30699\t10006\tTom Cruise\tSyracuse, New York, United States\t0.86449313\timg/actors/10006.jpg\n30699\t10009\tChazz Palminteri\tBronx, New York, United States\t0.7912998\timg/actors/10009.jpg\n30699\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.78962904\timg/actors/10012.jpg\n30699\t10008\tRobert De Niro\tManhattan, New York, United States\t0.78571\timg/actors/10008.jpg\n30699\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.780195\timg/actors/90009.jpg\n30699\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.77497387\timg/actors/90005.jpg\n30699\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.77343065\timg/actors/90006.jpg\n30699\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.76854897\timg/actors/90010.jpg\n30699\t10010\tTom Hanks\tConcord, California, United States\t0.75925076\timg/actors/10010.jpg\n30699\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.75896895\timg/actors/10007.jpg\n30699\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.75647897\timg/actors/10013.jpg\n30699\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.75609547\timg/actors/10011.jpg\n30699\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.7397666\timg/actors/90007.jpg\n30699\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.7245861\timg/actors/90004.jpg\n30699\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.7224626\timg/actors/90015.jpg\n30699\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.7132757\timg/actors/10005.jpg\n30699\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.70771444\timg/actors/90014.jpg\n30699\t10014\tJames Franco\tPalo Alto, California, United States\t0.70054996\timg/actors/10014.jpg\n30699\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.68852836\timg/actors/90013.jpg\n30699\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.6616212\timg/actors/10002.jpg\n30699\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.65769804\timg/actors/10004.jpg\n30699\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.63358116\timg/actors/90001.jpg\n30699\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.57996976\timg/actors/90008.jpg\n30699\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.5764947\timg/actors/90003.jpg\n30699\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.47758707\timg/actors/90002.jpg\n30699\t10003\tAl Pacino\tManhattan, New York, United States\t0.47724628\timg/actors/10003.jpg\n30699\t90012\tStacey Dash\tBronx, New York, United States\t0.32539392\timg/actors/90012.jpg\n30699\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.20969753\timg/actors/10015.jpg\n32940\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t1.3546615\timg/actors/90003.jpg\n32940\t10003\tAl Pacino\tManhattan, New York, United States\t1.1521003\timg/actors/10003.jpg\n32940\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.1416616\timg/actors/10001.jpg\n32940\t90010\tTiffani Thiessen\tLong Beach, California, United States\t1.1352477\timg/actors/90010.jpg\n32940\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t1.1150414\timg/actors/90002.jpg\n32940\t10014\tJames Franco\tPalo Alto, California, United States\t1.1010132\timg/actors/10014.jpg\n32940\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t1.1006181\timg/actors/90009.jpg\n32940\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t1.0941416\timg/actors/90001.jpg\n32940\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t1.088293\timg/actors/90004.jpg\n32940\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t1.0866525\timg/actors/10002.jpg\n32940\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t1.0824353\timg/actors/10004.jpg\n32940\t10006\tTom Cruise\tSyracuse, New York, United States\t1.063761\timg/actors/10006.jpg\n32940\t90011\tAshley Judd\tGranada Hills, California, United States\t1.050073\timg/actors/90011.jpg\n32940\t10009\tChazz Palminteri\tBronx, New York, United States\t1.035897\timg/actors/10009.jpg\n32940\t90006\tTatyana Ali\tBrooklyn, New York, United States\t1.0319026\timg/actors/90006.jpg\n32940\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t1.0282038\timg/actors/90005.jpg\n32940\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t1.0002142\timg/actors/10005.jpg\n32940\t90015\tBarbara Niven\tPortland, Oregon, United States\t1.0000681\timg/actors/90015.jpg\n32940\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9999176\timg/actors/90013.jpg\n32940\t90012\tStacey Dash\tBronx, New York, United States\t0.9999033\timg/actors/90012.jpg\n32940\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.99981236\timg/actors/10007.jpg\n32940\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.99346596\timg/actors/10015.jpg\n32940\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9934135\timg/actors/90007.jpg\n32940\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9928874\timg/actors/10012.jpg\n32940\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9810018\timg/actors/10011.jpg\n32940\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.96861386\timg/actors/10013.jpg\n32940\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9294747\timg/actors/10008.jpg\n32940\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9168315\timg/actors/90008.jpg\n32940\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.89970267\timg/actors/90014.jpg\n32940\t10010\tTom Hanks\tConcord, California, United States\t0.8586972\timg/actors/10010.jpg\n34615\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0155718\timg/actors/10001.jpg\n34615\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t1.0021303\timg/actors/90004.jpg\n34615\t10006\tTom Cruise\tSyracuse, New York, United States\t1.0006423\timg/actors/10006.jpg\n34615\t10014\tJames Franco\tPalo Alto, California, United States\t1.0001161\timg/actors/10014.jpg\n34615\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9999709\timg/actors/90014.jpg\n34615\t90011\tAshley Judd\tGranada Hills, California, United States\t0.99980354\timg/actors/90011.jpg\n34615\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9995138\timg/actors/10012.jpg\n34615\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9970867\timg/actors/90002.jpg\n34615\t10003\tAl Pacino\tManhattan, New York, United States\t0.9859032\timg/actors/10003.jpg\n34615\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.98368734\timg/actors/10002.jpg\n34615\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9829559\timg/actors/90001.jpg\n34615\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9827373\timg/actors/10005.jpg\n34615\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9814057\timg/actors/90015.jpg\n34615\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9786612\timg/actors/10009.jpg\n34615\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9783651\timg/actors/90003.jpg\n34615\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.96974385\timg/actors/10004.jpg\n34615\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9612347\timg/actors/90013.jpg\n34615\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9579621\timg/actors/90005.jpg\n34615\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9411446\timg/actors/10007.jpg\n34615\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.936674\timg/actors/10011.jpg\n34615\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9225333\timg/actors/90010.jpg\n34615\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.91402125\timg/actors/90007.jpg\n34615\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9138881\timg/actors/10013.jpg\n34615\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9008821\timg/actors/90006.jpg\n34615\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.88010985\timg/actors/90009.jpg\n34615\t10010\tTom Hanks\tConcord, California, United States\t0.8769321\timg/actors/10010.jpg\n34615\t10008\tRobert De Niro\tManhattan, New York, United States\t0.8766407\timg/actors/10008.jpg\n34615\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.788229\timg/actors/90008.jpg\n34615\t90012\tStacey Dash\tBronx, New York, United States\t0.6200684\timg/actors/90012.jpg\n34615\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.4802459\timg/actors/10015.jpg\n34643\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0543225\timg/actors/10001.jpg\n34643\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9999476\timg/actors/90011.jpg\n34643\t10006\tTom Cruise\tSyracuse, New York, United States\t0.99954\timg/actors/10006.jpg\n34643\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9596251\timg/actors/10012.jpg\n34643\t10009\tChazz Palminteri\tBronx, New York, United States\t0.93792206\timg/actors/10009.jpg\n34643\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9336988\timg/actors/10013.jpg\n34643\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.93314046\timg/actors/90005.jpg\n34643\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.90741247\timg/actors/10007.jpg\n34643\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.90680605\timg/actors/90004.jpg\n34643\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.89706457\timg/actors/90006.jpg\n34643\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.8897974\timg/actors/10011.jpg\n34643\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.88263756\timg/actors/90015.jpg\n34643\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.877325\timg/actors/10005.jpg\n34643\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.87355006\timg/actors/90009.jpg\n34643\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.86960304\timg/actors/90007.jpg\n34643\t10010\tTom Hanks\tConcord, California, United States\t0.86874586\timg/actors/10010.jpg\n34643\t10008\tRobert De Niro\tManhattan, New York, United States\t0.8685934\timg/actors/10008.jpg\n34643\t10014\tJames Franco\tPalo Alto, California, United States\t0.86588323\timg/actors/10014.jpg\n34643\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.86150384\timg/actors/90010.jpg\n34643\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.8246054\timg/actors/90013.jpg\n34643\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.80190235\timg/actors/10004.jpg\n34643\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.7936913\timg/actors/90014.jpg\n34643\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.7649652\timg/actors/10002.jpg\n34643\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.7568533\timg/actors/90001.jpg\n34643\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.6986307\timg/actors/90003.jpg\n34643\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.69850147\timg/actors/90008.jpg\n34643\t10003\tAl Pacino\tManhattan, New York, United States\t0.5461156\timg/actors/10003.jpg\n34643\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.5400192\timg/actors/90002.jpg\n34643\t90012\tStacey Dash\tBronx, New York, United States\t0.34711033\timg/actors/90012.jpg\n34643\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.24480563\timg/actors/10015.jpg\n36401\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0541246\timg/actors/10001.jpg\n36401\t90011\tAshley Judd\tGranada Hills, California, United States\t1.0247298\timg/actors/90011.jpg\n36401\t10006\tTom Cruise\tSyracuse, New York, United States\t1.0139654\timg/actors/10006.jpg\n36401\t10011\tJohn Travolta\tEnglewood, New York, United States\t1.0024744\timg/actors/10011.jpg\n36401\t10009\tChazz Palminteri\tBronx, New York, United States\t1.0006331\timg/actors/10009.jpg\n36401\t90006\tTatyana Ali\tBrooklyn, New York, United States\t1.0004517\timg/actors/90006.jpg\n36401\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.999618\timg/actors/90007.jpg\n36401\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9995169\timg/actors/90005.jpg\n36401\t10010\tTom Hanks\tConcord, California, United States\t0.9993069\timg/actors/10010.jpg\n36401\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9986481\timg/actors/10008.jpg\n36401\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9918442\timg/actors/90009.jpg\n36401\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9865226\timg/actors/10012.jpg\n36401\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.97671807\timg/actors/90010.jpg\n36401\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.97371507\timg/actors/10013.jpg\n36401\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9702507\timg/actors/10007.jpg\n36401\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.95033896\timg/actors/90015.jpg\n36401\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9290148\timg/actors/10004.jpg\n36401\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.92538494\timg/actors/10005.jpg\n36401\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9103037\timg/actors/10002.jpg\n36401\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.904506\timg/actors/90004.jpg\n36401\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.88130134\timg/actors/90014.jpg\n36401\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.8508142\timg/actors/90013.jpg\n36401\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.8354467\timg/actors/90008.jpg\n36401\t10014\tJames Franco\tPalo Alto, California, United States\t0.8253678\timg/actors/10014.jpg\n36401\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.80561066\timg/actors/90001.jpg\n36401\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.7954776\timg/actors/90003.jpg\n36401\t10003\tAl Pacino\tManhattan, New York, United States\t0.5741432\timg/actors/10003.jpg\n36401\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.5514522\timg/actors/90002.jpg\n36401\t90012\tStacey Dash\tBronx, New York, United States\t0.4019391\timg/actors/90012.jpg\n36401\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.23984575\timg/actors/10015.jpg\n38808\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t1.0018545\timg/actors/90005.jpg\n38808\t10011\tJohn Travolta\tEnglewood, New York, United States\t1.0009296\timg/actors/10011.jpg\n38808\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0004976\timg/actors/10001.jpg\n38808\t90006\tTatyana Ali\tBrooklyn, New York, United States\t1.0002519\timg/actors/90006.jpg\n38808\t10006\tTom Cruise\tSyracuse, New York, United States\t0.99990684\timg/actors/10006.jpg\n38808\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9993721\timg/actors/10012.jpg\n38808\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.998878\timg/actors/10013.jpg\n38808\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9969387\timg/actors/90007.jpg\n38808\t10009\tChazz Palminteri\tBronx, New York, United States\t0.98728955\timg/actors/10009.jpg\n38808\t10010\tTom Hanks\tConcord, California, United States\t0.96675795\timg/actors/10010.jpg\n38808\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9598349\timg/actors/90009.jpg\n38808\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9571948\timg/actors/10007.jpg\n38808\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.956627\timg/actors/90015.jpg\n38808\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9445896\timg/actors/90011.jpg\n38808\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9440291\timg/actors/10008.jpg\n38808\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9417326\timg/actors/90010.jpg\n38808\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9358082\timg/actors/10005.jpg\n38808\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.93493736\timg/actors/10004.jpg\n38808\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9266479\timg/actors/90004.jpg\n38808\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.89414287\timg/actors/10002.jpg\n38808\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.8569926\timg/actors/90013.jpg\n38808\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.84776175\timg/actors/90014.jpg\n38808\t10014\tJames Franco\tPalo Alto, California, United States\t0.84749204\timg/actors/10014.jpg\n38808\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.83192617\timg/actors/90008.jpg\n38808\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.8184301\timg/actors/90001.jpg\n38808\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.8122783\timg/actors/90003.jpg\n38808\t10003\tAl Pacino\tManhattan, New York, United States\t0.5762199\timg/actors/10003.jpg\n38808\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.55090684\timg/actors/90002.jpg\n38808\t90012\tStacey Dash\tBronx, New York, United States\t0.40306053\timg/actors/90012.jpg\n38808\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.2505258\timg/actors/10015.jpg\n39819\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t1.020588\timg/actors/90001.jpg\n39819\t10009\tChazz Palminteri\tBronx, New York, United States\t1.0182782\timg/actors/10009.jpg\n39819\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t1.0159423\timg/actors/10002.jpg\n39819\t10011\tJohn Travolta\tEnglewood, New York, United States\t1.0129678\timg/actors/10011.jpg\n39819\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t1.0118868\timg/actors/10005.jpg\n39819\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t1.0112863\timg/actors/90009.jpg\n39819\t90006\tTatyana Ali\tBrooklyn, New York, United States\t1.005957\timg/actors/90006.jpg\n39819\t90015\tBarbara Niven\tPortland, Oregon, United States\t1.0042262\timg/actors/90015.jpg\n39819\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t1.0019618\timg/actors/90004.jpg\n39819\t10006\tTom Cruise\tSyracuse, New York, United States\t1.0016088\timg/actors/10006.jpg\n39819\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t1.0003664\timg/actors/90005.jpg\n39819\t90010\tTiffani Thiessen\tLong Beach, California, United States\t1.0003209\timg/actors/90010.jpg\n39819\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.99999416\timg/actors/90007.jpg\n39819\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.999689\timg/actors/10001.jpg\n39819\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9993262\timg/actors/10004.jpg\n39819\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9993163\timg/actors/10012.jpg\n39819\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9979452\timg/actors/10007.jpg\n39819\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.99597895\timg/actors/90003.jpg\n39819\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9944218\timg/actors/90013.jpg\n39819\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9931984\timg/actors/10013.jpg\n39819\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.97836864\timg/actors/90014.jpg\n39819\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9645179\timg/actors/10008.jpg\n39819\t90011\tAshley Judd\tGranada Hills, California, United States\t0.96395874\timg/actors/90011.jpg\n39819\t10010\tTom Hanks\tConcord, California, United States\t0.95990896\timg/actors/10010.jpg\n39819\t10014\tJames Franco\tPalo Alto, California, United States\t0.95923305\timg/actors/10014.jpg\n39819\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.8237233\timg/actors/90008.jpg\n39819\t10003\tAl Pacino\tManhattan, New York, United States\t0.8223096\timg/actors/10003.jpg\n39819\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.78942776\timg/actors/90002.jpg\n39819\t90012\tStacey Dash\tBronx, New York, United States\t0.6475547\timg/actors/90012.jpg\n39819\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.4537004\timg/actors/10015.jpg\n44954\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0001408\timg/actors/10001.jpg\n44954\t90011\tAshley Judd\tGranada Hills, California, United States\t0.99940157\timg/actors/90011.jpg\n44954\t10006\tTom Cruise\tSyracuse, New York, United States\t0.86449313\timg/actors/10006.jpg\n44954\t10009\tChazz Palminteri\tBronx, New York, United States\t0.7912998\timg/actors/10009.jpg\n44954\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.78962904\timg/actors/10012.jpg\n44954\t10008\tRobert De Niro\tManhattan, New York, United States\t0.78571\timg/actors/10008.jpg\n44954\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.780195\timg/actors/90009.jpg\n44954\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.77497387\timg/actors/90005.jpg\n44954\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.77343065\timg/actors/90006.jpg\n44954\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.76854897\timg/actors/90010.jpg\n44954\t10010\tTom Hanks\tConcord, California, United States\t0.75925076\timg/actors/10010.jpg\n44954\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.75896895\timg/actors/10007.jpg\n44954\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.75647897\timg/actors/10013.jpg\n44954\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.75609547\timg/actors/10011.jpg\n44954\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.7397666\timg/actors/90007.jpg\n44954\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.7245861\timg/actors/90004.jpg\n44954\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.7224626\timg/actors/90015.jpg\n44954\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.7132757\timg/actors/10005.jpg\n44954\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.70771444\timg/actors/90014.jpg\n44954\t10014\tJames Franco\tPalo Alto, California, United States\t0.70054996\timg/actors/10014.jpg\n44954\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.68852836\timg/actors/90013.jpg\n44954\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.6616212\timg/actors/10002.jpg\n44954\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.65769804\timg/actors/10004.jpg\n44954\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.63358116\timg/actors/90001.jpg\n44954\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.57996976\timg/actors/90008.jpg\n44954\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.5764947\timg/actors/90003.jpg\n44954\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.47758707\timg/actors/90002.jpg\n44954\t10003\tAl Pacino\tManhattan, New York, United States\t0.47724628\timg/actors/10003.jpg\n44954\t90012\tStacey Dash\tBronx, New York, United States\t0.32539392\timg/actors/90012.jpg\n44954\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.20969753\timg/actors/10015.jpg\n46843\t10009\tChazz Palminteri\tBronx, New York, United States\t1.0042107\timg/actors/10009.jpg\n46843\t10006\tTom Cruise\tSyracuse, New York, United States\t1.003411\timg/actors/10006.jpg\n46843\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t1.0027337\timg/actors/10005.jpg\n46843\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t1.0011772\timg/actors/10013.jpg\n46843\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t1.0007689\timg/actors/90004.jpg\n46843\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9996432\timg/actors/10001.jpg\n46843\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.99779075\timg/actors/90005.jpg\n46843\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.99731255\timg/actors/10012.jpg\n46843\t10014\tJames Franco\tPalo Alto, California, United States\t0.9961534\timg/actors/10014.jpg\n46843\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9936874\timg/actors/10007.jpg\n46843\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9141592\timg/actors/90011.jpg\n46843\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9133915\timg/actors/90015.jpg\n46843\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9085245\timg/actors/90006.jpg\n46843\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.8810263\timg/actors/10011.jpg\n46843\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.879131\timg/actors/90007.jpg\n46843\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.87828916\timg/actors/90009.jpg\n46843\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.8691922\timg/actors/10004.jpg\n46843\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.8672489\timg/actors/90010.jpg\n46843\t10008\tRobert De Niro\tManhattan, New York, United States\t0.8528371\timg/actors/10008.jpg\n46843\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.8526795\timg/actors/90013.jpg\n46843\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.8473419\timg/actors/90001.jpg\n46843\t10010\tTom Hanks\tConcord, California, United States\t0.842045\timg/actors/10010.jpg\n46843\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.78842944\timg/actors/10002.jpg\n46843\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.78510404\timg/actors/90014.jpg\n46843\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.77356625\timg/actors/90003.jpg\n46843\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.7325234\timg/actors/90008.jpg\n46843\t10003\tAl Pacino\tManhattan, New York, United States\t0.62416995\timg/actors/10003.jpg\n46843\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.61028785\timg/actors/90002.jpg\n46843\t90012\tStacey Dash\tBronx, New York, United States\t0.3899278\timg/actors/90012.jpg\n46843\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.2906377\timg/actors/10015.jpg\n57462\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t1.1438079\timg/actors/10002.jpg\n57462\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t1.1345353\timg/actors/90003.jpg\n57462\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t1.1117616\timg/actors/10004.jpg\n57462\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t1.1114867\timg/actors/90001.jpg\n57462\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t1.0794078\timg/actors/10005.jpg\n57462\t90010\tTiffani Thiessen\tLong Beach, California, United States\t1.0752771\timg/actors/90010.jpg\n57462\t10009\tChazz Palminteri\tBronx, New York, United States\t1.067927\timg/actors/10009.jpg\n57462\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t1.0661342\timg/actors/90009.jpg\n57462\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t1.0605853\timg/actors/90007.jpg\n57462\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t1.055963\timg/actors/90014.jpg\n57462\t90015\tBarbara Niven\tPortland, Oregon, United States\t1.0511026\timg/actors/90015.jpg\n57462\t10007\tDenzel Washington\tMount Vernon, New York, United States\t1.048225\timg/actors/10007.jpg\n57462\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t1.0474997\timg/actors/90005.jpg\n57462\t10011\tJohn Travolta\tEnglewood, New York, United States\t1.0438538\timg/actors/10011.jpg\n57462\t90006\tTatyana Ali\tBrooklyn, New York, United States\t1.0352058\timg/actors/90006.jpg\n57462\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t1.0303476\timg/actors/90004.jpg\n57462\t10008\tRobert De Niro\tManhattan, New York, United States\t1.0194141\timg/actors/10008.jpg\n57462\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t1.0105686\timg/actors/90013.jpg\n57462\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t1.0067633\timg/actors/10012.jpg\n57462\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.002325\timg/actors/10001.jpg\n57462\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9999912\timg/actors/10006.jpg\n57462\t90011\tAshley Judd\tGranada Hills, California, United States\t0.99882746\timg/actors/90011.jpg\n57462\t10014\tJames Franco\tPalo Alto, California, United States\t0.9977849\timg/actors/10014.jpg\n57462\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.99746966\timg/actors/10013.jpg\n57462\t10010\tTom Hanks\tConcord, California, United States\t0.99632514\timg/actors/10010.jpg\n57462\t10003\tAl Pacino\tManhattan, New York, United States\t0.9960734\timg/actors/10003.jpg\n57462\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.96291023\timg/actors/90002.jpg\n57462\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9273749\timg/actors/90008.jpg\n57462\t90012\tStacey Dash\tBronx, New York, United States\t0.7524688\timg/actors/90012.jpg\n57462\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.53093266\timg/actors/10015.jpg\n61945\t10009\tChazz Palminteri\tBronx, New York, United States\t1.0058472\timg/actors/10009.jpg\n61945\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t1.0034189\timg/actors/90005.jpg\n61945\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9997746\timg/actors/10011.jpg\n61945\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9993907\timg/actors/90007.jpg\n61945\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9993236\timg/actors/90006.jpg\n61945\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.99872065\timg/actors/10007.jpg\n61945\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.99870485\timg/actors/10005.jpg\n61945\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9983984\timg/actors/10004.jpg\n61945\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98672724\timg/actors/90009.jpg\n61945\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9798288\timg/actors/90010.jpg\n61945\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.97880226\timg/actors/10012.jpg\n61945\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9787208\timg/actors/10013.jpg\n61945\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9694402\timg/actors/10006.jpg\n61945\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9570504\timg/actors/10008.jpg\n61945\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9541271\timg/actors/10001.jpg\n61945\t10010\tTom Hanks\tConcord, California, United States\t0.953695\timg/actors/10010.jpg\n61945\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.95284367\timg/actors/90015.jpg\n61945\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.94690436\timg/actors/10002.jpg\n61945\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9338217\timg/actors/90004.jpg\n61945\t90011\tAshley Judd\tGranada Hills, California, United States\t0.91284674\timg/actors/90011.jpg\n61945\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.8829645\timg/actors/90014.jpg\n61945\t10014\tJames Franco\tPalo Alto, California, United States\t0.8713789\timg/actors/10014.jpg\n61945\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.8686967\timg/actors/90003.jpg\n61945\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.8656391\timg/actors/90013.jpg\n61945\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.8646975\timg/actors/90001.jpg\n61945\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.8473739\timg/actors/90008.jpg\n61945\t10003\tAl Pacino\tManhattan, New York, United States\t0.6736824\timg/actors/10003.jpg\n61945\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.6386592\timg/actors/90002.jpg\n61945\t90012\tStacey Dash\tBronx, New York, United States\t0.45588744\timg/actors/90012.jpg\n61945\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.29817778\timg/actors/10015.jpg\n66348\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0527365\timg/actors/10001.jpg\n66348\t90011\tAshley Judd\tGranada Hills, California, United States\t1.0350113\timg/actors/90011.jpg\n66348\t10006\tTom Cruise\tSyracuse, New York, United States\t1.0152583\timg/actors/10006.jpg\n66348\t90015\tBarbara Niven\tPortland, Oregon, United States\t1.0014102\timg/actors/90015.jpg\n66348\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t1.0004766\timg/actors/10012.jpg\n66348\t10011\tJohn Travolta\tEnglewood, New York, United States\t1.0000252\timg/actors/10011.jpg\n66348\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9991832\timg/actors/90014.jpg\n66348\t10010\tTom Hanks\tConcord, California, United States\t0.99862516\timg/actors/10010.jpg\n66348\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.998248\timg/actors/90013.jpg\n66348\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9707757\timg/actors/10009.jpg\n66348\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9564172\timg/actors/10013.jpg\n66348\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.95471305\timg/actors/90004.jpg\n66348\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9491452\timg/actors/90006.jpg\n66348\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.94810855\timg/actors/90005.jpg\n66348\t10008\tRobert De Niro\tManhattan, New York, United States\t0.94738454\timg/actors/10008.jpg\n66348\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.94697237\timg/actors/90007.jpg\n66348\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.932446\timg/actors/90009.jpg\n66348\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9323849\timg/actors/10007.jpg\n66348\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9264096\timg/actors/90001.jpg\n66348\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.91912806\timg/actors/10005.jpg\n66348\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9189368\timg/actors/10002.jpg\n66348\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9053762\timg/actors/90010.jpg\n66348\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.8828714\timg/actors/10004.jpg\n66348\t10014\tJames Franco\tPalo Alto, California, United States\t0.8766076\timg/actors/10014.jpg\n66348\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.7875984\timg/actors/90003.jpg\n66348\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.752218\timg/actors/90008.jpg\n66348\t10003\tAl Pacino\tManhattan, New York, United States\t0.6442809\timg/actors/10003.jpg\n66348\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.63545895\timg/actors/90002.jpg\n66348\t90012\tStacey Dash\tBronx, New York, United States\t0.46604547\timg/actors/90012.jpg\n66348\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.26272404\timg/actors/10015.jpg\n68754\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0135002\timg/actors/10001.jpg\n68754\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t1.0000343\timg/actors/90009.jpg\n68754\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9993835\timg/actors/90010.jpg\n68754\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9853277\timg/actors/90011.jpg\n68754\t10006\tTom Cruise\tSyracuse, New York, United States\t0.977126\timg/actors/10006.jpg\n68754\t10009\tChazz Palminteri\tBronx, New York, United States\t0.97189224\timg/actors/10009.jpg\n68754\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9650606\timg/actors/10008.jpg\n68754\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9628978\timg/actors/10007.jpg\n68754\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9593644\timg/actors/90005.jpg\n68754\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.95575696\timg/actors/90006.jpg\n68754\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.94706434\timg/actors/90007.jpg\n68754\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.93167526\timg/actors/10013.jpg\n68754\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9311121\timg/actors/10011.jpg\n68754\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.93005425\timg/actors/10012.jpg\n68754\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9122823\timg/actors/10005.jpg\n68754\t10010\tTom Hanks\tConcord, California, United States\t0.8964645\timg/actors/10010.jpg\n68754\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.892176\timg/actors/10004.jpg\n68754\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.8737166\timg/actors/90015.jpg\n68754\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.8727987\timg/actors/10002.jpg\n68754\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.8678118\timg/actors/90004.jpg\n68754\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.8128204\timg/actors/90014.jpg\n68754\t10014\tJames Franco\tPalo Alto, California, United States\t0.81126374\timg/actors/10014.jpg\n68754\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.7959035\timg/actors/90003.jpg\n68754\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.7877289\timg/actors/90013.jpg\n68754\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.76267606\timg/actors/90001.jpg\n68754\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.752577\timg/actors/90008.jpg\n68754\t10003\tAl Pacino\tManhattan, New York, United States\t0.6054454\timg/actors/10003.jpg\n68754\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.5678659\timg/actors/90002.jpg\n68754\t90012\tStacey Dash\tBronx, New York, United States\t0.4033316\timg/actors/90012.jpg\n68754\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.29792202\timg/actors/10015.jpg\n70281\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0117449\timg/actors/10001.jpg\n70281\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9997205\timg/actors/90006.jpg\n70281\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.98192716\timg/actors/90005.jpg\n70281\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9809835\timg/actors/10006.jpg\n70281\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.96877533\timg/actors/10013.jpg\n70281\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9683074\timg/actors/10012.jpg\n70281\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9667493\timg/actors/10011.jpg\n70281\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9657032\timg/actors/10009.jpg\n70281\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.96513796\timg/actors/90007.jpg\n70281\t90011\tAshley Judd\tGranada Hills, California, United States\t0.95996433\timg/actors/90011.jpg\n70281\t10010\tTom Hanks\tConcord, California, United States\t0.93642473\timg/actors/10010.jpg\n70281\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.93556446\timg/actors/90009.jpg\n70281\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.93448544\timg/actors/10007.jpg\n70281\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9238453\timg/actors/10008.jpg\n70281\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9189079\timg/actors/90010.jpg\n70281\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.91460073\timg/actors/10005.jpg\n70281\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9057009\timg/actors/10004.jpg\n70281\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.893928\timg/actors/90015.jpg\n70281\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.88695765\timg/actors/90004.jpg\n70281\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.85387856\timg/actors/10002.jpg\n70281\t10014\tJames Franco\tPalo Alto, California, United States\t0.837217\timg/actors/10014.jpg\n70281\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.8213912\timg/actors/90008.jpg\n70281\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.79958445\timg/actors/90013.jpg\n70281\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.79528546\timg/actors/90014.jpg\n70281\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.78394413\timg/actors/90003.jpg\n70281\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.77132994\timg/actors/90001.jpg\n70281\t10003\tAl Pacino\tManhattan, New York, United States\t0.5500529\timg/actors/10003.jpg\n70281\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.5276382\timg/actors/90002.jpg\n70281\t90012\tStacey Dash\tBronx, New York, United States\t0.41839117\timg/actors/90012.jpg\n70281\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.2591149\timg/actors/10015.jpg\n72875\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t1.0679209\timg/actors/10004.jpg\n72875\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t1.0513954\timg/actors/90007.jpg\n72875\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t1.0467067\timg/actors/90005.jpg\n72875\t90006\tTatyana Ali\tBrooklyn, New York, United States\t1.0413773\timg/actors/90006.jpg\n72875\t10011\tJohn Travolta\tEnglewood, New York, United States\t1.0379621\timg/actors/10011.jpg\n72875\t10009\tChazz Palminteri\tBronx, New York, United States\t1.0153284\timg/actors/10009.jpg\n72875\t10010\tTom Hanks\tConcord, California, United States\t1.0003701\timg/actors/10010.jpg\n72875\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t1.0002414\timg/actors/10012.jpg\n72875\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.99984664\timg/actors/90015.jpg\n72875\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9997708\timg/actors/10002.jpg\n72875\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9988556\timg/actors/90008.jpg\n72875\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9986552\timg/actors/90003.jpg\n72875\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.99728614\timg/actors/10013.jpg\n72875\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9839741\timg/actors/90009.jpg\n72875\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9816707\timg/actors/10001.jpg\n72875\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.98144186\timg/actors/10005.jpg\n72875\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9800997\timg/actors/10006.jpg\n72875\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9790275\timg/actors/90010.jpg\n72875\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9761319\timg/actors/10007.jpg\n72875\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.96177304\timg/actors/90004.jpg\n72875\t10008\tRobert De Niro\tManhattan, New York, United States\t0.95034117\timg/actors/10008.jpg\n72875\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9151038\timg/actors/90011.jpg\n72875\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.89496756\timg/actors/90001.jpg\n72875\t10014\tJames Franco\tPalo Alto, California, United States\t0.89273953\timg/actors/10014.jpg\n72875\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.8617339\timg/actors/90014.jpg\n72875\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.85963535\timg/actors/90013.jpg\n72875\t10003\tAl Pacino\tManhattan, New York, United States\t0.727939\timg/actors/10003.jpg\n72875\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.70440304\timg/actors/90002.jpg\n72875\t90012\tStacey Dash\tBronx, New York, United States\t0.5646663\timg/actors/90012.jpg\n72875\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.40878475\timg/actors/10015.jpg\n79586\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t1.2606084\timg/actors/90003.jpg\n79586\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t1.164947\timg/actors/10002.jpg\n79586\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t1.1478903\timg/actors/90001.jpg\n79586\t90006\tTatyana Ali\tBrooklyn, New York, United States\t1.1320674\timg/actors/90006.jpg\n79586\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t1.1271973\timg/actors/10004.jpg\n79586\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t1.0854375\timg/actors/90007.jpg\n79586\t10011\tJohn Travolta\tEnglewood, New York, United States\t1.0705339\timg/actors/10011.jpg\n79586\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t1.0604444\timg/actors/90009.jpg\n79586\t90010\tTiffani Thiessen\tLong Beach, California, United States\t1.0594103\timg/actors/90010.jpg\n79586\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t1.0560372\timg/actors/90005.jpg\n79586\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t1.0560226\timg/actors/10005.jpg\n79586\t10009\tChazz Palminteri\tBronx, New York, United States\t1.049202\timg/actors/10009.jpg\n79586\t10014\tJames Franco\tPalo Alto, California, United States\t1.0408356\timg/actors/10014.jpg\n79586\t10003\tAl Pacino\tManhattan, New York, United States\t1.030951\timg/actors/10003.jpg\n79586\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0288854\timg/actors/10001.jpg\n79586\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t1.0188992\timg/actors/90004.jpg\n79586\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t1.0125139\timg/actors/10013.jpg\n79586\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t1.0060327\timg/actors/10012.jpg\n79586\t90015\tBarbara Niven\tPortland, Oregon, United States\t1.002777\timg/actors/90015.jpg\n79586\t90011\tAshley Judd\tGranada Hills, California, United States\t1.0012448\timg/actors/90011.jpg\n79586\t10010\tTom Hanks\tConcord, California, United States\t1.0012112\timg/actors/10010.jpg\n79586\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.99994236\timg/actors/90014.jpg\n79586\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9999018\timg/actors/10006.jpg\n79586\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9994195\timg/actors/10008.jpg\n79586\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.99907446\timg/actors/10007.jpg\n79586\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.99896455\timg/actors/90002.jpg\n79586\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.99807405\timg/actors/90013.jpg\n79586\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9979181\timg/actors/90008.jpg\n79586\t90012\tStacey Dash\tBronx, New York, United States\t0.99317145\timg/actors/90012.jpg\n79586\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.6900368\timg/actors/10015.jpg\n80374\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t1.0293174\timg/actors/90005.jpg\n80374\t10009\tChazz Palminteri\tBronx, New York, United States\t1.024504\timg/actors/10009.jpg\n80374\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t1.0230527\timg/actors/10004.jpg\n80374\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t1.0103621\timg/actors/90007.jpg\n80374\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t1.0021284\timg/actors/10005.jpg\n80374\t10006\tTom Cruise\tSyracuse, New York, United States\t1.0014929\timg/actors/10006.jpg\n80374\t90006\tTatyana Ali\tBrooklyn, New York, United States\t1.0013549\timg/actors/90006.jpg\n80374\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t1.0008928\timg/actors/90009.jpg\n80374\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t1.0006884\timg/actors/10012.jpg\n80374\t10011\tJohn Travolta\tEnglewood, New York, United States\t1.0006148\timg/actors/10011.jpg\n80374\t10007\tDenzel Washington\tMount Vernon, New York, United States\t1.0002991\timg/actors/10007.jpg\n80374\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t1.0000123\timg/actors/10013.jpg\n80374\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9998535\timg/actors/90015.jpg\n80374\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9995769\timg/actors/10001.jpg\n80374\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9982281\timg/actors/90010.jpg\n80374\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9981613\timg/actors/90004.jpg\n80374\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9971439\timg/actors/90003.jpg\n80374\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9855927\timg/actors/10002.jpg\n80374\t10010\tTom Hanks\tConcord, California, United States\t0.9502544\timg/actors/10010.jpg\n80374\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9477792\timg/actors/10008.jpg\n80374\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9453024\timg/actors/90001.jpg\n80374\t10014\tJames Franco\tPalo Alto, California, United States\t0.9440506\timg/actors/10014.jpg\n80374\t90011\tAshley Judd\tGranada Hills, California, United States\t0.93717587\timg/actors/90011.jpg\n80374\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9135976\timg/actors/90013.jpg\n80374\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.89367306\timg/actors/90008.jpg\n80374\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.892002\timg/actors/90014.jpg\n80374\t10003\tAl Pacino\tManhattan, New York, United States\t0.7808381\timg/actors/10003.jpg\n80374\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.75136745\timg/actors/90002.jpg\n80374\t90012\tStacey Dash\tBronx, New York, United States\t0.57913446\timg/actors/90012.jpg\n80374\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.4470567\timg/actors/10015.jpg\n82059\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t1.0007997\timg/actors/90007.jpg\n82059\t10011\tJohn Travolta\tEnglewood, New York, United States\t1.0007222\timg/actors/10011.jpg\n82059\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t1.0001943\timg/actors/90005.jpg\n82059\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9996321\timg/actors/90006.jpg\n82059\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9995845\timg/actors/10004.jpg\n82059\t10010\tTom Hanks\tConcord, California, United States\t0.99900866\timg/actors/10010.jpg\n82059\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9976494\timg/actors/90008.jpg\n82059\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9602489\timg/actors/10001.jpg\n82059\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9585051\timg/actors/10012.jpg\n82059\t10009\tChazz Palminteri\tBronx, New York, United States\t0.95506364\timg/actors/10009.jpg\n82059\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9456186\timg/actors/90015.jpg\n82059\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.94414943\timg/actors/10013.jpg\n82059\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9323799\timg/actors/10006.jpg\n82059\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.90395564\timg/actors/10007.jpg\n82059\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9036887\timg/actors/10002.jpg\n82059\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9029046\timg/actors/10005.jpg\n82059\t10008\tRobert De Niro\tManhattan, New York, United States\t0.8979136\timg/actors/10008.jpg\n82059\t90011\tAshley Judd\tGranada Hills, California, United States\t0.8946779\timg/actors/90011.jpg\n82059\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.89109164\timg/actors/90009.jpg\n82059\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.8847834\timg/actors/90004.jpg\n82059\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.8748516\timg/actors/90010.jpg\n82059\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.854895\timg/actors/90003.jpg\n82059\t10014\tJames Franco\tPalo Alto, California, United States\t0.80629665\timg/actors/10014.jpg\n82059\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.7913848\timg/actors/90014.jpg\n82059\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.77748305\timg/actors/90001.jpg\n82059\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.77642137\timg/actors/90013.jpg\n82059\t10003\tAl Pacino\tManhattan, New York, United States\t0.569189\timg/actors/10003.jpg\n82059\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.56148636\timg/actors/90002.jpg\n82059\t90012\tStacey Dash\tBronx, New York, United States\t0.44459242\timg/actors/90012.jpg\n82059\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.27922362\timg/actors/10015.jpg\n85152\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t1.0001428\timg/actors/10012.jpg\n85152\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0000838\timg/actors/10001.jpg\n85152\t10006\tTom Cruise\tSyracuse, New York, United States\t0.999956\timg/actors/10006.jpg\n85152\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9999555\timg/actors/90015.jpg\n85152\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9998347\timg/actors/90004.jpg\n85152\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.99815726\timg/actors/90013.jpg\n85152\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9658247\timg/actors/10013.jpg\n85152\t10009\tChazz Palminteri\tBronx, New York, United States\t0.95116496\timg/actors/10009.jpg\n85152\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9397129\timg/actors/10011.jpg\n85152\t90011\tAshley Judd\tGranada Hills, California, United States\t0.93801725\timg/actors/90011.jpg\n85152\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9344014\timg/actors/90005.jpg\n85152\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9288577\timg/actors/90014.jpg\n85152\t10014\tJames Franco\tPalo Alto, California, United States\t0.92808664\timg/actors/10014.jpg\n85152\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9260228\timg/actors/90001.jpg\n85152\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9253708\timg/actors/10005.jpg\n85152\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9208574\timg/actors/10007.jpg\n85152\t10010\tTom Hanks\tConcord, California, United States\t0.9150624\timg/actors/10010.jpg\n85152\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.8851836\timg/actors/90007.jpg\n85152\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.8823684\timg/actors/90006.jpg\n85152\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.86537987\timg/actors/90009.jpg\n85152\t10008\tRobert De Niro\tManhattan, New York, United States\t0.85220945\timg/actors/10008.jpg\n85152\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.84557736\timg/actors/10004.jpg\n85152\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.84165573\timg/actors/10002.jpg\n85152\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.83721364\timg/actors/90010.jpg\n85152\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.77049756\timg/actors/90003.jpg\n85152\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.7019973\timg/actors/90008.jpg\n85152\t10003\tAl Pacino\tManhattan, New York, United States\t0.63544405\timg/actors/10003.jpg\n85152\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.6289075\timg/actors/90002.jpg\n85152\t90012\tStacey Dash\tBronx, New York, United States\t0.41938734\timg/actors/90012.jpg\n85152\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.28187525\timg/actors/10015.jpg\n88190\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t1.1593403\timg/actors/90003.jpg\n88190\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t1.1222217\timg/actors/90001.jpg\n88190\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t1.0966305\timg/actors/10002.jpg\n88190\t90011\tAshley Judd\tGranada Hills, California, United States\t1.0944141\timg/actors/90011.jpg\n88190\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0936552\timg/actors/10001.jpg\n88190\t90006\tTatyana Ali\tBrooklyn, New York, United States\t1.0932348\timg/actors/90006.jpg\n88190\t10011\tJohn Travolta\tEnglewood, New York, United States\t1.0227075\timg/actors/10011.jpg\n88190\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t1.0222878\timg/actors/90007.jpg\n88190\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t1.0174185\timg/actors/90009.jpg\n88190\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t1.0056438\timg/actors/90014.jpg\n88190\t10009\tChazz Palminteri\tBronx, New York, United States\t1.0011345\timg/actors/10009.jpg\n88190\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t1.001077\timg/actors/10004.jpg\n88190\t90010\tTiffani Thiessen\tLong Beach, California, United States\t1.0003536\timg/actors/90010.jpg\n88190\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t1.0002177\timg/actors/90013.jpg\n88190\t10006\tTom Cruise\tSyracuse, New York, United States\t0.99949944\timg/actors/10006.jpg\n88190\t10014\tJames Franco\tPalo Alto, California, United States\t0.99928486\timg/actors/10014.jpg\n88190\t10010\tTom Hanks\tConcord, California, United States\t0.99911344\timg/actors/10010.jpg\n88190\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9988526\timg/actors/10008.jpg\n88190\t90012\tStacey Dash\tBronx, New York, United States\t0.9939704\timg/actors/90012.jpg\n88190\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.992516\timg/actors/90005.jpg\n88190\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9658575\timg/actors/10005.jpg\n88190\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.96585613\timg/actors/10012.jpg\n88190\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9646819\timg/actors/90004.jpg\n88190\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9624557\timg/actors/10013.jpg\n88190\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.95447004\timg/actors/90015.jpg\n88190\t10003\tAl Pacino\tManhattan, New York, United States\t0.9442177\timg/actors/10003.jpg\n88190\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9339181\timg/actors/10007.jpg\n88190\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9252145\timg/actors/90002.jpg\n88190\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.90652317\timg/actors/90008.jpg\n88190\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.6397082\timg/actors/10015.jpg\n89887\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0293643\timg/actors/10001.jpg\n89887\t10009\tChazz Palminteri\tBronx, New York, United States\t1.0173286\timg/actors/10009.jpg\n89887\t90015\tBarbara Niven\tPortland, Oregon, United States\t1.0019073\timg/actors/90015.jpg\n89887\t10006\tTom Cruise\tSyracuse, New York, United States\t1.0010678\timg/actors/10006.jpg\n89887\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t1.0000775\timg/actors/10005.jpg\n89887\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9999432\timg/actors/10007.jpg\n89887\t90011\tAshley Judd\tGranada Hills, California, United States\t0.99965805\timg/actors/90011.jpg\n89887\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9990643\timg/actors/90009.jpg\n89887\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.998067\timg/actors/90001.jpg\n89887\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9969369\timg/actors/10013.jpg\n89887\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9955338\timg/actors/90005.jpg\n89887\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.99534804\timg/actors/90004.jpg\n89887\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9876029\timg/actors/10012.jpg\n89887\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9841326\timg/actors/10011.jpg\n89887\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.98084027\timg/actors/90013.jpg\n89887\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.97499883\timg/actors/90007.jpg\n89887\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.971447\timg/actors/90006.jpg\n89887\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.96813476\timg/actors/90010.jpg\n89887\t10010\tTom Hanks\tConcord, California, United States\t0.96192527\timg/actors/10010.jpg\n89887\t10008\tRobert De Niro\tManhattan, New York, United States\t0.96105605\timg/actors/10008.jpg\n89887\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.95850885\timg/actors/10002.jpg\n89887\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9571299\timg/actors/90014.jpg\n89887\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.94651496\timg/actors/10004.jpg\n89887\t10014\tJames Franco\tPalo Alto, California, United States\t0.9414656\timg/actors/10014.jpg\n89887\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9009873\timg/actors/90003.jpg\n89887\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.79163486\timg/actors/90008.jpg\n89887\t10003\tAl Pacino\tManhattan, New York, United States\t0.72046643\timg/actors/10003.jpg\n89887\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.69016033\timg/actors/90002.jpg\n89887\t90012\tStacey Dash\tBronx, New York, United States\t0.54872614\timg/actors/90012.jpg\n89887\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.35241246\timg/actors/10015.jpg\n90162\t10009\tChazz Palminteri\tBronx, New York, United States\t1.0245717\timg/actors/10009.jpg\n90162\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0041226\timg/actors/10001.jpg\n90162\t10011\tJohn Travolta\tEnglewood, New York, United States\t1.0038347\timg/actors/10011.jpg\n90162\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t1.0013697\timg/actors/90005.jpg\n90162\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t1.0011313\timg/actors/10005.jpg\n90162\t10006\tTom Cruise\tSyracuse, New York, United States\t1.0006788\timg/actors/10006.jpg\n90162\t90015\tBarbara Niven\tPortland, Oregon, United States\t1.000509\timg/actors/90015.jpg\n90162\t10007\tDenzel Washington\tMount Vernon, New York, United States\t1.0004816\timg/actors/10007.jpg\n90162\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9991852\timg/actors/90014.jpg\n90162\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9988503\timg/actors/10013.jpg\n90162\t10008\tRobert De Niro\tManhattan, New York, United States\t0.99879616\timg/actors/10008.jpg\n90162\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.99870646\timg/actors/90007.jpg\n90162\t10010\tTom Hanks\tConcord, California, United States\t0.99835646\timg/actors/10010.jpg\n90162\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.99802387\timg/actors/90006.jpg\n90162\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9972095\timg/actors/10012.jpg\n90162\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9969865\timg/actors/90011.jpg\n90162\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.99677014\timg/actors/90001.jpg\n90162\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9950888\timg/actors/10002.jpg\n90162\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.99464846\timg/actors/90009.jpg\n90162\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9787728\timg/actors/90013.jpg\n90162\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9746057\timg/actors/90004.jpg\n90162\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9714699\timg/actors/90010.jpg\n90162\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.95311654\timg/actors/10004.jpg\n90162\t10014\tJames Franco\tPalo Alto, California, United States\t0.9238733\timg/actors/10014.jpg\n90162\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.8890714\timg/actors/90003.jpg\n90162\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.80315256\timg/actors/90008.jpg\n90162\t10003\tAl Pacino\tManhattan, New York, United States\t0.72103244\timg/actors/10003.jpg\n90162\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.6929622\timg/actors/90002.jpg\n90162\t90012\tStacey Dash\tBronx, New York, United States\t0.55466706\timg/actors/90012.jpg\n90162\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.3022465\timg/actors/10015.jpg\n97911\t90015\tBarbara Niven\tPortland, Oregon, United States\t1.031993\timg/actors/90015.jpg\n97911\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t1.0134175\timg/actors/10012.jpg\n97911\t10009\tChazz Palminteri\tBronx, New York, United States\t1.0115331\timg/actors/10009.jpg\n97911\t10011\tJohn Travolta\tEnglewood, New York, United States\t1.0110059\timg/actors/10011.jpg\n97911\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t1.0007817\timg/actors/90013.jpg\n97911\t10006\tTom Cruise\tSyracuse, New York, United States\t1.0003192\timg/actors/10006.jpg\n97911\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t1.0001649\timg/actors/10001.jpg\n97911\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t1.0001358\timg/actors/90004.jpg\n97911\t10010\tTom Hanks\tConcord, California, United States\t0.9993063\timg/actors/10010.jpg\n97911\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.99892473\timg/actors/90014.jpg\n97911\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9978949\timg/actors/90001.jpg\n97911\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9976179\timg/actors/90005.jpg\n97911\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9952332\timg/actors/10013.jpg\n97911\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.99403095\timg/actors/10005.jpg\n97911\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9859015\timg/actors/90007.jpg\n97911\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98027176\timg/actors/10007.jpg\n97911\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9780914\timg/actors/10002.jpg\n97911\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9725075\timg/actors/90006.jpg\n97911\t90011\tAshley Judd\tGranada Hills, California, United States\t0.97176313\timg/actors/90011.jpg\n97911\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.96407837\timg/actors/10004.jpg\n97911\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9520225\timg/actors/90009.jpg\n97911\t10008\tRobert De Niro\tManhattan, New York, United States\t0.95188284\timg/actors/10008.jpg\n97911\t10014\tJames Franco\tPalo Alto, California, United States\t0.93560326\timg/actors/10014.jpg\n97911\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9284007\timg/actors/90010.jpg\n97911\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.8882201\timg/actors/90003.jpg\n97911\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.8272313\timg/actors/90008.jpg\n97911\t10003\tAl Pacino\tManhattan, New York, United States\t0.72657573\timg/actors/10003.jpg\n97911\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.71050864\timg/actors/90002.jpg\n97911\t90012\tStacey Dash\tBronx, New York, United States\t0.5303352\timg/actors/90012.jpg\n97911\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.30956128\timg/actors/10015.jpg\n"
      },
      "dateCreated": "Apr 17, 2016 7:53:45 PM",
      "dateStarted": "Jun 17, 2016 2:03:00 AM",
      "dateFinished": "Jun 17, 2016 2:03:23 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "text": "import com.netflix.dyno.jedis._\nimport com.netflix.dyno.connectionpool.Host\nimport com.netflix.dyno.connectionpool.HostSupplier\nimport com.netflix.dyno.connectionpool.TokenMapSupplier\nimport com.netflix.dyno.connectionpool.impl.lb.HostToken\nimport com.netflix.dyno.connectionpool.exception.DynoException\nimport com.netflix.dyno.connectionpool.impl.ConnectionPoolConfigurationImpl;\nimport com.netflix.dyno.connectionpool.impl.ConnectionContextImpl\nimport com.netflix.dyno.connectionpool.impl.OperationResultImpl\nimport com.netflix.dyno.connectionpool.impl.utils.ZipUtils\n\n//import scala.collection.JavaConverters._\n\nimport java.util.Collections\nimport java.util.Collection\nimport java.util.Set\nimport java.util.List\n\nval localhostHost \u003d new Host(\"127.0.0.1\", Host.Status.Up)\nval localhostToken \u003d new HostToken(100000L, localhostHost)\n\nval localhostHostSupplier \u003d new HostSupplier() {\n  @Override\n  def getHosts(): Collection[Host] \u003d {\n    Collections.singletonList(localhostHost)\n  }\n}\n\nval localhostTokenMapSupplier \u003d new TokenMapSupplier() {\n  @Override\n  def getTokens(activeHosts: Set[Host]): List[HostToken] \u003d {\n\tCollections.singletonList(localhostToken)\n  }\n\n  @Override\n  def getTokenForHost(host: Host, activeHosts: Set[Host]): HostToken \u003d {\n    return localhostToken\n  }\n}\n\nval redisPort \u003d 6379                        \nval dynoClient \u003d new DynoJedisClient.Builder()\n              .withApplicationName(\"pipeline\")\n              .withDynomiteClusterName(\"pipeline-dynomite\")\n              .withHostSupplier(localhostHostSupplier)\n              .withCPConfig(new ConnectionPoolConfigurationImpl(\"localhostTokenMapSupplier\")\n                .withTokenSupplier(localhostTokenMapSupplier))\n              .withPort(redisPort)\n              .build()\n\nval recommendations \u003d enrichedRecommendationsDF.collect()\n\ndynoClient.set(\"personalized-als\", recommendations.mkString(\",\"))\n\nval retrievedRecommenations \u003d dynoClient.get(\"personalized-als\")\n\ndynoClient.stopClient()",
      "dateUpdated": "Jun 17, 2016 2:12:09 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala"
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465623520589_1668216997",
      "id": "20160611-053840_879401130",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import com.netflix.dyno.jedis._\nimport com.netflix.dyno.connectionpool.Host\nimport com.netflix.dyno.connectionpool.HostSupplier\nimport com.netflix.dyno.connectionpool.TokenMapSupplier\nimport com.netflix.dyno.connectionpool.impl.lb.HostToken\nimport com.netflix.dyno.connectionpool.exception.DynoException\nimport com.netflix.dyno.connectionpool.impl.ConnectionPoolConfigurationImpl\nimport com.netflix.dyno.connectionpool.impl.ConnectionContextImpl\nimport com.netflix.dyno.connectionpool.impl.OperationResultImpl\nimport com.netflix.dyno.connectionpool.impl.utils.ZipUtils\nimport java.util.Collections\nimport java.util.Collection\nimport java.util.Set\nimport java.util.List\nlocalhostHost: com.netflix.dyno.connectionpool.Host \u003d Host [name\u003d127.0.0.1, port\u003d-1, dc: null, status: Up]\nlocalhostToken: com.netflix.dyno.connectionpool.impl.lb.HostToken \u003d HostToken [token\u003d100000, host\u003dHost [name\u003d127.0.0.1, port\u003d-1, dc: null, status: Up]]\nlocalhostHostSupplier: com.netflix.dyno.connectionpool.HostSupplier \u003d $iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$anon$1@33f1b1ea\nlocalhostTokenMapSupplier: com.netflix.dyno.connectionpool.TokenMapSupplier \u003d $iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$anon$1@f0ca15d\nredisPort: Int \u003d 6379\ndynoClient: com.netflix.dyno.jedis.DynoJedisClient \u003d com.netflix.dyno.jedis.DynoJedisClient@1b4c2922\nrecommendations: Array[org.apache.spark.sql.Row] \u003d Array([5980,10011,John Travolta,Englewood, New York, United States,1.0209402,img/actors/10011.jpg], [5980,10009,Chazz Palminteri,Bronx, New York, United States,1.0084537,img/actors/10009.jpg], [5980,90007,Angell Conwell,Orangeburg, South Carolina, United States,1.0064986,img/actors/90007.jpg], [5980,10006,Tom Cruise,Syracuse, New York, United States,1.0052832,img/actors/10006.jpg], [5980,10008,Robert De Niro,Manhattan, New York, United States,1.0041333,img/actors/10008.jpg], [5980,10001,Leonardo DiCaprio,Hollywood, California, United States,1.001754,img/actors/10001.jpg], [5980,10010,Tom Hanks,Concord, California, United States,0.9996849,img/actors/10010.jpg], [5980,10012,Johnny Depp,Owensboro, Kentucky, United States,0.99960995,img/act...res53: String \u003d OK\nretrievedRecommenations: String \u003d [5980,10011,John Travolta,Englewood, New York, United States,1.0209402,img/actors/10011.jpg],[5980,10009,Chazz Palminteri,Bronx, New York, United States,1.0084537,img/actors/10009.jpg],[5980,90007,Angell Conwell,Orangeburg, South Carolina, United States,1.0064986,img/actors/90007.jpg],[5980,10006,Tom Cruise,Syracuse, New York, United States,1.0052832,img/actors/10006.jpg],[5980,10008,Robert De Niro,Manhattan, New York, United States,1.0041333,img/actors/10008.jpg],[5980,10001,Leonardo DiCaprio,Hollywood, California, United States,1.001754,img/actors/10001.jpg],[5980,10010,Tom Hanks,Concord, California, United States,0.9996849,img/actors/10010.jpg],[5980,10012,Johnny Depp,Owensboro, Kentucky, United States,0.99960995,img/actors/10012.jpg],[5980,90010,Tif..."
      },
      "dateCreated": "Jun 11, 2016 5:38:40 AM",
      "dateStarted": "Jun 17, 2016 2:03:10 AM",
      "dateFinished": "Jun 17, 2016 2:03:31 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "text": "%md ## Bonus:  Storing the User and Item Factors (Used Later...)",
      "dateUpdated": "Jun 17, 2016 2:19:17 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/markdown",
        "editorHide": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1466129842555_-274065334",
      "id": "20160617-021722_1145491210",
      "result": {
        "code": "SUCCESS",
        "type": "HTML",
        "msg": "\u003ch2\u003eBonus:  Storing the User and Item Factors (Used Later\u0026hellip;)\u003c/h2\u003e\n"
      },
      "dateCreated": "Jun 17, 2016 2:17:22 AM",
      "dateStarted": "Jun 17, 2016 2:19:15 AM",
      "dateFinished": "Jun 17, 2016 2:19:15 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Show UserFactors Matrix",
      "text": "import org.apache.spark.mllib.linalg.Vectors\n\nval userFactorsDF \u003d bestRecommendationModel.userFactors.map(row \u003d\u003e \n  (row.getInt(0), row.getSeq[Float](1).toArray.map(_.toDouble))\n).toDF(\"userId\", \"userFactors\")\n .sort($\"userId\" asc)\n .as(\"userFactors\")\n\nz.show(userFactorsDF)",
      "dateUpdated": "Jun 17, 2016 1:59:29 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 135.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "userFactors",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "userFactors",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456873568687_1047705598",
      "id": "20160301-230608_2073461478",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\tuserFactors\n5980\tWrappedArray(0.07081785053014755, 5.957256653346121E-4, 0.00784208346158266, 0.06746260821819305, 0.19887174665927887, 0.21549946069717407, 0.03306687995791435, 0.12973976135253906, 0.11286700516939163, 0.0, 0.02681214176118374, 0.22060759365558624, 0.18739663064479828, 0.3323942720890045, 0.15824928879737854)\n21141\tWrappedArray(0.0, 0.010398018173873425, 0.0, 0.05046685039997101, 0.23681266605854034, 0.2432008534669876, 0.06603769212961197, 0.3734664022922516, 0.06928988546133041, 0.018318092450499535, 0.02240787073969841, 0.38478028774261475, 0.17770767211914062, 0.10540775954723358, 0.15275919437408447)\n21619\tWrappedArray(0.02926018089056015, 0.16599497199058533, 0.08078518509864807, 0.038635049015283585, 0.10967836529016495, 0.27115383744239807, 0.0, 0.15189872682094574, 0.04436366260051727, 0.059076495468616486, 0.08985993266105652, 0.20488500595092773, 0.2377440333366394, 0.17517022788524628, 0.22722020745277405)\n27981\tWrappedArray(0.05488364398479462, 0.09465792775154114, 0.005805077031254768, 0.1304178237915039, 0.23062191903591156, 0.10995056480169296, 0.009199103340506554, 0.08388423174619675, 0.1535586416721344, 0.05921192839741707, 0.009186284616589546, 0.1721067577600479, 0.23162998259067535, 0.2884276211261749, 0.08411721140146255)\n28024\tWrappedArray(0.06697075068950653, 0.16723205149173737, 0.10456246882677078, 0.02447713166475296, 0.19321800768375397, 0.1464211493730545, 0.007063121069222689, 0.2049134224653244, 0.17184677720069885, 0.046612296253442764, 0.03549780696630478, 0.3254426419734955, 0.11096184700727463, 0.19631652534008026, 0.16910885274410248)\n28865\tWrappedArray(0.01945769414305687, 0.0, 0.0, 0.04358931630849838, 0.17642557621002197, 0.17347170412540436, 0.04187382385134697, 0.3482031226158142, 0.10814828425645828, 0.0, 0.026158802211284637, 0.4262078106403351, 0.1737944781780243, 0.19589842855930328, 0.195744127035141)\n30699\tWrappedArray(0.16820886731147766, 0.08676903694868088, 0.0, 0.25071436166763306, 0.13544702529907227, 0.1524292230606079, 0.013004770502448082, 0.13214492797851562, 0.06343339383602142, 0.038691744208335876, 0.0038766474463045597, 0.08754757046699524, 0.15995866060256958, 0.16765320301055908, 0.06215217337012291)\n32940\tWrappedArray(0.11213289946317673, 0.34909749031066895, 0.1800944209098816, 0.06535608321428299, 0.0, 0.046731136739254, 0.0, 0.48367610573768616, 0.14404228329658508, 0.0, 0.049631018191576004, 0.8087664842605591, 3.329325409140438E-4, 0.07703311741352081, 0.07367829233407974)\n34615\tWrappedArray(0.004346570465713739, 0.0, 0.0019089148845523596, 0.0739164873957634, 0.23183618485927582, 0.2735719680786133, 0.05504777655005455, 0.381364643573761, 0.06426394730806351, 0.0, 0.014402753673493862, 0.3693961799144745, 0.12989585101604462, 0.10129781812429428, 0.1605677306652069)\n34643\tWrappedArray(0.12499109655618668, 0.17854678630828857, 0.007238889113068581, 0.12419721484184265, 0.19570079445838928, 0.19286921620368958, 0.008731048554182053, 0.1375511884689331, 0.06925676763057709, 0.07004421949386597, 0.0015280622756108642, 0.09985974431037903, 0.18548843264579773, 0.2024395614862442, 0.05957815796136856)\n36401\tWrappedArray(0.10878727585077286, 0.10302497446537018, 0.03515946865081787, 0.1321466863155365, 0.2233285754919052, 0.17639079689979553, 0.014190100133419037, 0.05042582377791405, 0.16546295583248138, 0.040448714047670364, 0.0028365333564579487, 0.14476601779460907, 0.16574129462242126, 0.3012700080871582, 0.10279368609189987)\n38808\tWrappedArray(0.13068710267543793, 0.14508303999900818, 0.0539441853761673, 0.0280131995677948, 0.24037660658359528, 0.1599927395582199, 0.03484904021024704, 0.08677906543016434, 0.1568731963634491, 0.030880510807037354, 0.022959522902965546, 0.1209353432059288, 0.16393493115901947, 0.27112841606140137, 0.1348942071199417)\n39819\tWrappedArray(0.05095287784934044, 0.092803455889225, 0.13878090679645538, 0.02800377458333969, 0.1114424467086792, 0.18821510672569275, 0.04674329608678818, 0.21123021841049194, 0.1185993105173111, 0.009954335168004036, 0.09473959356546402, 0.33640798926353455, 0.19263963401317596, 0.25340622663497925, 0.1836850494146347)\n44954\tWrappedArray(0.16820886731147766, 0.08676903694868088, 0.0, 0.25071436166763306, 0.13544702529907227, 0.1524292230606079, 0.013004770502448082, 0.13214492797851562, 0.06343339383602142, 0.038691744208335876, 0.0038766474463045597, 0.08754757046699524, 0.15995866060256958, 0.16765320301055908, 0.06215217337012291)\n46843\tWrappedArray(0.0, 0.22815187275409698, 0.030024588108062744, 0.06200559809803963, 0.2471863180398941, 0.16409419476985931, 0.016786465421319008, 0.13923867046833038, 0.029524046927690506, 0.0917726531624794, 0.052603110671043396, 0.16314609348773956, 0.25924572348594666, 0.13478513062000275, 0.10966448485851288)\n57462\tWrappedArray(0.0, 0.0, 0.08969128131866455, 0.06502049416303635, 0.17224770784378052, 0.1673055738210678, 0.04408975690603256, 0.24675467610359192, 0.1573447287082672, 0.002335958182811737, 0.10148131102323532, 0.46298927068710327, 0.16309192776679993, 0.20381182432174683, 0.30501851439476013)\n61945\tWrappedArray(0.05657312646508217, 0.07200361788272858, 0.051668666303157806, 0.026616377755999565, 0.23900602757930756, 0.14558696746826172, 0.1137639656662941, 0.08028443902730942, 0.14192239940166473, 0.053975678980350494, 0.08347934484481812, 0.23459674417972565, 0.21728405356407166, 0.25625357031822205, 0.11818476021289825)\n66348\tWrappedArray(0.10066793113946915, 0.0644126608967781, 0.06692863255739212, 0.11160875856876373, 0.1050923764705658, 0.31948333978652954, 0.03144676238298416, 0.11032791435718536, 0.06142951548099518, 0.0, 0.05116823688149452, 0.15567585825920105, 0.17742863297462463, 0.3134048879146576, 0.13968032598495483)\n68754\tWrappedArray(0.12917965650558472, 0.1079123318195343, 6.115657743066549E-4, 0.10225192457437515, 0.2013281285762787, 0.07288795709609985, 0.011676809750497341, 0.10204195231199265, 0.14564105868339539, 0.057329077273607254, 0.002820668974891305, 0.2128314971923828, 0.21812374889850616, 0.27110934257507324, 0.06937764585018158)\n70281\tWrappedArray(0.11260201781988144, 0.16545279324054718, 0.07815749198198318, 0.09563963860273361, 0.24485313892364502, 0.11708395928144455, 0.06775655597448349, 0.10266610980033875, 0.12912845611572266, 0.04193667694926262, 0.05866135284304619, 0.11579075455665588, 0.14260712265968323, 0.2664543688297272, 0.09354037791490555)\n72875\tWrappedArray(0.06376542896032333, 0.154089093208313, 0.1040470153093338, 0.041172850877046585, 0.28348496556282043, 0.14859628677368164, 0.06670527905225754, 0.1036616638302803, 0.20368435978889465, 0.04663080349564552, 0.049934759736061096, 0.31261134147644043, 0.05119030922651291, 0.19862200319766998, 0.1794816553592682)\n79586\tWrappedArray(0.0, 0.09839893132448196, 0.34774428606033325, 0.08971203863620758, 0.1280847042798996, 0.08876393735408783, 0.054630961269140244, 0.3911893665790558, 0.15476714074611664, 0.011663605459034443, 0.17557860910892487, 0.4932684004306793, 0.019993728026747704, 0.23350976407527924, 0.27632468938827515)\n80374\tWrappedArray(0.06382939219474792, 0.15411153435707092, 0.0788155049085617, 0.02311565913259983, 0.20355404913425446, 0.15224012732505798, 0.02557538077235222, 0.163527712225914, 0.16699421405792236, 0.05380207300186157, 0.04574793949723244, 0.3435768187046051, 0.1388801634311676, 0.18800722062587738, 0.17633351683616638)\n82059\tWrappedArray(0.057317860424518585, 0.16082586348056793, 0.0901157334446907, 0.11179628223180771, 0.32903221249580383, 0.18783916532993317, 0.1003800556063652, 0.0, 0.18124984204769135, 0.05316776782274246, 0.05049167573451996, 0.19826430082321167, 0.0, 0.2039671689271927, 0.1430930495262146)\n85152\tWrappedArray(0.09025156497955322, 0.15409529209136963, 0.03723669797182083, 0.016732199117541313, 0.10253036022186279, 0.33117297291755676, 0.016664739698171616, 0.1283240020275116, 0.03492441028356552, 0.033990487456321716, 0.04600600525736809, 0.15879057347774506, 0.20306719839572906, 0.22058777511119843, 0.14491058886051178)\n88190\tWrappedArray(0.001670641591772437, 0.1035003736615181, 0.38018834590911865, 0.22443954646587372, 0.02167641557753086, 0.13564765453338623, 0.0, 0.406472384929657, 0.14444249868392944, 0.0, 0.15750715136528015, 0.3925834000110626, 6.153417052701116E-5, 0.28227898478507996, 0.27394533157348633)\n89887\tWrappedArray(0.07913005352020264, 0.09789440035820007, 0.08949752897024155, 0.08263715356588364, 0.11222990602254868, 0.20734655857086182, 0.007572664879262447, 0.11625317484140396, 0.10333510488271713, 0.03567580506205559, 0.09159902483224869, 0.25431185960769653, 0.23743538558483124, 0.22949017584323883, 0.24252142012119293)\n90162\tWrappedArray(0.016101934015750885, 0.04918550327420235, 0.07698418945074081, 0.09675096720457077, 0.13563378155231476, 0.21167364716529846, 0.001693394617177546, 0.1383281946182251, 0.11737385392189026, 0.012371985241770744, 0.09155526012182236, 0.19263887405395508, 0.20995403826236725, 0.31410330533981323, 0.26166102290153503)\n97911\tWrappedArray(0.035211142152547836, 0.06372062116861343, 0.08184491842985153, 0.06332191079854965, 0.16032017767429352, 0.28029510378837585, 0.023845108225941658, 0.11758807301521301, 0.09335122257471085, 0.015099117532372475, 0.07647828012704849, 0.21575218439102173, 0.1832408457994461, 0.25772663950920105, 0.23711583018302917)\n"
      },
      "dateCreated": "Mar 1, 2016 11:06:08 PM",
      "dateStarted": "Jun 17, 2016 2:03:23 AM",
      "dateFinished": "Jun 17, 2016 2:03:32 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Show ItemFactors Matrix",
      "text": "import org.apache.spark.mllib.linalg.Vectors\n \nval itemFactorsDF \u003d bestRecommendationModel.itemFactors.map(row \u003d\u003e\n  (row.getInt(0), row.getSeq[Float](1).toArray.map(_.toDouble))\n).toDF(\"itemId\", \"itemFactors\")\n .sort($\"itemId\" asc)\n .as(\"itemFactors\")\n\nz.show(itemFactorsDF)",
      "dateUpdated": "Jun 17, 2016 1:59:29 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 314.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456865217092_774550692",
      "id": "20160301-204657_541485869",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "itemId\titemFactors\n10001\tWrappedArray(0.7364962697029114, 0.7269670367240906, 0.07145942002534866, 0.8969365358352661, 0.7048115730285645, 0.7652131915092468, 0.05828418582677841, 0.545279860496521, 0.28190913796424866, 0.2781541049480438, 0.016252437606453896, 0.4025684595108032, 0.7164798378944397, 0.6647099852561951, 0.21533505618572235)\n10002\tWrappedArray(0.23682737350463867, 0.17852531373500824, 0.14213348925113678, 0.173313707113266, 0.6985136866569519, 0.5311887860298157, 0.12624157965183258, 0.34144797921180725, 0.42926573753356934, 0.04727835953235626, 0.10470733791589737, 0.7391214966773987, 0.4021332859992981, 0.9022776484489441, 0.49445831775665283)\n10003\tWrappedArray(0.015288203954696655, 0.019740769639611244, 0.0024439410772174597, 0.09816303849220276, 0.4492220878601074, 0.4592984616756439, 0.10241619497537613, 0.7651380896568298, 0.17417971789836884, 0.02736055664718151, 0.045552629977464676, 0.8273836374282837, 0.3692012429237366, 0.2960474491119385, 0.34824004769325256)\n10004\tWrappedArray(0.22891387343406677, 0.39364251494407654, 0.16610489785671234, 0.10513798892498016, 0.9448751211166382, 0.5321183800697327, 0.31099244952201843, 0.2138565182685852, 0.5013840198516846, 0.17088474333286285, 0.16155308485031128, 0.7293462157249451, 0.44259366393089294, 0.708382248878479, 0.39946138858795166)\n10005\tWrappedArray(0.08164983987808228, 0.5602408051490784, 0.11286234110593796, 0.17756007611751556, 0.8706688284873962, 0.5530908107757568, 0.16651791334152222, 0.36521217226982117, 0.22234411537647247, 0.3097739815711975, 0.22200632095336914, 0.538037896156311, 0.8880067467689514, 0.662290096282959, 0.428242027759552)\n10006\tWrappedArray(0.45965293049812317, 0.723820686340332, 0.03042544238269329, 0.4204581081867218, 0.7804579734802246, 0.7600538730621338, 0.03144673630595207, 0.5331404209136963, 0.26941949129104614, 0.2823721766471863, 0.004731379449367523, 0.3900667130947113, 0.7263977527618408, 0.798564076423645, 0.22960752248764038)\n10007\tWrappedArray(0.17779509723186493, 0.5973815321922302, 0.029035117477178574, 0.2907824218273163, 0.8170233368873596, 0.49700769782066345, 0.06472711265087128, 0.2986193299293518, 0.32507145404815674, 0.3036736845970154, 0.12159091979265213, 0.5472344756126404, 0.9226305484771729, 0.7662562727928162, 0.33468684554100037)\n10008\tWrappedArray(0.31804901361465454, 0.34254759550094604, 0.0818958505988121, 0.4978993535041809, 0.6933513283729553, 0.4374949336051941, 0.005491399671882391, 0.267256498336792, 0.5263557434082031, 0.1741199791431427, 0.019939059391617775, 0.4963934123516083, 0.694551408290863, 1.0093485116958618, 0.2846236526966095)\n10009\tWrappedArray(0.22627094388008118, 0.6306123733520508, 0.08225945383310318, 0.3423820734024048, 0.8679141402244568, 0.5895230770111084, 0.04482034221291542, 0.346370130777359, 0.3258010447025299, 0.2747577130794525, 0.0935450866818428, 0.5175575613975525, 0.7938183546066284, 0.7888341546058655, 0.3654049336910248)\n10010\tWrappedArray(0.37439191341400146, 0.4381978511810303, 0.20186899602413177, 0.3843417167663574, 0.7760058641433716, 0.8033459782600403, 0.15185241401195526, 0.11429069191217422, 0.4475457966327667, 0.11119291186332703, 0.08515280485153198, 0.4186404347419739, 0.3964025676250458, 0.9554404020309448, 0.38599780201911926)\n10011\tWrappedArray(0.47541528940200806, 0.4649176001548767, 0.22976581752300262, 0.1949893832206726, 0.8300044536590576, 0.7300130724906921, 0.2399667203426361, 0.2540755569934845, 0.43753451108932495, 0.09435546398162842, 0.10874296724796295, 0.48191535472869873, 0.4794978201389313, 0.9240269064903259, 0.3358495831489563)\n10012\tWrappedArray(0.3471916913986206, 0.7029987573623657, 0.09298989176750183, 0.19920006394386292, 0.8988232016563416, 0.828620195388794, 0.11288004368543625, 0.46436622738838196, 0.22813566029071808, 0.21167904138565063, 0.05496911332011223, 0.36647841334342957, 0.6503700613975525, 0.7810447216033936, 0.31327903270721436)\n10013\tWrappedArray(0.32157042622566223, 0.7917076349258423, 0.1687326580286026, 0.1552547812461853, 0.8575028777122498, 0.6232969164848328, 0.06870396435260773, 0.35831403732299805, 0.2968778908252716, 0.24908669292926788, 0.13289256393909454, 0.3367162048816681, 0.754683792591095, 0.7713807821273804, 0.4322258234024048)\n10014\tWrappedArray(0.04272770136594772, 0.7786398530006409, 0.14588283002376556, 0.2387029230594635, 0.7125974893569946, 0.710630476474762, 0.022731324657797813, 0.6223974227905273, 0.021995784714818, 0.32502618432044983, 0.1686863750219345, 0.4613038897514343, 0.7776437997817993, 0.4450528025627136, 0.39509275555610657)\n10015\tWrappedArray(0.10016662627458572, 0.3194718658924103, 0.15990497171878815, 0.05399381369352341, 0.0, 0.041528888046741486, 0.0, 0.4368860423564911, 0.12928248941898346, 0.0, 0.04489881172776222, 0.7350950837135315, 1.6349427460227162E-4, 0.06370819360017776, 0.06582420319318771)\n90001\tWrappedArray(0.12217305600643158, 0.412275493144989, 0.2502618432044983, 0.12319718301296234, 0.3762763440608978, 0.8059527277946472, 0.020920734852552414, 0.4449161887168884, 0.1812693476676941, 0.13444921374320984, 0.2517260015010834, 0.6140145659446716, 0.6413257718086243, 0.5768651962280273, 0.6879546046257019)\n90002\tWrappedArray(0.0019181889947503805, 0.006515235174447298, 0.0, 0.1478409469127655, 0.4814184010028839, 0.5650322437286377, 0.09769269078969955, 0.8076119422912598, 0.13387636840343475, 0.011313729919493198, 0.02639717422425747, 0.7725357413291931, 0.2969988286495209, 0.21505652368068695, 0.32305288314819336)\n90003\tWrappedArray(0.18455199897289276, 0.4200908839702606, 0.28667980432510376, 0.06594681739807129, 0.6031937599182129, 0.39652371406555176, 0.08816002309322357, 0.4816226363182068, 0.5005592107772827, 0.12156812846660614, 0.12255197763442993, 0.8952661156654358, 0.2979579269886017, 0.5565770864486694, 0.47064220905303955)\n90004\tWrappedArray(0.21238373219966888, 0.7801814675331116, 0.06789977103471756, 0.11359838396310806, 0.704377293586731, 0.8689013123512268, 0.036636799573898315, 0.4377036988735199, 0.15484996140003204, 0.2970220148563385, 0.11941184848546982, 0.5147197842597961, 0.7311233282089233, 0.5759134292602539, 0.4211103618144989)\n90005\tWrappedArray(0.2729431390762329, 0.7035333514213562, 0.13122089207172394, 0.2906745374202728, 0.9749149680137634, 0.5697032809257507, 0.09408538043498993, 0.3187800645828247, 0.36757829785346985, 0.258396178483963, 0.10014443099498749, 0.4737887382507324, 0.6661574244499207, 0.7555869817733765, 0.3939957916736603)\n90006\tWrappedArray(0.40280240774154663, 0.591861367225647, 0.27958670258522034, 0.34212422370910645, 0.8758940100669861, 0.418835312128067, 0.24238024652004242, 0.3672594726085663, 0.4619211256504059, 0.15001679956912994, 0.2098446786403656, 0.4142092168331146, 0.5101373195648193, 0.9531664252281189, 0.33461469411849976)\n90007\tWrappedArray(0.40996575355529785, 0.46613743901252747, 0.19709953665733337, 0.2206203043460846, 0.8872939944267273, 0.516509473323822, 0.16979363560676575, 0.24403615295886993, 0.5454510450363159, 0.12336539477109909, 0.0959838330745697, 0.5059370994567871, 0.502508819103241, 0.9053226709365845, 0.4099525809288025)\n90008\tWrappedArray(0.2173972725868225, 0.4915187954902649, 0.2586158514022827, 0.25770360231399536, 0.9859617352485657, 0.508089542388916, 0.2812754809856415, 0.010767760686576366, 0.54046630859375, 0.1500789374113083, 0.12741206586360931, 0.5794903635978699, 0.03087807074189186, 0.5844396352767944, 0.41557958722114563)\n90009\tWrappedArray(0.5067670941352844, 0.4436779022216797, 0.0958213210105896, 0.3689640462398529, 0.6294407844543457, 0.2956315577030182, 0.030196651816368103, 0.23857615888118744, 0.4925628900527954, 0.20929457247257233, 0.0776170864701271, 0.6772117614746094, 0.7871541976928711, 0.9375631213188171, 0.3166808784008026)\n90010\tWrappedArray(0.44732245802879333, 0.3748122453689575, 0.007326464168727398, 0.3522838354110718, 0.6882167458534241, 0.252936452627182, 0.03956398740410805, 0.3443329334259033, 0.4999324083328247, 0.19764867424964905, 0.013477973639965057, 0.7281979322433472, 0.7514961957931519, 0.9317710995674133, 0.24272236227989197)\n90011\tWrappedArray(0.7353916764259338, 0.4609927237033844, 0.009224665351212025, 1.048855185508728, 0.6184533834457397, 0.689414918422699, 0.057171523571014404, 0.5698869228363037, 0.2783048450946808, 0.19473935663700104, 0.016778601333498955, 0.38727638125419617, 0.7031118869781494, 0.7166462540626526, 0.25836101174354553)\n90012\tWrappedArray(0.002683627652004361, 0.14395472407341003, 0.49191468954086304, 0.2252715826034546, 0.08284688740968704, 0.15332448482513428, 0.03557323291897774, 0.536594808101654, 0.20743487775325775, 0.0065198177471756935, 0.22505593299865723, 0.5984235405921936, 0.013320909813046455, 0.3448486328125, 0.37633711099624634)\n90013\tWrappedArray(0.3157459497451782, 0.48812106251716614, 0.12371543049812317, 0.08823744207620621, 0.33709728717803955, 1.0571788549423218, 0.05936635658144951, 0.42059990763664246, 0.11556793004274368, 0.10224781185388565, 0.1424293965101242, 0.49522900581359863, 0.6482071280479431, 0.7209500670433044, 0.4510502219200134)\n90014\tWrappedArray(0.25424668192863464, 0.10473625361919403, 0.03112303465604782, 0.26392263174057007, 0.4802055060863495, 0.9498415589332581, 0.08236134052276611, 0.4236735701560974, 0.19088923931121826, 0.001674543134868145, 0.07263850420713425, 0.5349339246749878, 0.5706952810287476, 0.8678951859474182, 0.43002578616142273)\n90015\tWrappedArray(0.3503585159778595, 0.5743834376335144, 0.04815727844834328, 0.09165399521589279, 0.6879616975784302, 0.9945059418678284, 0.09323505312204361, 0.24858137965202332, 0.34418341517448425, 0.1693456768989563, 0.06376813352108002, 0.5384427309036255, 0.5391601920127869, 0.716066837310791, 0.47963452339172363)\n"
      },
      "dateCreated": "Mar 1, 2016 8:46:57 PM",
      "dateStarted": "Jun 17, 2016 2:03:31 AM",
      "dateFinished": "Jun 17, 2016 2:03:33 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Enriched ItemFactors Matrix",
      "text": "val enrichedItemFactorsDF \u003d itemFactorsDF\n  .join(itemsDF, $\"items.itemId\" \u003d\u003d\u003d $\"itemFactors.itemId\")\n  .select($\"items.itemId\", $\"title\", $\"tags\", $\"itemFactors\", $\"img\")\n  .sort($\"items.itemId\")\n  .as(\"enrichedItemFactors\")\n\nz.show(enrichedItemFactorsDF)",
      "dateUpdated": "Jun 17, 2016 1:59:32 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1461098265813_1981370856",
      "id": "20160419-203745_842155819",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "itemId\ttitle\ttags\titemFactors\timg\n10001\tLeonardo DiCaprio\tHollywood, California, United States\tWrappedArray(0.7364962697029114, 0.7269670367240906, 0.07145942002534866, 0.8969365358352661, 0.7048115730285645, 0.7652131915092468, 0.05828418582677841, 0.545279860496521, 0.28190913796424866, 0.2781541049480438, 0.016252437606453896, 0.4025684595108032, 0.7164798378944397, 0.6647099852561951, 0.21533505618572235)\timg/actors/10001.jpg\n10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\tWrappedArray(0.23682737350463867, 0.17852531373500824, 0.14213348925113678, 0.173313707113266, 0.6985136866569519, 0.5311887860298157, 0.12624157965183258, 0.34144797921180725, 0.42926573753356934, 0.04727835953235626, 0.10470733791589737, 0.7391214966773987, 0.4021332859992981, 0.9022776484489441, 0.49445831775665283)\timg/actors/10002.jpg\n10003\tAl Pacino\tManhattan, New York, United States\tWrappedArray(0.015288203954696655, 0.019740769639611244, 0.0024439410772174597, 0.09816303849220276, 0.4492220878601074, 0.4592984616756439, 0.10241619497537613, 0.7651380896568298, 0.17417971789836884, 0.02736055664718151, 0.045552629977464676, 0.8273836374282837, 0.3692012429237366, 0.2960474491119385, 0.34824004769325256)\timg/actors/10003.jpg\n10004\tMorgan Freeman\tMemphis, Tennessee, United States\tWrappedArray(0.22891387343406677, 0.39364251494407654, 0.16610489785671234, 0.10513798892498016, 0.9448751211166382, 0.5321183800697327, 0.31099244952201843, 0.2138565182685852, 0.5013840198516846, 0.17088474333286285, 0.16155308485031128, 0.7293462157249451, 0.44259366393089294, 0.708382248878479, 0.39946138858795166)\timg/actors/10004.jpg\n10005\tJames Gandolfini\tWestwood, New Jersey, United States\tWrappedArray(0.08164983987808228, 0.5602408051490784, 0.11286234110593796, 0.17756007611751556, 0.8706688284873962, 0.5530908107757568, 0.16651791334152222, 0.36521217226982117, 0.22234411537647247, 0.3097739815711975, 0.22200632095336914, 0.538037896156311, 0.8880067467689514, 0.662290096282959, 0.428242027759552)\timg/actors/10005.jpg\n10006\tTom Cruise\tSyracuse, New York, United States\tWrappedArray(0.45965293049812317, 0.723820686340332, 0.03042544238269329, 0.4204581081867218, 0.7804579734802246, 0.7600538730621338, 0.03144673630595207, 0.5331404209136963, 0.26941949129104614, 0.2823721766471863, 0.004731379449367523, 0.3900667130947113, 0.7263977527618408, 0.798564076423645, 0.22960752248764038)\timg/actors/10006.jpg\n10007\tDenzel Washington\tMount Vernon, New York, United States\tWrappedArray(0.17779509723186493, 0.5973815321922302, 0.029035117477178574, 0.2907824218273163, 0.8170233368873596, 0.49700769782066345, 0.06472711265087128, 0.2986193299293518, 0.32507145404815674, 0.3036736845970154, 0.12159091979265213, 0.5472344756126404, 0.9226305484771729, 0.7662562727928162, 0.33468684554100037)\timg/actors/10007.jpg\n10008\tRobert De Niro\tManhattan, New York, United States\tWrappedArray(0.31804901361465454, 0.34254759550094604, 0.0818958505988121, 0.4978993535041809, 0.6933513283729553, 0.4374949336051941, 0.005491399671882391, 0.267256498336792, 0.5263557434082031, 0.1741199791431427, 0.019939059391617775, 0.4963934123516083, 0.694551408290863, 1.0093485116958618, 0.2846236526966095)\timg/actors/10008.jpg\n10009\tChazz Palminteri\tBronx, New York, United States\tWrappedArray(0.22627094388008118, 0.6306123733520508, 0.08225945383310318, 0.3423820734024048, 0.8679141402244568, 0.5895230770111084, 0.04482034221291542, 0.346370130777359, 0.3258010447025299, 0.2747577130794525, 0.0935450866818428, 0.5175575613975525, 0.7938183546066284, 0.7888341546058655, 0.3654049336910248)\timg/actors/10009.jpg\n10010\tTom Hanks\tConcord, California, United States\tWrappedArray(0.37439191341400146, 0.4381978511810303, 0.20186899602413177, 0.3843417167663574, 0.7760058641433716, 0.8033459782600403, 0.15185241401195526, 0.11429069191217422, 0.4475457966327667, 0.11119291186332703, 0.08515280485153198, 0.4186404347419739, 0.3964025676250458, 0.9554404020309448, 0.38599780201911926)\timg/actors/10010.jpg\n10011\tJohn Travolta\tEnglewood, New York, United States\tWrappedArray(0.47541528940200806, 0.4649176001548767, 0.22976581752300262, 0.1949893832206726, 0.8300044536590576, 0.7300130724906921, 0.2399667203426361, 0.2540755569934845, 0.43753451108932495, 0.09435546398162842, 0.10874296724796295, 0.48191535472869873, 0.4794978201389313, 0.9240269064903259, 0.3358495831489563)\timg/actors/10011.jpg\n10012\tJohnny Depp\tOwensboro, Kentucky, United States\tWrappedArray(0.3471916913986206, 0.7029987573623657, 0.09298989176750183, 0.19920006394386292, 0.8988232016563416, 0.828620195388794, 0.11288004368543625, 0.46436622738838196, 0.22813566029071808, 0.21167904138565063, 0.05496911332011223, 0.36647841334342957, 0.6503700613975525, 0.7810447216033936, 0.31327903270721436)\timg/actors/10012.jpg\n10013\tMark Wahlberg\tBoston, Massachusetts, United States\tWrappedArray(0.32157042622566223, 0.7917076349258423, 0.1687326580286026, 0.1552547812461853, 0.8575028777122498, 0.6232969164848328, 0.06870396435260773, 0.35831403732299805, 0.2968778908252716, 0.24908669292926788, 0.13289256393909454, 0.3367162048816681, 0.754683792591095, 0.7713807821273804, 0.4322258234024048)\timg/actors/10013.jpg\n10014\tJames Franco\tPalo Alto, California, United States\tWrappedArray(0.04272770136594772, 0.7786398530006409, 0.14588283002376556, 0.2387029230594635, 0.7125974893569946, 0.710630476474762, 0.022731324657797813, 0.6223974227905273, 0.021995784714818, 0.32502618432044983, 0.1686863750219345, 0.4613038897514343, 0.7776437997817993, 0.4450528025627136, 0.39509275555610657)\timg/actors/10014.jpg\n10015\tClive Owen\tCoventry, Warwickshire, England\tWrappedArray(0.10016662627458572, 0.3194718658924103, 0.15990497171878815, 0.05399381369352341, 0.0, 0.041528888046741486, 0.0, 0.4368860423564911, 0.12928248941898346, 0.0, 0.04489881172776222, 0.7350950837135315, 1.6349427460227162E-4, 0.06370819360017776, 0.06582420319318771)\timg/actors/10015.jpg\n90001\tLinda Blair\tSt. Louis, Missouri, United States\tWrappedArray(0.12217305600643158, 0.412275493144989, 0.2502618432044983, 0.12319718301296234, 0.3762763440608978, 0.8059527277946472, 0.020920734852552414, 0.4449161887168884, 0.1812693476676941, 0.13444921374320984, 0.2517260015010834, 0.6140145659446716, 0.6413257718086243, 0.5768651962280273, 0.6879546046257019)\timg/actors/90001.jpg\n90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\tWrappedArray(0.0019181889947503805, 0.006515235174447298, 0.0, 0.1478409469127655, 0.4814184010028839, 0.5650322437286377, 0.09769269078969955, 0.8076119422912598, 0.13387636840343475, 0.011313729919493198, 0.02639717422425747, 0.7725357413291931, 0.2969988286495209, 0.21505652368068695, 0.32305288314819336)\timg/actors/90002.jpg\n90003\tRosalind Allen\tWellington, New Zealand, New Zealand\tWrappedArray(0.18455199897289276, 0.4200908839702606, 0.28667980432510376, 0.06594681739807129, 0.6031937599182129, 0.39652371406555176, 0.08816002309322357, 0.4816226363182068, 0.5005592107772827, 0.12156812846660614, 0.12255197763442993, 0.8952661156654358, 0.2979579269886017, 0.5565770864486694, 0.47064220905303955)\timg/actors/90003.jpg\n90004\tBobbie Phillips\tSalisbury, North Carolina, United States\tWrappedArray(0.21238373219966888, 0.7801814675331116, 0.06789977103471756, 0.11359838396310806, 0.704377293586731, 0.8689013123512268, 0.036636799573898315, 0.4377036988735199, 0.15484996140003204, 0.2970220148563385, 0.11941184848546982, 0.5147197842597961, 0.7311233282089233, 0.5759134292602539, 0.4211103618144989)\timg/actors/90004.jpg\n90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\tWrappedArray(0.2729431390762329, 0.7035333514213562, 0.13122089207172394, 0.2906745374202728, 0.9749149680137634, 0.5697032809257507, 0.09408538043498993, 0.3187800645828247, 0.36757829785346985, 0.258396178483963, 0.10014443099498749, 0.4737887382507324, 0.6661574244499207, 0.7555869817733765, 0.3939957916736603)\timg/actors/90005.jpg\n90006\tTatyana Ali\tBrooklyn, New York, United States\tWrappedArray(0.40280240774154663, 0.591861367225647, 0.27958670258522034, 0.34212422370910645, 0.8758940100669861, 0.418835312128067, 0.24238024652004242, 0.3672594726085663, 0.4619211256504059, 0.15001679956912994, 0.2098446786403656, 0.4142092168331146, 0.5101373195648193, 0.9531664252281189, 0.33461469411849976)\timg/actors/90006.jpg\n90007\tAngell Conwell\tOrangeburg, South Carolina, United States\tWrappedArray(0.40996575355529785, 0.46613743901252747, 0.19709953665733337, 0.2206203043460846, 0.8872939944267273, 0.516509473323822, 0.16979363560676575, 0.24403615295886993, 0.5454510450363159, 0.12336539477109909, 0.0959838330745697, 0.5059370994567871, 0.502508819103241, 0.9053226709365845, 0.4099525809288025)\timg/actors/90007.jpg\n90008\tShannah Laumeister\tSan Francisco, California, United States\tWrappedArray(0.2173972725868225, 0.4915187954902649, 0.2586158514022827, 0.25770360231399536, 0.9859617352485657, 0.508089542388916, 0.2812754809856415, 0.010767760686576366, 0.54046630859375, 0.1500789374113083, 0.12741206586360931, 0.5794903635978699, 0.03087807074189186, 0.5844396352767944, 0.41557958722114563)\timg/actors/90008.jpg\n90009\tPam Grier\tWinstom-Salem, North Carolina, United States\tWrappedArray(0.5067670941352844, 0.4436779022216797, 0.0958213210105896, 0.3689640462398529, 0.6294407844543457, 0.2956315577030182, 0.030196651816368103, 0.23857615888118744, 0.4925628900527954, 0.20929457247257233, 0.0776170864701271, 0.6772117614746094, 0.7871541976928711, 0.9375631213188171, 0.3166808784008026)\timg/actors/90009.jpg\n90010\tTiffani Thiessen\tLong Beach, California, United States\tWrappedArray(0.44732245802879333, 0.3748122453689575, 0.007326464168727398, 0.3522838354110718, 0.6882167458534241, 0.252936452627182, 0.03956398740410805, 0.3443329334259033, 0.4999324083328247, 0.19764867424964905, 0.013477973639965057, 0.7281979322433472, 0.7514961957931519, 0.9317710995674133, 0.24272236227989197)\timg/actors/90010.jpg\n90011\tAshley Judd\tGranada Hills, California, United States\tWrappedArray(0.7353916764259338, 0.4609927237033844, 0.009224665351212025, 1.048855185508728, 0.6184533834457397, 0.689414918422699, 0.057171523571014404, 0.5698869228363037, 0.2783048450946808, 0.19473935663700104, 0.016778601333498955, 0.38727638125419617, 0.7031118869781494, 0.7166462540626526, 0.25836101174354553)\timg/actors/90011.jpg\n90012\tStacey Dash\tBronx, New York, United States\tWrappedArray(0.002683627652004361, 0.14395472407341003, 0.49191468954086304, 0.2252715826034546, 0.08284688740968704, 0.15332448482513428, 0.03557323291897774, 0.536594808101654, 0.20743487775325775, 0.0065198177471756935, 0.22505593299865723, 0.5984235405921936, 0.013320909813046455, 0.3448486328125, 0.37633711099624634)\timg/actors/90012.jpg\n90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\tWrappedArray(0.3157459497451782, 0.48812106251716614, 0.12371543049812317, 0.08823744207620621, 0.33709728717803955, 1.0571788549423218, 0.05936635658144951, 0.42059990763664246, 0.11556793004274368, 0.10224781185388565, 0.1424293965101242, 0.49522900581359863, 0.6482071280479431, 0.7209500670433044, 0.4510502219200134)\timg/actors/90013.jpg\n90014\tGail O\u0027Grady\tDetroit, Michigan, United States\tWrappedArray(0.25424668192863464, 0.10473625361919403, 0.03112303465604782, 0.26392263174057007, 0.4802055060863495, 0.9498415589332581, 0.08236134052276611, 0.4236735701560974, 0.19088923931121826, 0.001674543134868145, 0.07263850420713425, 0.5349339246749878, 0.5706952810287476, 0.8678951859474182, 0.43002578616142273)\timg/actors/90014.jpg\n90015\tBarbara Niven\tPortland, Oregon, United States\tWrappedArray(0.3503585159778595, 0.5743834376335144, 0.04815727844834328, 0.09165399521589279, 0.6879616975784302, 0.9945059418678284, 0.09323505312204361, 0.24858137965202332, 0.34418341517448425, 0.1693456768989563, 0.06376813352108002, 0.5384427309036255, 0.5391601920127869, 0.716066837310791, 0.47963452339172363)\timg/actors/90015.jpg\n"
      },
      "dateCreated": "Apr 19, 2016 8:37:45 PM",
      "dateStarted": "Jun 17, 2016 2:03:32 AM",
      "dateFinished": "Jun 17, 2016 2:03:35 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Calculate Predicted Rating for a Given userId and ItemId - compare Prediction to above",
      "text": "import com.advancedspark.ml.BLAS\nimport com.advancedspark.ml.Vectors\n\n// User 21619\nval givenUserId \u003d 21619\nval givenUserFactors \u003d userFactorsDF.select($\"userId\", $\"userFactors\")\n  .where($\"userId\" \u003d\u003d\u003d givenUserId)\n  .map(row \u003d\u003e row.getSeq[Double](1).toArray)\n  .collect()(0)\n\n// Item 10006 - Tom Cruise\nval givenItemId \u003d 10006\nval givenItemFactors \u003d itemFactorsDF.select($\"itemId\", $\"itemFactors\")\n  .where($\"itemId\" \u003d\u003d\u003d givenItemId)\n  .map(row \u003d\u003e row.getSeq[Double](1).toArray)\n  .collect()(0)\n  \nval givenUserFactorsVector \u003d Vectors.dense(givenUserFactors)\nval givenItemFactorsVector \u003d Vectors.dense(givenItemFactors)\n\n// Take dot product of the User x Item vectors\n// This should equal the prediction value in the offline-generated matrix\nval prediction \u003d BLAS.dot(givenUserFactorsVector, givenItemFactorsVector)",
      "dateUpdated": "Jun 17, 2016 1:59:32 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456954812726_1681075178",
      "id": "20160302-214012_540640872",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import com.advancedspark.ml.BLAS\nimport com.advancedspark.ml.Vectors\ngivenUserId: Int \u003d 21619\ngivenUserFactors: Array[Double] \u003d Array(0.02926018089056015, 0.16599497199058533, 0.08078518509864807, 0.038635049015283585, 0.10967836529016495, 0.27115383744239807, 0.0, 0.15189872682094574, 0.04436366260051727, 0.059076495468616486, 0.08985993266105652, 0.20488500595092773, 0.2377440333366394, 0.17517022788524628, 0.22722020745277405)\ngivenItemId: Int \u003d 10006\ngivenItemFactors: Array[Double] \u003d Array(0.45965293049812317, 0.723820686340332, 0.03042544238269329, 0.4204581081867218, 0.7804579734802246, 0.7600538730621338, 0.03144673630595207, 0.5331404209136963, 0.26941949129104614, 0.2823721766471863, 0.004731379449367523, 0.3900667130947113, 0.7263977527618408, 0.798564076423645, 0.22960752248764038)\ngivenUserFactorsVector: com.advancedspark.ml.Vector \u003d [0.02926018089056015,0.16599497199058533,0.08078518509864807,0.038635049015283585,0.10967836529016495,0.27115383744239807,0.0,0.15189872682094574,0.04436366260051727,0.059076495468616486,0.08985993266105652,0.20488500595092773,0.2377440333366394,0.17517022788524628,0.22722020745277405]\ngivenItemFactorsVector: com.advancedspark.ml.Vector \u003d [0.45965293049812317,0.723820686340332,0.03042544238269329,0.4204581081867218,0.7804579734802246,0.7600538730621338,0.03144673630595207,0.5331404209136963,0.26941949129104614,0.2823721766471863,0.004731379449367523,0.3900667130947113,0.7263977527618408,0.798564076423645,0.22960752248764038]\nprediction: Double \u003d 0.9987075252530107\n"
      },
      "dateCreated": "Mar 2, 2016 9:40:12 PM",
      "dateStarted": "Jun 17, 2016 2:03:34 AM",
      "dateFinished": "Jun 17, 2016 2:03:37 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Save User and Item Factors in ElasticSearch",
      "text": "val esConfig \u003d Map(\"pushdown\" -\u003e \"true\", \"es.nodes\" -\u003e \"127.0.0.1\", \"es.port\" -\u003e \"9200\")\n\nuserFactorsDF.select($\"userId\", $\"userFactors\")\n .sort($\"userId\" asc)\n .write.format(\"org.elasticsearch.spark.sql\")\n .mode(\"overwrite\")\n .options(esConfig)\n .save(\"advancedspark/user-factors-als\")\n \nenrichedItemFactorsDF.select($\"itemId\", $\"title\", $\"itemFactors\", $\"tags\", $\"img\")\n .sort($\"itemId\" asc)\n .write.format(\"org.elasticsearch.spark.sql\")\n .mode(\"overwrite\")\n .options(esConfig)\n .save(\"advancedspark/item-factors-als\")",
      "dateUpdated": "Jun 17, 2016 2:19:28 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465836378186_1867004843",
      "id": "20160613-164618_317111417",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "esConfig: scala.collection.immutable.Map[String,String] \u003d Map(pushdown -\u003e true, es.nodes -\u003e 127.0.0.1, es.port -\u003e 9200)\nwarning: there were 1 feature warning(s); re-run with -feature for details\nwarning: there were 1 feature warning(s); re-run with -feature for details\n"
      },
      "dateCreated": "Jun 13, 2016 4:46:18 PM",
      "dateStarted": "Jun 17, 2016 2:03:38 AM",
      "dateFinished": "Jun 17, 2016 2:03:43 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Save User And Item Factors In Redis",
      "text": "import com.netflix.dyno.jedis._\nimport com.netflix.dyno.connectionpool.Host\nimport com.netflix.dyno.connectionpool.HostSupplier\nimport com.netflix.dyno.connectionpool.TokenMapSupplier\nimport com.netflix.dyno.connectionpool.impl.lb.HostToken\nimport com.netflix.dyno.connectionpool.exception.DynoException\nimport com.netflix.dyno.connectionpool.impl.ConnectionPoolConfigurationImpl;\nimport com.netflix.dyno.connectionpool.impl.ConnectionContextImpl\nimport com.netflix.dyno.connectionpool.impl.OperationResultImpl\nimport com.netflix.dyno.connectionpool.impl.utils.ZipUtils\n\n//import scala.collection.JavaConverters._\n\nimport java.util.Collections\nimport java.util.Collection\nimport java.util.Set\nimport java.util.List\n\nval localhostHost \u003d new Host(\"127.0.0.1\", Host.Status.Up)\nval localhostToken \u003d new HostToken(100000L, localhostHost)\n\nval localhostHostSupplier \u003d new HostSupplier() {\n  @Override\n  def getHosts(): Collection[Host] \u003d {\n    Collections.singletonList(localhostHost)\n  }\n}\n\nval localhostTokenMapSupplier \u003d new TokenMapSupplier() {\n  @Override\n  def getTokens(activeHosts: Set[Host]): List[HostToken] \u003d {\n\tCollections.singletonList(localhostToken)\n  }\n\n  @Override\n  def getTokenForHost(host: Host, activeHosts: Set[Host]): HostToken \u003d {\n    return localhostToken\n  }\n}\n\nval redisPort \u003d 6379                        \nval dynoClient \u003d new DynoJedisClient.Builder()\n              .withApplicationName(\"pipeline\")\n              .withDynomiteClusterName(\"pipeline-dynomite\")\n              .withHostSupplier(localhostHostSupplier)\n              .withCPConfig(new ConnectionPoolConfigurationImpl(\"localhostTokenMapSupplier\")\n                .withTokenSupplier(localhostTokenMapSupplier))\n              .withPort(redisPort)\n              .build()\n\nval recommendations \u003d enrichedRecommendationsDF.collect()\n\n// TODO:  Save each \ndynoClient.set(\"user-factors-als\", givenUserFactors.mkString(\",\"))\ndynoClient.set(\"item-factors-als\", enrichedItemFactorsDF.mkString(\",\"))\n\ndynoClient.stopClient()",
      "dateUpdated": "Jun 17, 2016 2:23:32 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1466127984927_-127542757",
      "id": "20160617-014624_1196430927",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT"
      },
      "dateCreated": "Jun 17, 2016 1:46:24 AM",
      "dateStarted": "Jun 17, 2016 2:03:38 AM",
      "dateFinished": "Jun 17, 2016 2:03:38 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Save model in spark parquet format",
      "text": "bestRecommendationModel.save(s\"/root/pipeline/datasets/serving/live-recommendations/spark-1.6.1/als/${System.currentTimeMillis}.parquet\")",
      "dateUpdated": "Jun 17, 2016 1:59:38 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1463371290389_-1491857833",
      "id": "20160516-040130_1028627154",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": ""
      },
      "dateCreated": "May 16, 2016 4:01:30 AM",
      "dateStarted": "Jun 17, 2016 2:03:46 AM",
      "dateFinished": "Jun 17, 2016 2:03:52 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "text": "import com.netflix.dyno.jedis._\nimport com.netflix.dyno.connectionpool.Host\nimport com.netflix.dyno.connectionpool.HostSupplier\nimport com.netflix.dyno.connectionpool.TokenMapSupplier\nimport com.netflix.dyno.connectionpool.impl.lb.HostToken\nimport com.netflix.dyno.connectionpool.exception.DynoException\nimport com.netflix.dyno.connectionpool.impl.ConnectionPoolConfigurationImpl;\nimport com.netflix.dyno.connectionpool.impl.ConnectionContextImpl\nimport com.netflix.dyno.connectionpool.impl.OperationResultImpl\nimport com.netflix.dyno.connectionpool.impl.utils.ZipUtils\n\n//import scala.collection.JavaConverters._\n\nimport java.util.Collections\nimport java.util.Collection\nimport java.util.Set\nimport java.util.List\n\nval localhostHost \u003d new Host(\"127.0.0.1\", Host.Status.Up)\nval localhostToken \u003d new HostToken(100000L, localhostHost)\n\nval localhostHostSupplier \u003d new HostSupplier() {\n  @Override\n  def getHosts(): Collection[Host] \u003d {\n    Collections.singletonList(localhostHost)\n  }\n}\n\nval localhostTokenMapSupplier \u003d new TokenMapSupplier() {\n  @Override\n  def getTokens(activeHosts: Set[Host]): List[HostToken] \u003d {\n\tCollections.singletonList(localhostToken)\n  }\n\n  @Override\n  def getTokenForHost(host: Host, activeHosts: Set[Host]): HostToken \u003d {\n    return localhostToken\n  }\n}\n\nval redisPort \u003d 6379                        \nval dynoClient \u003d new DynoJedisClient.Builder()\n              .withApplicationName(\"pipeline\")\n              .withDynomiteClusterName(\"pipeline-dynomite\")\n              .withHostSupplier(localhostHostSupplier)\n              .withCPConfig(new ConnectionPoolConfigurationImpl(\"localhostTokenMapSupplier\")\n                .withTokenSupplier(localhostTokenMapSupplier))\n              .withPort(redisPort)\n              .build()\n\nval recommendations \u003d enrichedRecommendationsDF.collect()\n\ndynoClient.set(\"personalized-als\", recommendations.mkString(\",\"))\n\nval retrievedRecommenations \u003d dynoClient.get(\"personalized-als\")\n\ndynoClient.stopClient()",
      "dateUpdated": "Jun 17, 2016 2:15:34 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala"
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464665341507_-1919350067",
      "id": "20160531-032901_1479451131",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT"
      },
      "dateCreated": "May 31, 2016 3:29:01 AM",
      "dateStarted": "Jun 17, 2016 2:03:52 AM",
      "dateFinished": "Jun 17, 2016 2:03:53 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    }
  ],
  "name": "Live Recs/02: User-to-Item Collaborative Filter Recs (ALS)",
  "id": "2AUYFSKXN",
  "angularObjects": {
    "2ARR8UZDJ": [],
    "2AS9P7JSA": [],
    "2AR33ZMZJ": []
  },
  "config": {
    "looknfeel": "default"
  },
  "info": {}
}