{
  "paragraphs": [
    {
      "title": "Collaborative Filtering:  Matrix Factorization using Alternating Least Squares (ALS)",
      "text": "%md ![Alternating Least Squares - Matrix Factorization](http://advancedspark.com/img/collaborative-filtering-with-als-matrix-factorization.png)",
      "dateUpdated": "Jun 11, 2016 5:40:55 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "title": true,
        "editorHide": true,
        "editorMode": "ace/mode/markdown",
        "enabled": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1435978153894_1534941045",
      "id": "20150704-024913_884517592",
      "result": {
        "code": "SUCCESS",
        "type": "HTML",
        "msg": "\u003cp\u003e\u003cimg src\u003d\"http://advancedspark.com/img/collaborative-filtering-with-als-matrix-factorization.png\" alt\u003d\"Alternating Least Squares - Matrix Factorization\" /\u003e\u003c/p\u003e\n"
      },
      "dateCreated": "Jul 4, 2015 2:49:13 AM",
      "dateStarted": "Jun 11, 2016 5:40:55 AM",
      "dateFinished": "Jun 11, 2016 5:40:55 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Get Reference Data for Enrichment",
      "text": "val itemsDF \u003d sqlContext.read.format(\"json\")\n  .load(\"file:/root/pipeline/myapps/html/advancedspark.com/json/actors.json\")\n  .withColumnRenamed(\"id\", \"itemId\")\n  .as(\"items\")\n\nz.show(itemsDF.select($\"itemId\", $\"title\", $\"img\", $\"tags\", $\"description\"))",
      "dateUpdated": "Jun 11, 2016 5:40:55 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 175.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "itemId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "title",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "itemId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "title",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456864386968_-1684206029",
      "id": "20160301-203306_1764877860",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "itemId\ttitle\timg\ttags\tdescription\n90001\tLinda Blair\timg/actors/90001.jpg\tSt. Louis, Missouri, United States\tFrom the age of five, Linda Blair had to get used to the spotlight, first as a child model and then as an actress, when out of 600 applicants she was picked for the role of Regan, the possessed child, in The Exorcist. Linda quickly rose to international fame, won the Golden Globe, and seemed to be set to take the Academy Award for that role...\n90002\tShannon Whirry\timg/actors/90002.jpg\tGreen Lake, Wisconsin, United States\tShannon Whirry is not just a talented actress with girl-next-door looks, she captured a generation of viewers\u0027 imaginations by wishing that she actually was the girl-next-door. Born in Green Lake County, Wisconsin, Whirry graduated from high school and packed her bags for New York. She trained at the...\n90003\tRosalind Allen\timg/actors/90003.jpg\tWellington, New Zealand, New Zealand\tRosalind Allen (born Rosalind Ingledew) hails from New Zealand and studied acting there before coming to the United States. Her movie debut was in the film, Perfect, and she continues a long career in television \u0026 film. Famously remembered as the \"It girl\" in the Seinfeld episode, The Marine Biologist...\n90004\tBobbie Phillips\timg/actors/90004.jpg\tSalisbury, North Carolina, United States\tBrains and beauty are two words that have been repeatedly used to describe Bobbie Phillips throughout her career. Graduating high school at 16 years old, Bobbie tried several different career paths. After taking college classes to become a litigation attorney, it was suggested she also take drama classes...\n90005\tKeshia Knight Pulliam\timg/actors/90005.jpg\tNewark, New Jersey, United States\tKeshia Knight Pulliam was born on April 9, 1979 in Newark, New Jersey, USA. She is an actress, known for The Cosby Show (1984), Madea Goes to Jail (2009) and Beauty Shop (2005).\n90006\tTatyana Ali\timg/actors/90006.jpg\tBrooklyn, New York, United States\tOn January 24, 1979, Tatyana Marisol Ali was born to Sonia, who was a nurse from Panama, and Sheriff Ali, a retired police officer from Trinidad. At the age of four she started singing and got a taste of fame when she begged her mother to take her to an audition for Sesame Street. She went on to perform in many productions in her native city...\n90007\tAngell Conwell\timg/actors/90007.jpg\tOrangeburg, South Carolina, United States\tBorn in the tiny town of Orangeburg, South Carolina, Angell Conwell began her journey at a very young age. After winning countless pageants locally, she signed with Wilhelmina\u0027s Kids Division in New York at the age of 10. Angell enjoyed modeling but yearned for more of a challenge. She begged for her parents permission to audition for a role in August Wilson\u0027s highly acclaimed...\n90008\tShannah Laumeister\timg/actors/90008.jpg\tSan Francisco, California, United States\tShannah Laumeister was born on July 23, 1969 in San Francisco, California, USA. She is an actress and director, known for Bullets Over Broadway (1994), Nobody\u0027s Fool (1994) and 61* (2001). She was previously married to Bert Stern.\n90009\tPam Grier\timg/actors/90009.jpg\tWinstom-Salem, North Carolina, United States\tPam Grier was born in Winston-Salem, NC, one of four children of Gwendolyn Sylvia (Samuels), a nurse, and Clarence Ransom Grier Jr., an Air Force mechanic. Pam has been a major African-American star from the early 1970s. Her career started in 1971, when Roger Corman of New World Pictures launched her with The Big Doll House...\n90010\tTiffani Thiessen\timg/actors/90010.jpg\tLong Beach, California, United States\tTiffani-Amber Thiessen was born on January 23, 1974, in Long Beach, California, USA, to Frank Thiessen, a park designer, and Robyn Ernest, a homemaker. She grew up in Long Beach with her parents and her brothers, professional cyclist Todd (b. 1968) and Schuyler (b. 1977). When Tiffani was 8, her uncle...\n90011\tAshley Judd\timg/actors/90011.jpg\tGranada Hills, California, United States\tAshley Judd was born on April 19, 1968 in Granada Hills, California, USA as Ashley Tyler Ciminella. She is an actress and producer, known for Divergent (2014), Heat (1995) and Double Jeopardy (1999). She was previously married to Dario Franchitti.\n90012\tStacey Dash\timg/actors/90012.jpg\tBronx, New York, United States\tStacey Dash was born in the Bronx, New York. Stacy knew that she wanted to act, and from an early age began to act professionally. She made regular appearances on The Cosby Show, The Fresh Prince of Bel-Air, and also St. Elsewhere. At 21 she made her feature film debut in Enemy Territory, which was quickly followed by Moving...\n90013\tSofia Vergara\timg/actors/90013.jpg\tBarranquilla, Atlantico, Colombia\tSofia Margarita Vergara Vergara was born and raised in Barranquilla, Colombia. Her mother, Margarita Vergara Davila de Vergara, is a housewife. Her father, Julio Enrique Vergara Robayo, provides cattle to the meat industry. She has five siblings. She was educated at a private bilingual Spanish/English school...\n90014\tGail O\u0027Grady\timg/actors/90014.jpg\tDetroit, Michigan, United States\tGail O\u0027Grady was born on January 23, 1963 in Detroit, Michigan, USA as Gail Ann O\u0027Grady. She is an actress and producer, known for American Dreams (2002), Deuce Bigalow: Male Gigolo (1999) and NYPD Blue (1993). She was previously married to John Stamatakis, Anthony J Pellegrino, Steve Fenton, Severin Wunderman, Jeffrey Byron and Richard Dasko.\n90015\tBarbara Niven\timg/actors/90015.jpg\tPortland, Oregon, United States\tBarbara Niven was born on February 26, 1953 in Portland, Oregon, USA as Barbara Lee Bucholz. She is an actress and producer, known for A Perfect Ending (2012), Pensacola: Wings of Gold (1997) and The Rat Pack (1998).\n10001\tLeonardo DiCaprio\timg/actors/10001.jpg\tHollywood, California, United States\tFew actors in the world have had a career quite as diverse as Leonardo DiCaprio\u0027s. DiCaprio has gone from relatively humble beginnings, as a supporting cast member of the sitcom Growing Pains and low budget horror movies, such as Critters 3, to a major teenage heartthrob in the 1990s, as the hunky lead actor in movies such as Romeo + Juliet and Titanic...\n10002\tAnthony Hopkins\timg/actors/10002.jpg\tPort Talbot, Glamorgan, Wales\tAnthony Hopkins was born on December 31, 1937, in Margam, Wales, to Muriel Anne (Yeats) and Richard Arthur Hopkins, a baker. His parents were both of half Welsh and half English descent. Influenced by Richard Burton, he decided to study at College of Music and Drama and graduated in 1957. In 1965, he moved to London and joined the National Theatre...\n10003\tAl Pacino\timg/actors/10003.jpg\tManhattan, New York, United States\tOne of the greatest actors in all of film history, Al Pacino established himself during one of film\u0027s greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents...\n10004\tMorgan Freeman\timg/actors/10004.jpg\tMemphis, Tennessee, United States\tWith an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born in June 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended...\n10005\tJames Gandolfini\timg/actors/10005.jpg\tWestwood, New Jersey, United States\tJames Gandolfini was born in Westwood, New Jersey, to Santa (Penna), a high school lunchlady, and James Joseph Gandolfini, Sr., a bricklayer and head school janitor. His parents were both of Italian origin. Gandolfini began acting in the New York theater. His Broadway debut was in the 1992 revival of \"A Streetcar Named Desire\" with Jessica Lange and Alec Baldwin...\n10006\tTom Cruise\timg/actors/10006.jpg\tSyracuse, New York, United States\tIf you had told fourteen-year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not-too-distant future he would be considered one of the top hundred movie stars of all time, he would have probably grinned and told you that his ambition was to become a priest. None the less, this sensitive, deeply religious youngster who...\n10007\tDenzel Washington\timg/actors/10007.jpg\tMount Vernon, New York, United States\tDenzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis (Lowe), from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University...\n10008\tRobert De Niro\timg/actors/10008.jpg\tManhattan, New York, United States\tRobert De Niro, thought of as one of the greatest American actors of all time, was born in New York City, to artists Virginia (Admiral) and Robert De Niro Sr. His paternal grandfather was of Italian descent, and his other ancestry is Irish, Dutch, English, French, and German. He was trained at the Stella Adler Conservatory and the American Workshop...\n10009\tChazz Palminteri\timg/actors/10009.jpg\tBronx, New York, United States\tBronx-born and raised Chazz Palminteri was a natural choice to continue the Italianate torch in film. In the tradition set forth in the 1970s by such icons as director Martin Scorsese and actors Robert De Niro, Al Pacino, John Cazale and Joe Pesci, Palminteri has brought grit, muscle and an evocative realism to the sidewalks of his New York neighborhood...\n10010\tTom Hanks\timg/actors/10010.jpg\tConcord, California, United States\tThomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an itinerant cook. His father had English, and some German, ancestry, while his mother\u0027s family, originally surnamed \"Fraga\", was entirely Portuguese. Tom grew up in what he has called a \"fractured\" family...\n10011\tJohn Travolta\timg/actors/10011.jpg\tEnglewood, New York, United States\tJohn Travolta was born in Englewood, New Jersey, one of six children of Helen Travolta Helen Cecilia Burke) and Salvatore Travolta. His father was of Italian descent and his mother was of Irish ancestry. His father owned a tire repair shop called Travolta Tires in Hillsdale, NJ. Travolta appeared in a local production of \"Who\u0027ll Save the Plowboy?\"...\n10012\tJohnny Depp\timg/actors/10012.jpg\tOwensboro, Kentucky, United States\tJohnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15...\n10013\tMark Wahlberg\timg/actors/10013.jpg\tBoston, Massachusetts, United States\tAmerican actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to respected actor. A Best Supporting Actor Oscar nominee for The Departed who went on to receive positive critical reviews for his performance in The Fighter, Wahlberg also is a solid comedy actor, proven by his starring role in Ted...\n10014\tJames Franco\timg/actors/10014.jpg\tPalo Alto, California, United States\tKnown for his breakthrough starring role on Freaks and Geeks, James Franco was born in Palo Alto, California on April 19, 1978. His mother, Betsy Franco, is Jewish, and his father, Douglas Eugene \"Doug\" Franco, was of Portuguese and Swedish descent, and ran a Silicon Valley business. James\u0027s mother, a writer, has occasionally acted...\n10015\tClive Owen\timg/actors/10015.jpg\tCoventry, Warwickshire, England\tDarkly handsome British actor Clive Owen is one of a handful of stars best known for his art house films but how has handle more mainstream action films lately with equal measures of grace and skill. Owen typically is cast as characters whose primary traits are a balance of physical strength, intellect...\n"
      },
      "dateCreated": "Mar 1, 2016 8:33:06 PM",
      "dateStarted": "Jun 11, 2016 5:40:55 AM",
      "dateFinished": "Jun 11, 2016 5:40:56 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Get Live Ratings from Cassandra",
      "text": "val cassandraConfig \u003d Map(\"keyspace\" -\u003e \"advancedspark\", \"table\" -\u003e \"item_ratings\")\n\nval itemRatingsDF \u003d sqlContext.read.format(\"org.apache.spark.sql.cassandra\")\n  .options(cassandraConfig)\n  .load()\n  .select($\"userid\", $\"itemid\", $\"rating\", $\"timestamp\")\n  .withColumnRenamed(\"userid\", \"userId\")\n  .withColumnRenamed(\"itemid\", \"itemId\")\n  .as(\"itemRatings\")\n  \nz.show(itemRatingsDF.sort($\"userId\" asc))",
      "dateUpdated": "Jun 11, 2016 5:40:55 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456864425764_-1117794352",
      "id": "20160301-203345_1180596367",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\titemId\trating\ttimestamp\n308\t10005\t1.0\t1465602164000\n308\t10006\t1.0\t1465602162000\n308\t10003\t1.0\t1465602176000\n308\t10004\t1.0\t1465602178000\n308\t10008\t1.0\t1465602162000\n308\t90002\t1.0\t1465602158000\n308\t10002\t1.0\t1465602156000\n308\t90003\t1.0\t1465602132000\n308\t10009\t1.0\t1465602178000\n308\t90004\t1.0\t1465602132000\n308\t90005\t1.0\t1465602156000\n308\t10010\t1.0\t1465602180000\n308\t90006\t1.0\t1465602172000\n308\t90007\t1.0\t1465602174000\n308\t10011\t1.0\t1465602180000\n308\t90008\t1.0\t1465602158000\n308\t90009\t1.0\t1465602134000\n308\t10012\t1.0\t1465602180000\n308\t90010\t1.0\t1465602132000\n308\t10001\t1.0\t1465602134000\n308\t90011\t1.0\t1465602156000\n308\t10013\t1.0\t1465602180000\n308\t90012\t1.0\t1465602174000\n308\t90013\t1.0\t1465602176000\n308\t10014\t1.0\t1465602182000\n308\t90014\t1.0\t1465602160000\n308\t90015\t1.0\t1465602160000\n308\t10007\t1.0\t1465602162000\n308\t10015\t1.0\t1465602182000\n308\t90001\t1.0\t1465602172000\n3342\t10004\t1.0\t1465602374000\n3342\t90009\t1.0\t1465602368000\n3342\t90011\t1.0\t1465602370000\n3342\t90012\t1.0\t1465602370000\n3342\t10005\t1.0\t1465602374000\n3342\t10006\t1.0\t1465602374000\n21619\t10014\t1.0\t1465049318000\n21619\t90001\t1.0\t1465049312000\n21619\t90013\t1.0\t1465049314000\n21619\t10013\t1.0\t1465049318000\n21619\t90015\t1.0\t1465049314000\n21619\t10012\t1.0\t1465049318000\n27981\t10007\t1.0\t1465047836000\n27981\t10008\t1.0\t1465047836000\n27981\t90009\t1.0\t1465047834000\n27981\t10006\t1.0\t1465047836000\n27981\t90010\t1.0\t1465047834000\n27981\t90011\t1.0\t1465047834000\n47154\t10005\t1.0\t1465602076000\n47154\t90011\t1.0\t1465602072000\n47154\t10006\t1.0\t1465602076000\n47154\t10007\t1.0\t1465602076000\n47154\t10014\t1.0\t1465602078000\n47154\t10008\t1.0\t1465602078000\n47154\t90002\t1.0\t1465602068000\n47154\t90005\t1.0\t1465602072000\n47154\t10011\t1.0\t1465602080000\n47154\t10012\t1.0\t1465602078000\n47154\t90003\t1.0\t1465602070000\n47154\t90008\t1.0\t1465602074000\n47154\t90009\t1.0\t1465602072000\n47154\t10013\t1.0\t1465602078000\n47154\t90004\t1.0\t1465602070000\n47154\t90010\t1.0\t1465602072000\n"
      },
      "dateCreated": "Mar 1, 2016 8:33:45 PM",
      "dateStarted": "Jun 11, 2016 5:40:55 AM",
      "dateFinished": "Jun 11, 2016 5:40:58 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Split the dataset into training (80%) and test (20%) datasets",
      "text": "val Array(trainingItemRatingsDF, testItemRatingsDF) \u003d itemRatingsDF.randomSplit(Array(0.8, 0.2))",
      "dateUpdated": "Jun 11, 2016 5:40:55 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464993227165_2068920002",
      "id": "20160603-223347_625689489",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "trainingItemRatingsDF: org.apache.spark.sql.DataFrame \u003d [userId: int, itemId: int, rating: float, timestamp: bigint]\ntestItemRatingsDF: org.apache.spark.sql.DataFrame \u003d [userId: int, itemId: int, rating: float, timestamp: bigint]\n"
      },
      "dateCreated": "Jun 3, 2016 10:33:47 PM",
      "dateStarted": "Jun 11, 2016 5:40:57 AM",
      "dateFinished": "Jun 11, 2016 5:40:59 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Train The ALS Model With the training dataset",
      "text": "import org.apache.spark.ml.recommendation.ALS\n\nval rank \u003d 5 // this is k, number of latent factors we think exist\nval maxIterations \u003d 10\nval convergenceThreshold \u003d 0.01\n\nval als \u003d new ALS()\n  .setRank(rank)\n  .setRegParam(convergenceThreshold)\n  .setUserCol(\"userId\")\n  .setItemCol(\"itemId\")\n  .setRatingCol(\"rating\")\n  .setImplicitPrefs(true)\n\nval trainingModel \u003d als.fit(trainingItemRatingsDF)\n\ntrainingModel.setPredictionCol(\"prediction\")",
      "dateUpdated": "Jun 11, 2016 7:00:06 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "title": true,
        "editorHide": false,
        "editorMode": "ace/mode/scala",
        "enabled": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1435978256373_-160526409",
      "id": "20150704-025056_169923529",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import org.apache.spark.ml.recommendation.ALS\nrank: Int \u003d 10\nmaxIterations: Int \u003d 20\nconvergenceThreshold: Double \u003d 0.01\nals: org.apache.spark.ml.recommendation.ALS \u003d als_1ec34f111dfb\ntrainingModel: org.apache.spark.ml.recommendation.ALSModel \u003d als_1ec34f111dfb\nres124: trainingModel.type \u003d als_1ec34f111dfb\n"
      },
      "dateCreated": "Jul 4, 2015 2:50:56 AM",
      "dateStarted": "Jun 11, 2016 5:40:58 AM",
      "dateFinished": "Jun 11, 2016 5:41:08 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Evaluate the Model with the test dataset",
      "text": "import org.apache.spark.ml.evaluation.RegressionEvaluator\n\nval actualItemRatingsDF \u003d trainingModel.transform(testItemRatingsDF)\n\nval modelEvaluator \u003d new RegressionEvaluator()\n  .setMetricName(\"rmse\")\n  .setLabelCol(\"rating\")\n  .setPredictionCol(\"prediction\")\n\nval rmse \u003d modelEvaluator.evaluate(actualItemRatingsDF)\n\nprintln(s\"Root Mean Square Error \u003d $rmse between actual and expected itemRatings\")",
      "dateUpdated": "Jun 11, 2016 5:40:55 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464992813458_-888489907",
      "id": "20160603-222653_1839242653",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import org.apache.spark.ml.evaluation.RegressionEvaluator\nactualItemRatingsDF: org.apache.spark.sql.DataFrame \u003d [userId: int, itemId: int, rating: float, timestamp: bigint, prediction: float]\nmodelEvaluator: org.apache.spark.ml.evaluation.RegressionEvaluator \u003d regEval_52ce5ef2aabc\nrmse: Double \u003d NaN\nRoot Mean Square Error \u003d NaN between actual and expected itemRatings\n"
      },
      "dateCreated": "Jun 3, 2016 10:26:53 PM",
      "dateStarted": "Jun 11, 2016 5:40:59 AM",
      "dateFinished": "Jun 11, 2016 5:41:14 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Retrain with the entire dataset",
      "text": "val model \u003d als.fit(itemRatingsDF)\n\nmodel.setPredictionCol(\"prediction\")",
      "dateUpdated": "Jun 11, 2016 5:40:55 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464996331980_906433755",
      "id": "20160603-232531_2131104428",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "model: org.apache.spark.ml.recommendation.ALSModel \u003d als_1ec34f111dfb\nres133: model.type \u003d als_1ec34f111dfb\n"
      },
      "dateCreated": "Jun 3, 2016 11:25:31 PM",
      "dateStarted": "Jun 11, 2016 5:41:09 AM",
      "dateFinished": "Jun 11, 2016 5:41:18 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Find all (User, item) pairs without an existing Rating",
      "text": "val allDistinctUsersDF \u003d itemRatingsDF.select($\"userId\")\n  .distinct()\n  .as(\"users\")\n\nval allDistinctItemsDF \u003d itemRatingsDF.select($\"itemId\")\n  .distinct()\n  .as(\"items\")\n\nval allUserItemPairsDF \u003d allDistinctUsersDF.join(allDistinctItemsDF)\n  .except(itemRatingsDF.select($\"userId\", $\"itemId\"))\n  .cache()\n\nz.show(allUserItemPairsDF.sort($\"userId\", $\"itemId\"))",
      "dateUpdated": "Jun 11, 2016 5:40:56 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 288.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1461100304691_419185220",
      "id": "20160419-211144_1773438539",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\titemId\n308\t10001\n308\t10002\n308\t10003\n308\t10004\n308\t10005\n308\t10006\n308\t10007\n308\t10008\n308\t10009\n308\t10010\n308\t10011\n308\t10012\n308\t10013\n308\t10014\n308\t10015\n308\t90001\n308\t90002\n308\t90003\n308\t90004\n308\t90005\n308\t90006\n308\t90007\n308\t90008\n308\t90009\n308\t90010\n308\t90011\n308\t90012\n308\t90013\n308\t90014\n308\t90015\n3342\t10001\n3342\t10002\n3342\t10003\n3342\t10004\n3342\t10005\n3342\t10006\n3342\t10007\n3342\t10008\n3342\t10009\n3342\t10010\n3342\t10011\n3342\t10012\n3342\t10013\n3342\t10014\n3342\t10015\n3342\t90001\n3342\t90002\n3342\t90003\n3342\t90004\n3342\t90005\n3342\t90006\n3342\t90007\n3342\t90008\n3342\t90009\n3342\t90010\n3342\t90011\n3342\t90012\n3342\t90013\n3342\t90014\n3342\t90015\n21619\t10001\n21619\t10002\n21619\t10003\n21619\t10004\n21619\t10005\n21619\t10006\n21619\t10007\n21619\t10008\n21619\t10009\n21619\t10010\n21619\t10011\n21619\t10012\n21619\t10013\n21619\t10014\n21619\t10015\n21619\t90001\n21619\t90002\n21619\t90003\n21619\t90004\n21619\t90005\n21619\t90006\n21619\t90007\n21619\t90008\n21619\t90009\n21619\t90010\n21619\t90011\n21619\t90012\n21619\t90013\n21619\t90014\n21619\t90015\n27981\t10001\n27981\t10002\n27981\t10003\n27981\t10004\n27981\t10005\n27981\t10006\n27981\t10007\n27981\t10008\n27981\t10009\n27981\t10010\n27981\t10011\n27981\t10012\n27981\t10013\n27981\t10014\n27981\t10015\n27981\t90001\n27981\t90002\n27981\t90003\n27981\t90004\n27981\t90005\n27981\t90006\n27981\t90007\n27981\t90008\n27981\t90009\n27981\t90010\n27981\t90011\n27981\t90012\n27981\t90013\n27981\t90014\n27981\t90015\n47154\t10001\n47154\t10002\n47154\t10003\n47154\t10004\n47154\t10005\n47154\t10006\n47154\t10007\n47154\t10008\n47154\t10009\n47154\t10010\n47154\t10011\n47154\t10012\n47154\t10013\n47154\t10014\n47154\t10015\n47154\t90001\n47154\t90002\n47154\t90003\n47154\t90004\n47154\t90005\n47154\t90006\n47154\t90007\n47154\t90008\n47154\t90009\n47154\t90010\n47154\t90011\n47154\t90012\n47154\t90013\n47154\t90014\n47154\t90015\n"
      },
      "dateCreated": "Apr 19, 2016 9:11:44 PM",
      "dateStarted": "Jun 11, 2016 5:41:14 AM",
      "dateFinished": "Jun 11, 2016 5:48:57 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Generate Recommendations for (user, Item) Pairs",
      "text": "val recommendationsDF \u003d model.transform(allUserItemPairsDF)\n  .as(\"recommendations\")\n  .cache()\n//  .except(itemRatingsDF.select($\"userId\", $\"itemId\"))\n\n//  .cache()\n\nz.show(recommendationsDF.sort($\"userId\", $\"itemId\"))",
      "dateUpdated": "Jun 11, 2016 5:40:56 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464991903856_-1906023745",
      "id": "20160603-221143_1134516290",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\titemId\tprediction\n308\t10001\t0.993484\n308\t10002\t0.993484\n308\t10003\t0.993484\n308\t10004\t0.9998737\n308\t10005\t1.0024085\n308\t10006\t0.9971513\n308\t10007\t0.98850644\n308\t10008\t0.98850644\n308\t10009\t0.993484\n308\t10010\t0.993484\n308\t10011\t0.9939475\n308\t10012\t1.0036116\n308\t10013\t1.0036116\n308\t10014\t1.0036116\n308\t10015\t0.993484\n308\t90001\t1.000911\n308\t90002\t0.9939475\n308\t90003\t0.9939475\n308\t90004\t0.9939475\n308\t90005\t0.9939475\n308\t90006\t0.993484\n308\t90007\t0.993484\n308\t90008\t0.9939475\n308\t90009\t0.9971514\n308\t90010\t0.98850656\n308\t90011\t0.9971513\n308\t90012\t0.9998737\n308\t90013\t1.000911\n308\t90014\t0.993484\n308\t90015\t1.000911\n3342\t10001\t0.0023637265\n3342\t10002\t0.0023636818\n3342\t10003\t0.0023637265\n3342\t10004\t0.9988806\n3342\t10005\t0.99453354\n3342\t10006\t0.9911436\n3342\t10007\t0.008788705\n3342\t10008\t0.008788705\n3342\t10009\t0.0023637265\n3342\t10010\t0.0023636818\n3342\t10011\t0.0032196715\n3342\t10012\t0.0011260211\n3342\t10013\t0.001126036\n3342\t10014\t0.001126036\n3342\t10015\t0.0023637265\n3342\t90001\t-0.001371175\n3342\t90002\t0.0032196715\n3342\t90003\t0.0032196566\n3342\t90004\t0.0032196566\n3342\t90005\t0.0032196566\n3342\t90006\t0.0023637265\n3342\t90007\t0.0023636818\n3342\t90008\t0.0032196566\n3342\t90009\t0.9911436\n3342\t90010\t0.008788705\n3342\t90011\t0.9911437\n3342\t90012\t0.99888057\n3342\t90013\t-0.001371175\n3342\t90014\t0.0023637265\n3342\t90015\t-0.001371175\n21619\t10001\t0.0032548904\n21619\t10002\t0.0032548532\n21619\t10003\t0.0032548904\n21619\t10004\t-2.2113323E-5\n21619\t10005\t0.0027650595\n21619\t10006\t-0.0011456758\n21619\t10007\t0.0015104264\n21619\t10008\t0.0015104264\n21619\t10009\t0.0032548904\n21619\t10010\t0.0032548532\n21619\t10011\t0.0056450963\n21619\t10012\t0.9938967\n21619\t10013\t0.9938967\n21619\t10014\t0.9938967\n21619\t10015\t0.0032548904\n21619\t90001\t0.9959084\n21619\t90002\t0.0056450963\n21619\t90003\t0.0056450963\n21619\t90004\t0.0056450963\n21619\t90005\t0.0056450963\n21619\t90006\t0.0032548532\n21619\t90007\t0.0032548904\n21619\t90008\t0.0056450963\n21619\t90009\t-0.0011456758\n21619\t90010\t0.0015104264\n21619\t90011\t-0.0011456758\n21619\t90012\t-2.2113323E-5\n21619\t90013\t0.9959084\n21619\t90014\t0.0032548532\n21619\t90015\t0.9959084\n27981\t10001\t0.0012345389\n27981\t10002\t0.0012345314\n27981\t10003\t0.0012345389\n27981\t10004\t0.0032498091\n27981\t10005\t0.012595013\n27981\t10006\t0.99236155\n27981\t10007\t0.9957519\n27981\t10008\t0.9957519\n27981\t10009\t0.0012345389\n27981\t10010\t0.0012345314\n27981\t10011\t0.0037653595\n27981\t10012\t0.0030074865\n27981\t10013\t0.003007494\n27981\t10014\t0.003007494\n27981\t10015\t0.0012345389\n27981\t90001\t-0.0026526004\n27981\t90002\t0.0037653595\n27981\t90003\t0.0037653595\n27981\t90004\t0.0037653595\n27981\t90005\t0.0037653595\n27981\t90006\t0.0012345389\n27981\t90007\t0.0012345314\n27981\t90008\t0.0037653595\n27981\t90009\t0.99236155\n27981\t90010\t0.9957519\n27981\t90011\t0.99236155\n27981\t90012\t0.0032497793\n27981\t90013\t-0.0026526004\n27981\t90014\t0.0012345389\n27981\t90015\t-0.0026526004\n47154\t10001\t0.004666351\n47154\t10002\t0.0046663433\n47154\t10003\t0.004666351\n47154\t10004\t0.010432184\n47154\t10005\t0.99136114\n47154\t10006\t0.9928352\n47154\t10007\t0.99521875\n47154\t10008\t0.99521875\n47154\t10009\t0.004666351\n47154\t10010\t0.0046663433\n47154\t10011\t0.99604475\n47154\t10012\t0.9941386\n47154\t10013\t0.99413854\n47154\t10014\t0.99413854\n47154\t10015\t0.004666351\n47154\t90001\t0.012645721\n47154\t90002\t0.9960449\n47154\t90003\t0.99604475\n47154\t90004\t0.99604475\n47154\t90005\t0.99604475\n47154\t90006\t0.0046663433\n47154\t90007\t0.004666351\n47154\t90008\t0.99604475\n47154\t90009\t0.9928352\n47154\t90010\t0.9952187\n47154\t90011\t0.9928352\n47154\t90012\t0.010432184\n47154\t90013\t0.012645721\n47154\t90014\t0.0046663433\n47154\t90015\t0.012645721\n"
      },
      "dateCreated": "Jun 3, 2016 10:11:43 PM",
      "dateStarted": "Jun 11, 2016 5:41:19 AM",
      "dateFinished": "Jun 11, 2016 5:50:38 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Enrich the Recommendations",
      "text": "val enrichedRecommendationsDF \u003d \n   recommendationsDF.join(itemsDF, $\"items.itemId\" \u003d\u003d\u003d $\"recommendations.itemId\")\n   .select($\"userId\", $\"items.itemId\", $\"title\", $\"description\", $\"tags\", $\"img\", $\"prediction\")\n   .sort($\"userId\", $\"prediction\" desc, $\"items.itemId\")\n   \nz.show(enrichedRecommendationsDF.select($\"userId\", $\"itemId\", $\"title\", $\"prediction\"))",
      "dateUpdated": "Jun 11, 2016 5:40:56 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464987868025_89875713",
      "id": "20160603-210428_1545017316",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\titemId\ttitle\tprediction\n308\t10012\tJohnny Depp\t1.0036116\n308\t10013\tMark Wahlberg\t1.0036116\n308\t10014\tJames Franco\t1.0036116\n308\t10005\tJames Gandolfini\t1.0024085\n308\t90001\tLinda Blair\t1.000911\n308\t90013\tSofia Vergara\t1.000911\n308\t90015\tBarbara Niven\t1.000911\n308\t10004\tMorgan Freeman\t0.9998737\n308\t90012\tStacey Dash\t0.9998737\n308\t90009\tPam Grier\t0.9971514\n308\t10006\tTom Cruise\t0.9971513\n308\t90011\tAshley Judd\t0.9971513\n308\t10011\tJohn Travolta\t0.9939475\n308\t90002\tShannon Whirry\t0.9939475\n308\t90003\tRosalind Allen\t0.9939475\n308\t90004\tBobbie Phillips\t0.9939475\n308\t90005\tKeshia Knight Pulliam\t0.9939475\n308\t90008\tShannah Laumeister\t0.9939475\n308\t10001\tLeonardo DiCaprio\t0.993484\n308\t10002\tAnthony Hopkins\t0.993484\n308\t10003\tAl Pacino\t0.993484\n308\t10009\tChazz Palminteri\t0.993484\n308\t10010\tTom Hanks\t0.993484\n308\t10015\tClive Owen\t0.993484\n308\t90006\tTatyana Ali\t0.993484\n308\t90007\tAngell Conwell\t0.993484\n308\t90014\tGail O\u0027Grady\t0.993484\n308\t90010\tTiffani Thiessen\t0.98850656\n308\t10007\tDenzel Washington\t0.98850644\n308\t10008\tRobert De Niro\t0.98850644\n3342\t10004\tMorgan Freeman\t0.9988806\n3342\t90012\tStacey Dash\t0.99888057\n3342\t10005\tJames Gandolfini\t0.99453354\n3342\t90011\tAshley Judd\t0.9911437\n3342\t10006\tTom Cruise\t0.9911436\n3342\t90009\tPam Grier\t0.9911436\n3342\t10007\tDenzel Washington\t0.008788705\n3342\t10008\tRobert De Niro\t0.008788705\n3342\t90010\tTiffani Thiessen\t0.008788705\n3342\t10011\tJohn Travolta\t0.0032196715\n3342\t90002\tShannon Whirry\t0.0032196715\n3342\t90003\tRosalind Allen\t0.0032196566\n3342\t90004\tBobbie Phillips\t0.0032196566\n3342\t90005\tKeshia Knight Pulliam\t0.0032196566\n3342\t90008\tShannah Laumeister\t0.0032196566\n3342\t10001\tLeonardo DiCaprio\t0.0023637265\n3342\t10003\tAl Pacino\t0.0023637265\n3342\t10009\tChazz Palminteri\t0.0023637265\n3342\t10015\tClive Owen\t0.0023637265\n3342\t90006\tTatyana Ali\t0.0023637265\n3342\t90014\tGail O\u0027Grady\t0.0023637265\n3342\t10002\tAnthony Hopkins\t0.0023636818\n3342\t10010\tTom Hanks\t0.0023636818\n3342\t90007\tAngell Conwell\t0.0023636818\n3342\t10013\tMark Wahlberg\t0.001126036\n3342\t10014\tJames Franco\t0.001126036\n3342\t10012\tJohnny Depp\t0.0011260211\n3342\t90001\tLinda Blair\t-0.001371175\n3342\t90013\tSofia Vergara\t-0.001371175\n3342\t90015\tBarbara Niven\t-0.001371175\n21619\t90001\tLinda Blair\t0.9959084\n21619\t90013\tSofia Vergara\t0.9959084\n21619\t90015\tBarbara Niven\t0.9959084\n21619\t10012\tJohnny Depp\t0.9938967\n21619\t10013\tMark Wahlberg\t0.9938967\n21619\t10014\tJames Franco\t0.9938967\n21619\t10011\tJohn Travolta\t0.0056450963\n21619\t90002\tShannon Whirry\t0.0056450963\n21619\t90003\tRosalind Allen\t0.0056450963\n21619\t90004\tBobbie Phillips\t0.0056450963\n21619\t90005\tKeshia Knight Pulliam\t0.0056450963\n21619\t90008\tShannah Laumeister\t0.0056450963\n21619\t10001\tLeonardo DiCaprio\t0.0032548904\n21619\t10003\tAl Pacino\t0.0032548904\n21619\t10009\tChazz Palminteri\t0.0032548904\n21619\t10015\tClive Owen\t0.0032548904\n21619\t90007\tAngell Conwell\t0.0032548904\n21619\t10002\tAnthony Hopkins\t0.0032548532\n21619\t10010\tTom Hanks\t0.0032548532\n21619\t90006\tTatyana Ali\t0.0032548532\n21619\t90014\tGail O\u0027Grady\t0.0032548532\n21619\t10005\tJames Gandolfini\t0.0027650595\n21619\t10007\tDenzel Washington\t0.0015104264\n21619\t10008\tRobert De Niro\t0.0015104264\n21619\t90010\tTiffani Thiessen\t0.0015104264\n21619\t10004\tMorgan Freeman\t-2.2113323E-5\n21619\t90012\tStacey Dash\t-2.2113323E-5\n21619\t10006\tTom Cruise\t-0.0011456758\n21619\t90009\tPam Grier\t-0.0011456758\n21619\t90011\tAshley Judd\t-0.0011456758\n27981\t10007\tDenzel Washington\t0.9957519\n27981\t10008\tRobert De Niro\t0.9957519\n27981\t90010\tTiffani Thiessen\t0.9957519\n27981\t10006\tTom Cruise\t0.99236155\n27981\t90009\tPam Grier\t0.99236155\n27981\t90011\tAshley Judd\t0.99236155\n27981\t10005\tJames Gandolfini\t0.012595013\n27981\t10011\tJohn Travolta\t0.0037653595\n27981\t90002\tShannon Whirry\t0.0037653595\n27981\t90003\tRosalind Allen\t0.0037653595\n27981\t90004\tBobbie Phillips\t0.0037653595\n27981\t90005\tKeshia Knight Pulliam\t0.0037653595\n27981\t90008\tShannah Laumeister\t0.0037653595\n27981\t10004\tMorgan Freeman\t0.0032498091\n27981\t90012\tStacey Dash\t0.0032497793\n27981\t10013\tMark Wahlberg\t0.003007494\n27981\t10014\tJames Franco\t0.003007494\n27981\t10012\tJohnny Depp\t0.0030074865\n27981\t10001\tLeonardo DiCaprio\t0.0012345389\n27981\t10003\tAl Pacino\t0.0012345389\n27981\t10009\tChazz Palminteri\t0.0012345389\n27981\t10015\tClive Owen\t0.0012345389\n27981\t90006\tTatyana Ali\t0.0012345389\n27981\t90014\tGail O\u0027Grady\t0.0012345389\n27981\t10002\tAnthony Hopkins\t0.0012345314\n27981\t10010\tTom Hanks\t0.0012345314\n27981\t90007\tAngell Conwell\t0.0012345314\n27981\t90001\tLinda Blair\t-0.0026526004\n27981\t90013\tSofia Vergara\t-0.0026526004\n27981\t90015\tBarbara Niven\t-0.0026526004\n47154\t90002\tShannon Whirry\t0.9960449\n47154\t10011\tJohn Travolta\t0.99604475\n47154\t90003\tRosalind Allen\t0.99604475\n47154\t90004\tBobbie Phillips\t0.99604475\n47154\t90005\tKeshia Knight Pulliam\t0.99604475\n47154\t90008\tShannah Laumeister\t0.99604475\n47154\t10007\tDenzel Washington\t0.99521875\n47154\t10008\tRobert De Niro\t0.99521875\n47154\t90010\tTiffani Thiessen\t0.9952187\n47154\t10012\tJohnny Depp\t0.9941386\n47154\t10013\tMark Wahlberg\t0.99413854\n47154\t10014\tJames Franco\t0.99413854\n47154\t10006\tTom Cruise\t0.9928352\n47154\t90009\tPam Grier\t0.9928352\n47154\t90011\tAshley Judd\t0.9928352\n47154\t10005\tJames Gandolfini\t0.99136114\n47154\t90001\tLinda Blair\t0.012645721\n47154\t90013\tSofia Vergara\t0.012645721\n47154\t90015\tBarbara Niven\t0.012645721\n47154\t10004\tMorgan Freeman\t0.010432184\n47154\t90012\tStacey Dash\t0.010432184\n47154\t10001\tLeonardo DiCaprio\t0.004666351\n47154\t10003\tAl Pacino\t0.004666351\n47154\t10009\tChazz Palminteri\t0.004666351\n47154\t10015\tClive Owen\t0.004666351\n47154\t90007\tAngell Conwell\t0.004666351\n47154\t10002\tAnthony Hopkins\t0.0046663433\n47154\t10010\tTom Hanks\t0.0046663433\n47154\t90006\tTatyana Ali\t0.0046663433\n47154\t90014\tGail O\u0027Grady\t0.0046663433\n"
      },
      "dateCreated": "Jun 3, 2016 9:04:28 PM",
      "dateStarted": "Jun 11, 2016 5:48:57 AM",
      "dateFinished": "Jun 11, 2016 5:50:45 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Store Recommendations in ElasticSearch",
      "text": "import org.elasticsearch.spark.sql._\n\nval esConfig \u003d Map(\"pushdown\" -\u003e \"true\", \"es.nodes\" -\u003e \"127.0.0.1\", \"es.port\" -\u003e \"9200\")\n\nenrichedRecommendationsDF.write.format(\"org.elasticsearch.spark.sql\")\n  .mode(\"overwrite\")\n  .options(esConfig)\n  .save(\"advancedspark/personalized-als\")\n\nz.show(enrichedRecommendationsDF)",
      "dateUpdated": "Jun 11, 2016 5:40:56 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "editorHide": false,
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1460922825977_-689845777",
      "id": "20160417-195345_2022099383",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\titemId\ttitle\tdescription\ttags\timg\tprediction\n308\t10012\tJohnny Depp\tJohnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15...\tOwensboro, Kentucky, United States\timg/actors/10012.jpg\t1.0036116\n308\t10013\tMark Wahlberg\tAmerican actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to respected actor. A Best Supporting Actor Oscar nominee for The Departed who went on to receive positive critical reviews for his performance in The Fighter, Wahlberg also is a solid comedy actor, proven by his starring role in Ted...\tBoston, Massachusetts, United States\timg/actors/10013.jpg\t1.0036116\n308\t10014\tJames Franco\tKnown for his breakthrough starring role on Freaks and Geeks, James Franco was born in Palo Alto, California on April 19, 1978. His mother, Betsy Franco, is Jewish, and his father, Douglas Eugene \"Doug\" Franco, was of Portuguese and Swedish descent, and ran a Silicon Valley business. James\u0027s mother, a writer, has occasionally acted...\tPalo Alto, California, United States\timg/actors/10014.jpg\t1.0036116\n308\t10005\tJames Gandolfini\tJames Gandolfini was born in Westwood, New Jersey, to Santa (Penna), a high school lunchlady, and James Joseph Gandolfini, Sr., a bricklayer and head school janitor. His parents were both of Italian origin. Gandolfini began acting in the New York theater. His Broadway debut was in the 1992 revival of \"A Streetcar Named Desire\" with Jessica Lange and Alec Baldwin...\tWestwood, New Jersey, United States\timg/actors/10005.jpg\t1.0024085\n308\t90001\tLinda Blair\tFrom the age of five, Linda Blair had to get used to the spotlight, first as a child model and then as an actress, when out of 600 applicants she was picked for the role of Regan, the possessed child, in The Exorcist. Linda quickly rose to international fame, won the Golden Globe, and seemed to be set to take the Academy Award for that role...\tSt. Louis, Missouri, United States\timg/actors/90001.jpg\t1.000911\n308\t90013\tSofia Vergara\tSofia Margarita Vergara Vergara was born and raised in Barranquilla, Colombia. Her mother, Margarita Vergara Davila de Vergara, is a housewife. Her father, Julio Enrique Vergara Robayo, provides cattle to the meat industry. She has five siblings. She was educated at a private bilingual Spanish/English school...\tBarranquilla, Atlantico, Colombia\timg/actors/90013.jpg\t1.000911\n308\t90015\tBarbara Niven\tBarbara Niven was born on February 26, 1953 in Portland, Oregon, USA as Barbara Lee Bucholz. She is an actress and producer, known for A Perfect Ending (2012), Pensacola: Wings of Gold (1997) and The Rat Pack (1998).\tPortland, Oregon, United States\timg/actors/90015.jpg\t1.000911\n308\t10004\tMorgan Freeman\tWith an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born in June 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended...\tMemphis, Tennessee, United States\timg/actors/10004.jpg\t0.9998737\n308\t90012\tStacey Dash\tStacey Dash was born in the Bronx, New York. Stacy knew that she wanted to act, and from an early age began to act professionally. She made regular appearances on The Cosby Show, The Fresh Prince of Bel-Air, and also St. Elsewhere. At 21 she made her feature film debut in Enemy Territory, which was quickly followed by Moving...\tBronx, New York, United States\timg/actors/90012.jpg\t0.9998737\n308\t90009\tPam Grier\tPam Grier was born in Winston-Salem, NC, one of four children of Gwendolyn Sylvia (Samuels), a nurse, and Clarence Ransom Grier Jr., an Air Force mechanic. Pam has been a major African-American star from the early 1970s. Her career started in 1971, when Roger Corman of New World Pictures launched her with The Big Doll House...\tWinstom-Salem, North Carolina, United States\timg/actors/90009.jpg\t0.9971514\n308\t10006\tTom Cruise\tIf you had told fourteen-year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not-too-distant future he would be considered one of the top hundred movie stars of all time, he would have probably grinned and told you that his ambition was to become a priest. None the less, this sensitive, deeply religious youngster who...\tSyracuse, New York, United States\timg/actors/10006.jpg\t0.9971513\n308\t90011\tAshley Judd\tAshley Judd was born on April 19, 1968 in Granada Hills, California, USA as Ashley Tyler Ciminella. She is an actress and producer, known for Divergent (2014), Heat (1995) and Double Jeopardy (1999). She was previously married to Dario Franchitti.\tGranada Hills, California, United States\timg/actors/90011.jpg\t0.9971513\n308\t10011\tJohn Travolta\tJohn Travolta was born in Englewood, New Jersey, one of six children of Helen Travolta Helen Cecilia Burke) and Salvatore Travolta. His father was of Italian descent and his mother was of Irish ancestry. His father owned a tire repair shop called Travolta Tires in Hillsdale, NJ. Travolta appeared in a local production of \"Who\u0027ll Save the Plowboy?\"...\tEnglewood, New York, United States\timg/actors/10011.jpg\t0.9939475\n308\t90002\tShannon Whirry\tShannon Whirry is not just a talented actress with girl-next-door looks, she captured a generation of viewers\u0027 imaginations by wishing that she actually was the girl-next-door. Born in Green Lake County, Wisconsin, Whirry graduated from high school and packed her bags for New York. She trained at the...\tGreen Lake, Wisconsin, United States\timg/actors/90002.jpg\t0.9939475\n308\t90003\tRosalind Allen\tRosalind Allen (born Rosalind Ingledew) hails from New Zealand and studied acting there before coming to the United States. Her movie debut was in the film, Perfect, and she continues a long career in television \u0026 film. Famously remembered as the \"It girl\" in the Seinfeld episode, The Marine Biologist...\tWellington, New Zealand, New Zealand\timg/actors/90003.jpg\t0.9939475\n308\t90004\tBobbie Phillips\tBrains and beauty are two words that have been repeatedly used to describe Bobbie Phillips throughout her career. Graduating high school at 16 years old, Bobbie tried several different career paths. After taking college classes to become a litigation attorney, it was suggested she also take drama classes...\tSalisbury, North Carolina, United States\timg/actors/90004.jpg\t0.9939475\n308\t90005\tKeshia Knight Pulliam\tKeshia Knight Pulliam was born on April 9, 1979 in Newark, New Jersey, USA. She is an actress, known for The Cosby Show (1984), Madea Goes to Jail (2009) and Beauty Shop (2005).\tNewark, New Jersey, United States\timg/actors/90005.jpg\t0.9939475\n308\t90008\tShannah Laumeister\tShannah Laumeister was born on July 23, 1969 in San Francisco, California, USA. She is an actress and director, known for Bullets Over Broadway (1994), Nobody\u0027s Fool (1994) and 61* (2001). She was previously married to Bert Stern.\tSan Francisco, California, United States\timg/actors/90008.jpg\t0.9939475\n308\t10001\tLeonardo DiCaprio\tFew actors in the world have had a career quite as diverse as Leonardo DiCaprio\u0027s. DiCaprio has gone from relatively humble beginnings, as a supporting cast member of the sitcom Growing Pains and low budget horror movies, such as Critters 3, to a major teenage heartthrob in the 1990s, as the hunky lead actor in movies such as Romeo + Juliet and Titanic...\tHollywood, California, United States\timg/actors/10001.jpg\t0.993484\n308\t10002\tAnthony Hopkins\tAnthony Hopkins was born on December 31, 1937, in Margam, Wales, to Muriel Anne (Yeats) and Richard Arthur Hopkins, a baker. His parents were both of half Welsh and half English descent. Influenced by Richard Burton, he decided to study at College of Music and Drama and graduated in 1957. In 1965, he moved to London and joined the National Theatre...\tPort Talbot, Glamorgan, Wales\timg/actors/10002.jpg\t0.993484\n308\t10003\tAl Pacino\tOne of the greatest actors in all of film history, Al Pacino established himself during one of film\u0027s greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents...\tManhattan, New York, United States\timg/actors/10003.jpg\t0.993484\n308\t10009\tChazz Palminteri\tBronx-born and raised Chazz Palminteri was a natural choice to continue the Italianate torch in film. In the tradition set forth in the 1970s by such icons as director Martin Scorsese and actors Robert De Niro, Al Pacino, John Cazale and Joe Pesci, Palminteri has brought grit, muscle and an evocative realism to the sidewalks of his New York neighborhood...\tBronx, New York, United States\timg/actors/10009.jpg\t0.993484\n308\t10010\tTom Hanks\tThomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an itinerant cook. His father had English, and some German, ancestry, while his mother\u0027s family, originally surnamed \"Fraga\", was entirely Portuguese. Tom grew up in what he has called a \"fractured\" family...\tConcord, California, United States\timg/actors/10010.jpg\t0.993484\n308\t10015\tClive Owen\tDarkly handsome British actor Clive Owen is one of a handful of stars best known for his art house films but how has handle more mainstream action films lately with equal measures of grace and skill. Owen typically is cast as characters whose primary traits are a balance of physical strength, intellect...\tCoventry, Warwickshire, England\timg/actors/10015.jpg\t0.993484\n308\t90006\tTatyana Ali\tOn January 24, 1979, Tatyana Marisol Ali was born to Sonia, who was a nurse from Panama, and Sheriff Ali, a retired police officer from Trinidad. At the age of four she started singing and got a taste of fame when she begged her mother to take her to an audition for Sesame Street. She went on to perform in many productions in her native city...\tBrooklyn, New York, United States\timg/actors/90006.jpg\t0.993484\n308\t90007\tAngell Conwell\tBorn in the tiny town of Orangeburg, South Carolina, Angell Conwell began her journey at a very young age. After winning countless pageants locally, she signed with Wilhelmina\u0027s Kids Division in New York at the age of 10. Angell enjoyed modeling but yearned for more of a challenge. She begged for her parents permission to audition for a role in August Wilson\u0027s highly acclaimed...\tOrangeburg, South Carolina, United States\timg/actors/90007.jpg\t0.993484\n308\t90014\tGail O\u0027Grady\tGail O\u0027Grady was born on January 23, 1963 in Detroit, Michigan, USA as Gail Ann O\u0027Grady. She is an actress and producer, known for American Dreams (2002), Deuce Bigalow: Male Gigolo (1999) and NYPD Blue (1993). She was previously married to John Stamatakis, Anthony J Pellegrino, Steve Fenton, Severin Wunderman, Jeffrey Byron and Richard Dasko.\tDetroit, Michigan, United States\timg/actors/90014.jpg\t0.993484\n308\t90010\tTiffani Thiessen\tTiffani-Amber Thiessen was born on January 23, 1974, in Long Beach, California, USA, to Frank Thiessen, a park designer, and Robyn Ernest, a homemaker. She grew up in Long Beach with her parents and her brothers, professional cyclist Todd (b. 1968) and Schuyler (b. 1977). When Tiffani was 8, her uncle...\tLong Beach, California, United States\timg/actors/90010.jpg\t0.98850656\n308\t10007\tDenzel Washington\tDenzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis (Lowe), from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University...\tMount Vernon, New York, United States\timg/actors/10007.jpg\t0.98850644\n308\t10008\tRobert De Niro\tRobert De Niro, thought of as one of the greatest American actors of all time, was born in New York City, to artists Virginia (Admiral) and Robert De Niro Sr. His paternal grandfather was of Italian descent, and his other ancestry is Irish, Dutch, English, French, and German. He was trained at the Stella Adler Conservatory and the American Workshop...\tManhattan, New York, United States\timg/actors/10008.jpg\t0.98850644\n3342\t10004\tMorgan Freeman\tWith an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born in June 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended...\tMemphis, Tennessee, United States\timg/actors/10004.jpg\t0.9988806\n3342\t90012\tStacey Dash\tStacey Dash was born in the Bronx, New York. Stacy knew that she wanted to act, and from an early age began to act professionally. She made regular appearances on The Cosby Show, The Fresh Prince of Bel-Air, and also St. Elsewhere. At 21 she made her feature film debut in Enemy Territory, which was quickly followed by Moving...\tBronx, New York, United States\timg/actors/90012.jpg\t0.99888057\n3342\t10005\tJames Gandolfini\tJames Gandolfini was born in Westwood, New Jersey, to Santa (Penna), a high school lunchlady, and James Joseph Gandolfini, Sr., a bricklayer and head school janitor. His parents were both of Italian origin. Gandolfini began acting in the New York theater. His Broadway debut was in the 1992 revival of \"A Streetcar Named Desire\" with Jessica Lange and Alec Baldwin...\tWestwood, New Jersey, United States\timg/actors/10005.jpg\t0.99453354\n3342\t90011\tAshley Judd\tAshley Judd was born on April 19, 1968 in Granada Hills, California, USA as Ashley Tyler Ciminella. She is an actress and producer, known for Divergent (2014), Heat (1995) and Double Jeopardy (1999). She was previously married to Dario Franchitti.\tGranada Hills, California, United States\timg/actors/90011.jpg\t0.9911437\n3342\t10006\tTom Cruise\tIf you had told fourteen-year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not-too-distant future he would be considered one of the top hundred movie stars of all time, he would have probably grinned and told you that his ambition was to become a priest. None the less, this sensitive, deeply religious youngster who...\tSyracuse, New York, United States\timg/actors/10006.jpg\t0.9911436\n3342\t90009\tPam Grier\tPam Grier was born in Winston-Salem, NC, one of four children of Gwendolyn Sylvia (Samuels), a nurse, and Clarence Ransom Grier Jr., an Air Force mechanic. Pam has been a major African-American star from the early 1970s. Her career started in 1971, when Roger Corman of New World Pictures launched her with The Big Doll House...\tWinstom-Salem, North Carolina, United States\timg/actors/90009.jpg\t0.9911436\n3342\t10007\tDenzel Washington\tDenzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis (Lowe), from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University...\tMount Vernon, New York, United States\timg/actors/10007.jpg\t0.008788705\n3342\t10008\tRobert De Niro\tRobert De Niro, thought of as one of the greatest American actors of all time, was born in New York City, to artists Virginia (Admiral) and Robert De Niro Sr. His paternal grandfather was of Italian descent, and his other ancestry is Irish, Dutch, English, French, and German. He was trained at the Stella Adler Conservatory and the American Workshop...\tManhattan, New York, United States\timg/actors/10008.jpg\t0.008788705\n3342\t90010\tTiffani Thiessen\tTiffani-Amber Thiessen was born on January 23, 1974, in Long Beach, California, USA, to Frank Thiessen, a park designer, and Robyn Ernest, a homemaker. She grew up in Long Beach with her parents and her brothers, professional cyclist Todd (b. 1968) and Schuyler (b. 1977). When Tiffani was 8, her uncle...\tLong Beach, California, United States\timg/actors/90010.jpg\t0.008788705\n3342\t10011\tJohn Travolta\tJohn Travolta was born in Englewood, New Jersey, one of six children of Helen Travolta Helen Cecilia Burke) and Salvatore Travolta. His father was of Italian descent and his mother was of Irish ancestry. His father owned a tire repair shop called Travolta Tires in Hillsdale, NJ. Travolta appeared in a local production of \"Who\u0027ll Save the Plowboy?\"...\tEnglewood, New York, United States\timg/actors/10011.jpg\t0.0032196715\n3342\t90002\tShannon Whirry\tShannon Whirry is not just a talented actress with girl-next-door looks, she captured a generation of viewers\u0027 imaginations by wishing that she actually was the girl-next-door. Born in Green Lake County, Wisconsin, Whirry graduated from high school and packed her bags for New York. She trained at the...\tGreen Lake, Wisconsin, United States\timg/actors/90002.jpg\t0.0032196715\n3342\t90003\tRosalind Allen\tRosalind Allen (born Rosalind Ingledew) hails from New Zealand and studied acting there before coming to the United States. Her movie debut was in the film, Perfect, and she continues a long career in television \u0026 film. Famously remembered as the \"It girl\" in the Seinfeld episode, The Marine Biologist...\tWellington, New Zealand, New Zealand\timg/actors/90003.jpg\t0.0032196566\n3342\t90004\tBobbie Phillips\tBrains and beauty are two words that have been repeatedly used to describe Bobbie Phillips throughout her career. Graduating high school at 16 years old, Bobbie tried several different career paths. After taking college classes to become a litigation attorney, it was suggested she also take drama classes...\tSalisbury, North Carolina, United States\timg/actors/90004.jpg\t0.0032196566\n3342\t90005\tKeshia Knight Pulliam\tKeshia Knight Pulliam was born on April 9, 1979 in Newark, New Jersey, USA. She is an actress, known for The Cosby Show (1984), Madea Goes to Jail (2009) and Beauty Shop (2005).\tNewark, New Jersey, United States\timg/actors/90005.jpg\t0.0032196566\n3342\t90008\tShannah Laumeister\tShannah Laumeister was born on July 23, 1969 in San Francisco, California, USA. She is an actress and director, known for Bullets Over Broadway (1994), Nobody\u0027s Fool (1994) and 61* (2001). She was previously married to Bert Stern.\tSan Francisco, California, United States\timg/actors/90008.jpg\t0.0032196566\n3342\t10001\tLeonardo DiCaprio\tFew actors in the world have had a career quite as diverse as Leonardo DiCaprio\u0027s. DiCaprio has gone from relatively humble beginnings, as a supporting cast member of the sitcom Growing Pains and low budget horror movies, such as Critters 3, to a major teenage heartthrob in the 1990s, as the hunky lead actor in movies such as Romeo + Juliet and Titanic...\tHollywood, California, United States\timg/actors/10001.jpg\t0.0023637265\n3342\t10003\tAl Pacino\tOne of the greatest actors in all of film history, Al Pacino established himself during one of film\u0027s greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents...\tManhattan, New York, United States\timg/actors/10003.jpg\t0.0023637265\n3342\t10009\tChazz Palminteri\tBronx-born and raised Chazz Palminteri was a natural choice to continue the Italianate torch in film. In the tradition set forth in the 1970s by such icons as director Martin Scorsese and actors Robert De Niro, Al Pacino, John Cazale and Joe Pesci, Palminteri has brought grit, muscle and an evocative realism to the sidewalks of his New York neighborhood...\tBronx, New York, United States\timg/actors/10009.jpg\t0.0023637265\n3342\t10015\tClive Owen\tDarkly handsome British actor Clive Owen is one of a handful of stars best known for his art house films but how has handle more mainstream action films lately with equal measures of grace and skill. Owen typically is cast as characters whose primary traits are a balance of physical strength, intellect...\tCoventry, Warwickshire, England\timg/actors/10015.jpg\t0.0023637265\n3342\t90006\tTatyana Ali\tOn January 24, 1979, Tatyana Marisol Ali was born to Sonia, who was a nurse from Panama, and Sheriff Ali, a retired police officer from Trinidad. At the age of four she started singing and got a taste of fame when she begged her mother to take her to an audition for Sesame Street. She went on to perform in many productions in her native city...\tBrooklyn, New York, United States\timg/actors/90006.jpg\t0.0023637265\n3342\t90014\tGail O\u0027Grady\tGail O\u0027Grady was born on January 23, 1963 in Detroit, Michigan, USA as Gail Ann O\u0027Grady. She is an actress and producer, known for American Dreams (2002), Deuce Bigalow: Male Gigolo (1999) and NYPD Blue (1993). She was previously married to John Stamatakis, Anthony J Pellegrino, Steve Fenton, Severin Wunderman, Jeffrey Byron and Richard Dasko.\tDetroit, Michigan, United States\timg/actors/90014.jpg\t0.0023637265\n3342\t10002\tAnthony Hopkins\tAnthony Hopkins was born on December 31, 1937, in Margam, Wales, to Muriel Anne (Yeats) and Richard Arthur Hopkins, a baker. His parents were both of half Welsh and half English descent. Influenced by Richard Burton, he decided to study at College of Music and Drama and graduated in 1957. In 1965, he moved to London and joined the National Theatre...\tPort Talbot, Glamorgan, Wales\timg/actors/10002.jpg\t0.0023636818\n3342\t10010\tTom Hanks\tThomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an itinerant cook. His father had English, and some German, ancestry, while his mother\u0027s family, originally surnamed \"Fraga\", was entirely Portuguese. Tom grew up in what he has called a \"fractured\" family...\tConcord, California, United States\timg/actors/10010.jpg\t0.0023636818\n3342\t90007\tAngell Conwell\tBorn in the tiny town of Orangeburg, South Carolina, Angell Conwell began her journey at a very young age. After winning countless pageants locally, she signed with Wilhelmina\u0027s Kids Division in New York at the age of 10. Angell enjoyed modeling but yearned for more of a challenge. She begged for her parents permission to audition for a role in August Wilson\u0027s highly acclaimed...\tOrangeburg, South Carolina, United States\timg/actors/90007.jpg\t0.0023636818\n3342\t10013\tMark Wahlberg\tAmerican actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to respected actor. A Best Supporting Actor Oscar nominee for The Departed who went on to receive positive critical reviews for his performance in The Fighter, Wahlberg also is a solid comedy actor, proven by his starring role in Ted...\tBoston, Massachusetts, United States\timg/actors/10013.jpg\t0.001126036\n3342\t10014\tJames Franco\tKnown for his breakthrough starring role on Freaks and Geeks, James Franco was born in Palo Alto, California on April 19, 1978. His mother, Betsy Franco, is Jewish, and his father, Douglas Eugene \"Doug\" Franco, was of Portuguese and Swedish descent, and ran a Silicon Valley business. James\u0027s mother, a writer, has occasionally acted...\tPalo Alto, California, United States\timg/actors/10014.jpg\t0.001126036\n3342\t10012\tJohnny Depp\tJohnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15...\tOwensboro, Kentucky, United States\timg/actors/10012.jpg\t0.0011260211\n3342\t90001\tLinda Blair\tFrom the age of five, Linda Blair had to get used to the spotlight, first as a child model and then as an actress, when out of 600 applicants she was picked for the role of Regan, the possessed child, in The Exorcist. Linda quickly rose to international fame, won the Golden Globe, and seemed to be set to take the Academy Award for that role...\tSt. Louis, Missouri, United States\timg/actors/90001.jpg\t-0.001371175\n3342\t90013\tSofia Vergara\tSofia Margarita Vergara Vergara was born and raised in Barranquilla, Colombia. Her mother, Margarita Vergara Davila de Vergara, is a housewife. Her father, Julio Enrique Vergara Robayo, provides cattle to the meat industry. She has five siblings. She was educated at a private bilingual Spanish/English school...\tBarranquilla, Atlantico, Colombia\timg/actors/90013.jpg\t-0.001371175\n3342\t90015\tBarbara Niven\tBarbara Niven was born on February 26, 1953 in Portland, Oregon, USA as Barbara Lee Bucholz. She is an actress and producer, known for A Perfect Ending (2012), Pensacola: Wings of Gold (1997) and The Rat Pack (1998).\tPortland, Oregon, United States\timg/actors/90015.jpg\t-0.001371175\n21619\t90001\tLinda Blair\tFrom the age of five, Linda Blair had to get used to the spotlight, first as a child model and then as an actress, when out of 600 applicants she was picked for the role of Regan, the possessed child, in The Exorcist. Linda quickly rose to international fame, won the Golden Globe, and seemed to be set to take the Academy Award for that role...\tSt. Louis, Missouri, United States\timg/actors/90001.jpg\t0.9959084\n21619\t90013\tSofia Vergara\tSofia Margarita Vergara Vergara was born and raised in Barranquilla, Colombia. Her mother, Margarita Vergara Davila de Vergara, is a housewife. Her father, Julio Enrique Vergara Robayo, provides cattle to the meat industry. She has five siblings. She was educated at a private bilingual Spanish/English school...\tBarranquilla, Atlantico, Colombia\timg/actors/90013.jpg\t0.9959084\n21619\t90015\tBarbara Niven\tBarbara Niven was born on February 26, 1953 in Portland, Oregon, USA as Barbara Lee Bucholz. She is an actress and producer, known for A Perfect Ending (2012), Pensacola: Wings of Gold (1997) and The Rat Pack (1998).\tPortland, Oregon, United States\timg/actors/90015.jpg\t0.9959084\n21619\t10012\tJohnny Depp\tJohnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15...\tOwensboro, Kentucky, United States\timg/actors/10012.jpg\t0.9938967\n21619\t10013\tMark Wahlberg\tAmerican actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to respected actor. A Best Supporting Actor Oscar nominee for The Departed who went on to receive positive critical reviews for his performance in The Fighter, Wahlberg also is a solid comedy actor, proven by his starring role in Ted...\tBoston, Massachusetts, United States\timg/actors/10013.jpg\t0.9938967\n21619\t10014\tJames Franco\tKnown for his breakthrough starring role on Freaks and Geeks, James Franco was born in Palo Alto, California on April 19, 1978. His mother, Betsy Franco, is Jewish, and his father, Douglas Eugene \"Doug\" Franco, was of Portuguese and Swedish descent, and ran a Silicon Valley business. James\u0027s mother, a writer, has occasionally acted...\tPalo Alto, California, United States\timg/actors/10014.jpg\t0.9938967\n21619\t10011\tJohn Travolta\tJohn Travolta was born in Englewood, New Jersey, one of six children of Helen Travolta Helen Cecilia Burke) and Salvatore Travolta. His father was of Italian descent and his mother was of Irish ancestry. His father owned a tire repair shop called Travolta Tires in Hillsdale, NJ. Travolta appeared in a local production of \"Who\u0027ll Save the Plowboy?\"...\tEnglewood, New York, United States\timg/actors/10011.jpg\t0.0056450963\n21619\t90002\tShannon Whirry\tShannon Whirry is not just a talented actress with girl-next-door looks, she captured a generation of viewers\u0027 imaginations by wishing that she actually was the girl-next-door. Born in Green Lake County, Wisconsin, Whirry graduated from high school and packed her bags for New York. She trained at the...\tGreen Lake, Wisconsin, United States\timg/actors/90002.jpg\t0.0056450963\n21619\t90003\tRosalind Allen\tRosalind Allen (born Rosalind Ingledew) hails from New Zealand and studied acting there before coming to the United States. Her movie debut was in the film, Perfect, and she continues a long career in television \u0026 film. Famously remembered as the \"It girl\" in the Seinfeld episode, The Marine Biologist...\tWellington, New Zealand, New Zealand\timg/actors/90003.jpg\t0.0056450963\n21619\t90004\tBobbie Phillips\tBrains and beauty are two words that have been repeatedly used to describe Bobbie Phillips throughout her career. Graduating high school at 16 years old, Bobbie tried several different career paths. After taking college classes to become a litigation attorney, it was suggested she also take drama classes...\tSalisbury, North Carolina, United States\timg/actors/90004.jpg\t0.0056450963\n21619\t90005\tKeshia Knight Pulliam\tKeshia Knight Pulliam was born on April 9, 1979 in Newark, New Jersey, USA. She is an actress, known for The Cosby Show (1984), Madea Goes to Jail (2009) and Beauty Shop (2005).\tNewark, New Jersey, United States\timg/actors/90005.jpg\t0.0056450963\n21619\t90008\tShannah Laumeister\tShannah Laumeister was born on July 23, 1969 in San Francisco, California, USA. She is an actress and director, known for Bullets Over Broadway (1994), Nobody\u0027s Fool (1994) and 61* (2001). She was previously married to Bert Stern.\tSan Francisco, California, United States\timg/actors/90008.jpg\t0.0056450963\n21619\t10001\tLeonardo DiCaprio\tFew actors in the world have had a career quite as diverse as Leonardo DiCaprio\u0027s. DiCaprio has gone from relatively humble beginnings, as a supporting cast member of the sitcom Growing Pains and low budget horror movies, such as Critters 3, to a major teenage heartthrob in the 1990s, as the hunky lead actor in movies such as Romeo + Juliet and Titanic...\tHollywood, California, United States\timg/actors/10001.jpg\t0.0032548904\n21619\t10003\tAl Pacino\tOne of the greatest actors in all of film history, Al Pacino established himself during one of film\u0027s greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents...\tManhattan, New York, United States\timg/actors/10003.jpg\t0.0032548904\n21619\t10009\tChazz Palminteri\tBronx-born and raised Chazz Palminteri was a natural choice to continue the Italianate torch in film. In the tradition set forth in the 1970s by such icons as director Martin Scorsese and actors Robert De Niro, Al Pacino, John Cazale and Joe Pesci, Palminteri has brought grit, muscle and an evocative realism to the sidewalks of his New York neighborhood...\tBronx, New York, United States\timg/actors/10009.jpg\t0.0032548904\n21619\t10015\tClive Owen\tDarkly handsome British actor Clive Owen is one of a handful of stars best known for his art house films but how has handle more mainstream action films lately with equal measures of grace and skill. Owen typically is cast as characters whose primary traits are a balance of physical strength, intellect...\tCoventry, Warwickshire, England\timg/actors/10015.jpg\t0.0032548904\n21619\t90007\tAngell Conwell\tBorn in the tiny town of Orangeburg, South Carolina, Angell Conwell began her journey at a very young age. After winning countless pageants locally, she signed with Wilhelmina\u0027s Kids Division in New York at the age of 10. Angell enjoyed modeling but yearned for more of a challenge. She begged for her parents permission to audition for a role in August Wilson\u0027s highly acclaimed...\tOrangeburg, South Carolina, United States\timg/actors/90007.jpg\t0.0032548904\n21619\t10002\tAnthony Hopkins\tAnthony Hopkins was born on December 31, 1937, in Margam, Wales, to Muriel Anne (Yeats) and Richard Arthur Hopkins, a baker. His parents were both of half Welsh and half English descent. Influenced by Richard Burton, he decided to study at College of Music and Drama and graduated in 1957. In 1965, he moved to London and joined the National Theatre...\tPort Talbot, Glamorgan, Wales\timg/actors/10002.jpg\t0.0032548532\n21619\t10010\tTom Hanks\tThomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an itinerant cook. His father had English, and some German, ancestry, while his mother\u0027s family, originally surnamed \"Fraga\", was entirely Portuguese. Tom grew up in what he has called a \"fractured\" family...\tConcord, California, United States\timg/actors/10010.jpg\t0.0032548532\n21619\t90006\tTatyana Ali\tOn January 24, 1979, Tatyana Marisol Ali was born to Sonia, who was a nurse from Panama, and Sheriff Ali, a retired police officer from Trinidad. At the age of four she started singing and got a taste of fame when she begged her mother to take her to an audition for Sesame Street. She went on to perform in many productions in her native city...\tBrooklyn, New York, United States\timg/actors/90006.jpg\t0.0032548532\n21619\t90014\tGail O\u0027Grady\tGail O\u0027Grady was born on January 23, 1963 in Detroit, Michigan, USA as Gail Ann O\u0027Grady. She is an actress and producer, known for American Dreams (2002), Deuce Bigalow: Male Gigolo (1999) and NYPD Blue (1993). She was previously married to John Stamatakis, Anthony J Pellegrino, Steve Fenton, Severin Wunderman, Jeffrey Byron and Richard Dasko.\tDetroit, Michigan, United States\timg/actors/90014.jpg\t0.0032548532\n21619\t10005\tJames Gandolfini\tJames Gandolfini was born in Westwood, New Jersey, to Santa (Penna), a high school lunchlady, and James Joseph Gandolfini, Sr., a bricklayer and head school janitor. His parents were both of Italian origin. Gandolfini began acting in the New York theater. His Broadway debut was in the 1992 revival of \"A Streetcar Named Desire\" with Jessica Lange and Alec Baldwin...\tWestwood, New Jersey, United States\timg/actors/10005.jpg\t0.0027650595\n21619\t10007\tDenzel Washington\tDenzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis (Lowe), from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University...\tMount Vernon, New York, United States\timg/actors/10007.jpg\t0.0015104264\n21619\t10008\tRobert De Niro\tRobert De Niro, thought of as one of the greatest American actors of all time, was born in New York City, to artists Virginia (Admiral) and Robert De Niro Sr. His paternal grandfather was of Italian descent, and his other ancestry is Irish, Dutch, English, French, and German. He was trained at the Stella Adler Conservatory and the American Workshop...\tManhattan, New York, United States\timg/actors/10008.jpg\t0.0015104264\n21619\t90010\tTiffani Thiessen\tTiffani-Amber Thiessen was born on January 23, 1974, in Long Beach, California, USA, to Frank Thiessen, a park designer, and Robyn Ernest, a homemaker. She grew up in Long Beach with her parents and her brothers, professional cyclist Todd (b. 1968) and Schuyler (b. 1977). When Tiffani was 8, her uncle...\tLong Beach, California, United States\timg/actors/90010.jpg\t0.0015104264\n21619\t10004\tMorgan Freeman\tWith an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born in June 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended...\tMemphis, Tennessee, United States\timg/actors/10004.jpg\t-2.2113323E-5\n21619\t90012\tStacey Dash\tStacey Dash was born in the Bronx, New York. Stacy knew that she wanted to act, and from an early age began to act professionally. She made regular appearances on The Cosby Show, The Fresh Prince of Bel-Air, and also St. Elsewhere. At 21 she made her feature film debut in Enemy Territory, which was quickly followed by Moving...\tBronx, New York, United States\timg/actors/90012.jpg\t-2.2113323E-5\n21619\t10006\tTom Cruise\tIf you had told fourteen-year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not-too-distant future he would be considered one of the top hundred movie stars of all time, he would have probably grinned and told you that his ambition was to become a priest. None the less, this sensitive, deeply religious youngster who...\tSyracuse, New York, United States\timg/actors/10006.jpg\t-0.0011456758\n21619\t90009\tPam Grier\tPam Grier was born in Winston-Salem, NC, one of four children of Gwendolyn Sylvia (Samuels), a nurse, and Clarence Ransom Grier Jr., an Air Force mechanic. Pam has been a major African-American star from the early 1970s. Her career started in 1971, when Roger Corman of New World Pictures launched her with The Big Doll House...\tWinstom-Salem, North Carolina, United States\timg/actors/90009.jpg\t-0.0011456758\n21619\t90011\tAshley Judd\tAshley Judd was born on April 19, 1968 in Granada Hills, California, USA as Ashley Tyler Ciminella. She is an actress and producer, known for Divergent (2014), Heat (1995) and Double Jeopardy (1999). She was previously married to Dario Franchitti.\tGranada Hills, California, United States\timg/actors/90011.jpg\t-0.0011456758\n27981\t10007\tDenzel Washington\tDenzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis (Lowe), from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University...\tMount Vernon, New York, United States\timg/actors/10007.jpg\t0.9957519\n27981\t10008\tRobert De Niro\tRobert De Niro, thought of as one of the greatest American actors of all time, was born in New York City, to artists Virginia (Admiral) and Robert De Niro Sr. His paternal grandfather was of Italian descent, and his other ancestry is Irish, Dutch, English, French, and German. He was trained at the Stella Adler Conservatory and the American Workshop...\tManhattan, New York, United States\timg/actors/10008.jpg\t0.9957519\n27981\t90010\tTiffani Thiessen\tTiffani-Amber Thiessen was born on January 23, 1974, in Long Beach, California, USA, to Frank Thiessen, a park designer, and Robyn Ernest, a homemaker. She grew up in Long Beach with her parents and her brothers, professional cyclist Todd (b. 1968) and Schuyler (b. 1977). When Tiffani was 8, her uncle...\tLong Beach, California, United States\timg/actors/90010.jpg\t0.9957519\n27981\t10006\tTom Cruise\tIf you had told fourteen-year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not-too-distant future he would be considered one of the top hundred movie stars of all time, he would have probably grinned and told you that his ambition was to become a priest. None the less, this sensitive, deeply religious youngster who...\tSyracuse, New York, United States\timg/actors/10006.jpg\t0.99236155\n27981\t90009\tPam Grier\tPam Grier was born in Winston-Salem, NC, one of four children of Gwendolyn Sylvia (Samuels), a nurse, and Clarence Ransom Grier Jr., an Air Force mechanic. Pam has been a major African-American star from the early 1970s. Her career started in 1971, when Roger Corman of New World Pictures launched her with The Big Doll House...\tWinstom-Salem, North Carolina, United States\timg/actors/90009.jpg\t0.99236155\n27981\t90011\tAshley Judd\tAshley Judd was born on April 19, 1968 in Granada Hills, California, USA as Ashley Tyler Ciminella. She is an actress and producer, known for Divergent (2014), Heat (1995) and Double Jeopardy (1999). She was previously married to Dario Franchitti.\tGranada Hills, California, United States\timg/actors/90011.jpg\t0.99236155\n27981\t10005\tJames Gandolfini\tJames Gandolfini was born in Westwood, New Jersey, to Santa (Penna), a high school lunchlady, and James Joseph Gandolfini, Sr., a bricklayer and head school janitor. His parents were both of Italian origin. Gandolfini began acting in the New York theater. His Broadway debut was in the 1992 revival of \"A Streetcar Named Desire\" with Jessica Lange and Alec Baldwin...\tWestwood, New Jersey, United States\timg/actors/10005.jpg\t0.012595013\n27981\t10011\tJohn Travolta\tJohn Travolta was born in Englewood, New Jersey, one of six children of Helen Travolta Helen Cecilia Burke) and Salvatore Travolta. His father was of Italian descent and his mother was of Irish ancestry. His father owned a tire repair shop called Travolta Tires in Hillsdale, NJ. Travolta appeared in a local production of \"Who\u0027ll Save the Plowboy?\"...\tEnglewood, New York, United States\timg/actors/10011.jpg\t0.0037653595\n27981\t90002\tShannon Whirry\tShannon Whirry is not just a talented actress with girl-next-door looks, she captured a generation of viewers\u0027 imaginations by wishing that she actually was the girl-next-door. Born in Green Lake County, Wisconsin, Whirry graduated from high school and packed her bags for New York. She trained at the...\tGreen Lake, Wisconsin, United States\timg/actors/90002.jpg\t0.0037653595\n27981\t90003\tRosalind Allen\tRosalind Allen (born Rosalind Ingledew) hails from New Zealand and studied acting there before coming to the United States. Her movie debut was in the film, Perfect, and she continues a long career in television \u0026 film. Famously remembered as the \"It girl\" in the Seinfeld episode, The Marine Biologist...\tWellington, New Zealand, New Zealand\timg/actors/90003.jpg\t0.0037653595\n27981\t90004\tBobbie Phillips\tBrains and beauty are two words that have been repeatedly used to describe Bobbie Phillips throughout her career. Graduating high school at 16 years old, Bobbie tried several different career paths. After taking college classes to become a litigation attorney, it was suggested she also take drama classes...\tSalisbury, North Carolina, United States\timg/actors/90004.jpg\t0.0037653595\n27981\t90005\tKeshia Knight Pulliam\tKeshia Knight Pulliam was born on April 9, 1979 in Newark, New Jersey, USA. She is an actress, known for The Cosby Show (1984), Madea Goes to Jail (2009) and Beauty Shop (2005).\tNewark, New Jersey, United States\timg/actors/90005.jpg\t0.0037653595\n27981\t90008\tShannah Laumeister\tShannah Laumeister was born on July 23, 1969 in San Francisco, California, USA. She is an actress and director, known for Bullets Over Broadway (1994), Nobody\u0027s Fool (1994) and 61* (2001). She was previously married to Bert Stern.\tSan Francisco, California, United States\timg/actors/90008.jpg\t0.0037653595\n27981\t10004\tMorgan Freeman\tWith an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born in June 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended...\tMemphis, Tennessee, United States\timg/actors/10004.jpg\t0.0032498091\n27981\t90012\tStacey Dash\tStacey Dash was born in the Bronx, New York. Stacy knew that she wanted to act, and from an early age began to act professionally. She made regular appearances on The Cosby Show, The Fresh Prince of Bel-Air, and also St. Elsewhere. At 21 she made her feature film debut in Enemy Territory, which was quickly followed by Moving...\tBronx, New York, United States\timg/actors/90012.jpg\t0.0032497793\n27981\t10013\tMark Wahlberg\tAmerican actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to respected actor. A Best Supporting Actor Oscar nominee for The Departed who went on to receive positive critical reviews for his performance in The Fighter, Wahlberg also is a solid comedy actor, proven by his starring role in Ted...\tBoston, Massachusetts, United States\timg/actors/10013.jpg\t0.003007494\n27981\t10014\tJames Franco\tKnown for his breakthrough starring role on Freaks and Geeks, James Franco was born in Palo Alto, California on April 19, 1978. His mother, Betsy Franco, is Jewish, and his father, Douglas Eugene \"Doug\" Franco, was of Portuguese and Swedish descent, and ran a Silicon Valley business. James\u0027s mother, a writer, has occasionally acted...\tPalo Alto, California, United States\timg/actors/10014.jpg\t0.003007494\n27981\t10012\tJohnny Depp\tJohnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15...\tOwensboro, Kentucky, United States\timg/actors/10012.jpg\t0.0030074865\n27981\t10001\tLeonardo DiCaprio\tFew actors in the world have had a career quite as diverse as Leonardo DiCaprio\u0027s. DiCaprio has gone from relatively humble beginnings, as a supporting cast member of the sitcom Growing Pains and low budget horror movies, such as Critters 3, to a major teenage heartthrob in the 1990s, as the hunky lead actor in movies such as Romeo + Juliet and Titanic...\tHollywood, California, United States\timg/actors/10001.jpg\t0.0012345389\n27981\t10003\tAl Pacino\tOne of the greatest actors in all of film history, Al Pacino established himself during one of film\u0027s greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents...\tManhattan, New York, United States\timg/actors/10003.jpg\t0.0012345389\n27981\t10009\tChazz Palminteri\tBronx-born and raised Chazz Palminteri was a natural choice to continue the Italianate torch in film. In the tradition set forth in the 1970s by such icons as director Martin Scorsese and actors Robert De Niro, Al Pacino, John Cazale and Joe Pesci, Palminteri has brought grit, muscle and an evocative realism to the sidewalks of his New York neighborhood...\tBronx, New York, United States\timg/actors/10009.jpg\t0.0012345389\n27981\t10015\tClive Owen\tDarkly handsome British actor Clive Owen is one of a handful of stars best known for his art house films but how has handle more mainstream action films lately with equal measures of grace and skill. Owen typically is cast as characters whose primary traits are a balance of physical strength, intellect...\tCoventry, Warwickshire, England\timg/actors/10015.jpg\t0.0012345389\n27981\t90006\tTatyana Ali\tOn January 24, 1979, Tatyana Marisol Ali was born to Sonia, who was a nurse from Panama, and Sheriff Ali, a retired police officer from Trinidad. At the age of four she started singing and got a taste of fame when she begged her mother to take her to an audition for Sesame Street. She went on to perform in many productions in her native city...\tBrooklyn, New York, United States\timg/actors/90006.jpg\t0.0012345389\n27981\t90014\tGail O\u0027Grady\tGail O\u0027Grady was born on January 23, 1963 in Detroit, Michigan, USA as Gail Ann O\u0027Grady. She is an actress and producer, known for American Dreams (2002), Deuce Bigalow: Male Gigolo (1999) and NYPD Blue (1993). She was previously married to John Stamatakis, Anthony J Pellegrino, Steve Fenton, Severin Wunderman, Jeffrey Byron and Richard Dasko.\tDetroit, Michigan, United States\timg/actors/90014.jpg\t0.0012345389\n27981\t10002\tAnthony Hopkins\tAnthony Hopkins was born on December 31, 1937, in Margam, Wales, to Muriel Anne (Yeats) and Richard Arthur Hopkins, a baker. His parents were both of half Welsh and half English descent. Influenced by Richard Burton, he decided to study at College of Music and Drama and graduated in 1957. In 1965, he moved to London and joined the National Theatre...\tPort Talbot, Glamorgan, Wales\timg/actors/10002.jpg\t0.0012345314\n27981\t10010\tTom Hanks\tThomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an itinerant cook. His father had English, and some German, ancestry, while his mother\u0027s family, originally surnamed \"Fraga\", was entirely Portuguese. Tom grew up in what he has called a \"fractured\" family...\tConcord, California, United States\timg/actors/10010.jpg\t0.0012345314\n27981\t90007\tAngell Conwell\tBorn in the tiny town of Orangeburg, South Carolina, Angell Conwell began her journey at a very young age. After winning countless pageants locally, she signed with Wilhelmina\u0027s Kids Division in New York at the age of 10. Angell enjoyed modeling but yearned for more of a challenge. She begged for her parents permission to audition for a role in August Wilson\u0027s highly acclaimed...\tOrangeburg, South Carolina, United States\timg/actors/90007.jpg\t0.0012345314\n27981\t90001\tLinda Blair\tFrom the age of five, Linda Blair had to get used to the spotlight, first as a child model and then as an actress, when out of 600 applicants she was picked for the role of Regan, the possessed child, in The Exorcist. Linda quickly rose to international fame, won the Golden Globe, and seemed to be set to take the Academy Award for that role...\tSt. Louis, Missouri, United States\timg/actors/90001.jpg\t-0.0026526004\n27981\t90013\tSofia Vergara\tSofia Margarita Vergara Vergara was born and raised in Barranquilla, Colombia. Her mother, Margarita Vergara Davila de Vergara, is a housewife. Her father, Julio Enrique Vergara Robayo, provides cattle to the meat industry. She has five siblings. She was educated at a private bilingual Spanish/English school...\tBarranquilla, Atlantico, Colombia\timg/actors/90013.jpg\t-0.0026526004\n27981\t90015\tBarbara Niven\tBarbara Niven was born on February 26, 1953 in Portland, Oregon, USA as Barbara Lee Bucholz. She is an actress and producer, known for A Perfect Ending (2012), Pensacola: Wings of Gold (1997) and The Rat Pack (1998).\tPortland, Oregon, United States\timg/actors/90015.jpg\t-0.0026526004\n47154\t90002\tShannon Whirry\tShannon Whirry is not just a talented actress with girl-next-door looks, she captured a generation of viewers\u0027 imaginations by wishing that she actually was the girl-next-door. Born in Green Lake County, Wisconsin, Whirry graduated from high school and packed her bags for New York. She trained at the...\tGreen Lake, Wisconsin, United States\timg/actors/90002.jpg\t0.9960449\n47154\t10011\tJohn Travolta\tJohn Travolta was born in Englewood, New Jersey, one of six children of Helen Travolta Helen Cecilia Burke) and Salvatore Travolta. His father was of Italian descent and his mother was of Irish ancestry. His father owned a tire repair shop called Travolta Tires in Hillsdale, NJ. Travolta appeared in a local production of \"Who\u0027ll Save the Plowboy?\"...\tEnglewood, New York, United States\timg/actors/10011.jpg\t0.99604475\n47154\t90003\tRosalind Allen\tRosalind Allen (born Rosalind Ingledew) hails from New Zealand and studied acting there before coming to the United States. Her movie debut was in the film, Perfect, and she continues a long career in television \u0026 film. Famously remembered as the \"It girl\" in the Seinfeld episode, The Marine Biologist...\tWellington, New Zealand, New Zealand\timg/actors/90003.jpg\t0.99604475\n47154\t90004\tBobbie Phillips\tBrains and beauty are two words that have been repeatedly used to describe Bobbie Phillips throughout her career. Graduating high school at 16 years old, Bobbie tried several different career paths. After taking college classes to become a litigation attorney, it was suggested she also take drama classes...\tSalisbury, North Carolina, United States\timg/actors/90004.jpg\t0.99604475\n47154\t90005\tKeshia Knight Pulliam\tKeshia Knight Pulliam was born on April 9, 1979 in Newark, New Jersey, USA. She is an actress, known for The Cosby Show (1984), Madea Goes to Jail (2009) and Beauty Shop (2005).\tNewark, New Jersey, United States\timg/actors/90005.jpg\t0.99604475\n47154\t90008\tShannah Laumeister\tShannah Laumeister was born on July 23, 1969 in San Francisco, California, USA. She is an actress and director, known for Bullets Over Broadway (1994), Nobody\u0027s Fool (1994) and 61* (2001). She was previously married to Bert Stern.\tSan Francisco, California, United States\timg/actors/90008.jpg\t0.99604475\n47154\t10007\tDenzel Washington\tDenzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis (Lowe), from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University...\tMount Vernon, New York, United States\timg/actors/10007.jpg\t0.99521875\n47154\t10008\tRobert De Niro\tRobert De Niro, thought of as one of the greatest American actors of all time, was born in New York City, to artists Virginia (Admiral) and Robert De Niro Sr. His paternal grandfather was of Italian descent, and his other ancestry is Irish, Dutch, English, French, and German. He was trained at the Stella Adler Conservatory and the American Workshop...\tManhattan, New York, United States\timg/actors/10008.jpg\t0.99521875\n47154\t90010\tTiffani Thiessen\tTiffani-Amber Thiessen was born on January 23, 1974, in Long Beach, California, USA, to Frank Thiessen, a park designer, and Robyn Ernest, a homemaker. She grew up in Long Beach with her parents and her brothers, professional cyclist Todd (b. 1968) and Schuyler (b. 1977). When Tiffani was 8, her uncle...\tLong Beach, California, United States\timg/actors/90010.jpg\t0.9952187\n47154\t10012\tJohnny Depp\tJohnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15...\tOwensboro, Kentucky, United States\timg/actors/10012.jpg\t0.9941386\n47154\t10013\tMark Wahlberg\tAmerican actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to respected actor. A Best Supporting Actor Oscar nominee for The Departed who went on to receive positive critical reviews for his performance in The Fighter, Wahlberg also is a solid comedy actor, proven by his starring role in Ted...\tBoston, Massachusetts, United States\timg/actors/10013.jpg\t0.99413854\n47154\t10014\tJames Franco\tKnown for his breakthrough starring role on Freaks and Geeks, James Franco was born in Palo Alto, California on April 19, 1978. His mother, Betsy Franco, is Jewish, and his father, Douglas Eugene \"Doug\" Franco, was of Portuguese and Swedish descent, and ran a Silicon Valley business. James\u0027s mother, a writer, has occasionally acted...\tPalo Alto, California, United States\timg/actors/10014.jpg\t0.99413854\n47154\t10006\tTom Cruise\tIf you had told fourteen-year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not-too-distant future he would be considered one of the top hundred movie stars of all time, he would have probably grinned and told you that his ambition was to become a priest. None the less, this sensitive, deeply religious youngster who...\tSyracuse, New York, United States\timg/actors/10006.jpg\t0.9928352\n47154\t90009\tPam Grier\tPam Grier was born in Winston-Salem, NC, one of four children of Gwendolyn Sylvia (Samuels), a nurse, and Clarence Ransom Grier Jr., an Air Force mechanic. Pam has been a major African-American star from the early 1970s. Her career started in 1971, when Roger Corman of New World Pictures launched her with The Big Doll House...\tWinstom-Salem, North Carolina, United States\timg/actors/90009.jpg\t0.9928352\n47154\t90011\tAshley Judd\tAshley Judd was born on April 19, 1968 in Granada Hills, California, USA as Ashley Tyler Ciminella. She is an actress and producer, known for Divergent (2014), Heat (1995) and Double Jeopardy (1999). She was previously married to Dario Franchitti.\tGranada Hills, California, United States\timg/actors/90011.jpg\t0.9928352\n47154\t10005\tJames Gandolfini\tJames Gandolfini was born in Westwood, New Jersey, to Santa (Penna), a high school lunchlady, and James Joseph Gandolfini, Sr., a bricklayer and head school janitor. His parents were both of Italian origin. Gandolfini began acting in the New York theater. His Broadway debut was in the 1992 revival of \"A Streetcar Named Desire\" with Jessica Lange and Alec Baldwin...\tWestwood, New Jersey, United States\timg/actors/10005.jpg\t0.99136114\n47154\t90001\tLinda Blair\tFrom the age of five, Linda Blair had to get used to the spotlight, first as a child model and then as an actress, when out of 600 applicants she was picked for the role of Regan, the possessed child, in The Exorcist. Linda quickly rose to international fame, won the Golden Globe, and seemed to be set to take the Academy Award for that role...\tSt. Louis, Missouri, United States\timg/actors/90001.jpg\t0.012645721\n47154\t90013\tSofia Vergara\tSofia Margarita Vergara Vergara was born and raised in Barranquilla, Colombia. Her mother, Margarita Vergara Davila de Vergara, is a housewife. Her father, Julio Enrique Vergara Robayo, provides cattle to the meat industry. She has five siblings. She was educated at a private bilingual Spanish/English school...\tBarranquilla, Atlantico, Colombia\timg/actors/90013.jpg\t0.012645721\n47154\t90015\tBarbara Niven\tBarbara Niven was born on February 26, 1953 in Portland, Oregon, USA as Barbara Lee Bucholz. She is an actress and producer, known for A Perfect Ending (2012), Pensacola: Wings of Gold (1997) and The Rat Pack (1998).\tPortland, Oregon, United States\timg/actors/90015.jpg\t0.012645721\n47154\t10004\tMorgan Freeman\tWith an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born in June 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended...\tMemphis, Tennessee, United States\timg/actors/10004.jpg\t0.010432184\n47154\t90012\tStacey Dash\tStacey Dash was born in the Bronx, New York. Stacy knew that she wanted to act, and from an early age began to act professionally. She made regular appearances on The Cosby Show, The Fresh Prince of Bel-Air, and also St. Elsewhere. At 21 she made her feature film debut in Enemy Territory, which was quickly followed by Moving...\tBronx, New York, United States\timg/actors/90012.jpg\t0.010432184\n47154\t10001\tLeonardo DiCaprio\tFew actors in the world have had a career quite as diverse as Leonardo DiCaprio\u0027s. DiCaprio has gone from relatively humble beginnings, as a supporting cast member of the sitcom Growing Pains and low budget horror movies, such as Critters 3, to a major teenage heartthrob in the 1990s, as the hunky lead actor in movies such as Romeo + Juliet and Titanic...\tHollywood, California, United States\timg/actors/10001.jpg\t0.004666351\n47154\t10003\tAl Pacino\tOne of the greatest actors in all of film history, Al Pacino established himself during one of film\u0027s greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents...\tManhattan, New York, United States\timg/actors/10003.jpg\t0.004666351\n47154\t10009\tChazz Palminteri\tBronx-born and raised Chazz Palminteri was a natural choice to continue the Italianate torch in film. In the tradition set forth in the 1970s by such icons as director Martin Scorsese and actors Robert De Niro, Al Pacino, John Cazale and Joe Pesci, Palminteri has brought grit, muscle and an evocative realism to the sidewalks of his New York neighborhood...\tBronx, New York, United States\timg/actors/10009.jpg\t0.004666351\n47154\t10015\tClive Owen\tDarkly handsome British actor Clive Owen is one of a handful of stars best known for his art house films but how has handle more mainstream action films lately with equal measures of grace and skill. Owen typically is cast as characters whose primary traits are a balance of physical strength, intellect...\tCoventry, Warwickshire, England\timg/actors/10015.jpg\t0.004666351\n47154\t90007\tAngell Conwell\tBorn in the tiny town of Orangeburg, South Carolina, Angell Conwell began her journey at a very young age. After winning countless pageants locally, she signed with Wilhelmina\u0027s Kids Division in New York at the age of 10. Angell enjoyed modeling but yearned for more of a challenge. She begged for her parents permission to audition for a role in August Wilson\u0027s highly acclaimed...\tOrangeburg, South Carolina, United States\timg/actors/90007.jpg\t0.004666351\n47154\t10002\tAnthony Hopkins\tAnthony Hopkins was born on December 31, 1937, in Margam, Wales, to Muriel Anne (Yeats) and Richard Arthur Hopkins, a baker. His parents were both of half Welsh and half English descent. Influenced by Richard Burton, he decided to study at College of Music and Drama and graduated in 1957. In 1965, he moved to London and joined the National Theatre...\tPort Talbot, Glamorgan, Wales\timg/actors/10002.jpg\t0.0046663433\n47154\t10010\tTom Hanks\tThomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an itinerant cook. His father had English, and some German, ancestry, while his mother\u0027s family, originally surnamed \"Fraga\", was entirely Portuguese. Tom grew up in what he has called a \"fractured\" family...\tConcord, California, United States\timg/actors/10010.jpg\t0.0046663433\n47154\t90006\tTatyana Ali\tOn January 24, 1979, Tatyana Marisol Ali was born to Sonia, who was a nurse from Panama, and Sheriff Ali, a retired police officer from Trinidad. At the age of four she started singing and got a taste of fame when she begged her mother to take her to an audition for Sesame Street. She went on to perform in many productions in her native city...\tBrooklyn, New York, United States\timg/actors/90006.jpg\t0.0046663433\n47154\t90014\tGail O\u0027Grady\tGail O\u0027Grady was born on January 23, 1963 in Detroit, Michigan, USA as Gail Ann O\u0027Grady. She is an actress and producer, known for American Dreams (2002), Deuce Bigalow: Male Gigolo (1999) and NYPD Blue (1993). She was previously married to John Stamatakis, Anthony J Pellegrino, Steve Fenton, Severin Wunderman, Jeffrey Byron and Richard Dasko.\tDetroit, Michigan, United States\timg/actors/90014.jpg\t0.0046663433\n"
      },
      "dateCreated": "Apr 17, 2016 7:53:45 PM",
      "dateStarted": "Jun 11, 2016 5:50:38 AM",
      "dateFinished": "Jun 11, 2016 5:50:58 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "text": "import com.netflix.dyno.jedis._\nimport com.netflix.dyno.connectionpool.Host\nimport com.netflix.dyno.connectionpool.HostSupplier\nimport com.netflix.dyno.connectionpool.TokenMapSupplier\nimport com.netflix.dyno.connectionpool.impl.lb.HostToken\nimport com.netflix.dyno.connectionpool.exception.DynoException\nimport com.netflix.dyno.connectionpool.impl.ConnectionPoolConfigurationImpl;\nimport com.netflix.dyno.connectionpool.impl.ConnectionContextImpl\nimport com.netflix.dyno.connectionpool.impl.OperationResultImpl\nimport com.netflix.dyno.connectionpool.impl.utils.ZipUtils\n\n//import scala.collection.JavaConverters._\n\nimport java.util.Collections\nimport java.util.Collection\nimport java.util.Set\nimport java.util.List\n\nval localhostHost \u003d new Host(\"127.0.0.1\", Host.Status.Up)\nval localhostToken \u003d new HostToken(100000L, localhostHost)\n\nval localhostHostSupplier \u003d new HostSupplier() {\n  @Override\n  def getHosts(): Collection[Host] \u003d {\n    Collections.singletonList(localhostHost)\n  }\n}\n\nval localhostTokenMapSupplier \u003d new TokenMapSupplier() {\n  @Override\n  def getTokens(activeHosts: Set[Host]): List[HostToken] \u003d {\n\tCollections.singletonList(localhostToken)\n  }\n\n  @Override\n  def getTokenForHost(host: Host, activeHosts: Set[Host]): HostToken \u003d {\n    return localhostToken\n  }\n}\n\nval redisPort \u003d 6379                        \nval dynoClient \u003d new DynoJedisClient.Builder()\n              .withApplicationName(\"pipeline\")\n              .withDynomiteClusterName(\"pipeline-dynomite\")\n              .withHostSupplier(localhostHostSupplier)\n              .withCPConfig(new ConnectionPoolConfigurationImpl(\"localhostTokenMapSupplier\")\n                .withTokenSupplier(localhostTokenMapSupplier))\n              .withPort(redisPort)\n              .build()\n\nval recommendations \u003d enrichedRecommendationsDF.collect()\n\ndynoClient.set(\"personalized-als\", recommendations.mkString(\",\"))\n\nval retrievedRecommenations \u003d dynoClient.get(\"personalized-als\")\n\ndynoClient.stopClient()",
      "dateUpdated": "Jun 11, 2016 5:40:56 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala"
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465623520589_1668216997",
      "id": "20160611-053840_879401130",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import com.netflix.dyno.jedis._\nimport com.netflix.dyno.connectionpool.Host\nimport com.netflix.dyno.connectionpool.HostSupplier\nimport com.netflix.dyno.connectionpool.TokenMapSupplier\nimport com.netflix.dyno.connectionpool.impl.lb.HostToken\nimport com.netflix.dyno.connectionpool.exception.DynoException\nimport com.netflix.dyno.connectionpool.impl.ConnectionPoolConfigurationImpl\nimport com.netflix.dyno.connectionpool.impl.ConnectionContextImpl\nimport com.netflix.dyno.connectionpool.impl.OperationResultImpl\nimport com.netflix.dyno.connectionpool.impl.utils.ZipUtils\nimport java.util.Collections\nimport java.util.Collection\nimport java.util.Set\nimport java.util.List\nlocalhostHost: com.netflix.dyno.connectionpool.Host \u003d Host [name\u003d127.0.0.1, port\u003d-1, dc: null, status: Up]\nlocalhostToken: com.netflix.dyno.connectionpool.impl.lb.HostToken \u003d HostToken [token\u003d100000, host\u003dHost [name\u003d127.0.0.1, port\u003d-1, dc: null, status: Up]]\nlocalhostHostSupplier: com.netflix.dyno.connectionpool.HostSupplier \u003d $iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$anon$1@98044b4\nlocalhostTokenMapSupplier: com.netflix.dyno.connectionpool.TokenMapSupplier \u003d $iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$iwC$$anon$1@22ebbe71\nredisPort: Int \u003d 6379\ndynoClient: com.netflix.dyno.jedis.DynoJedisClient \u003d com.netflix.dyno.jedis.DynoJedisClient@bdc93d4\nrecommendations: Array[org.apache.spark.sql.Row] \u003d Array([308,10012,Johnny Depp,Johnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15...,Owensboro, Kentucky, United States,img/actors/10012.jpg,1.0036116], [308,10013,Mark Wahlberg,American actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to respected actor. A Best Supporting Actor Oscar nominee for The Departed who went on to receive positive critical reviews for his performance in The Fighter, Wa...res164: String \u003d OK\nretrievedRecommenations: String \u003d [308,10012,Johnny Depp,Johnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15...,Owensboro, Kentucky, United States,img/actors/10012.jpg,1.0036116],[308,10013,Mark Wahlberg,American actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to respected actor. A Best Supporting Actor Oscar nominee for The Departed who went on to receive positive critical reviews for his performance in The Fighter, Wahlberg also is a solid c..."
      },
      "dateCreated": "Jun 11, 2016 5:38:40 AM",
      "dateStarted": "Jun 11, 2016 5:50:45 AM",
      "dateFinished": "Jun 11, 2016 5:51:07 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Show UserFactors Matrix",
      "text": "import org.apache.spark.mllib.linalg.Vectors\n\nval userFactorsDF \u003d model.userFactors.map(row \u003d\u003e \n  (row.getInt(0), row.getSeq[Float](1).toArray.map(_.toDouble))\n).toDF(\"userId\", \"userFactors\")\n .sort($\"userId\" asc)\n .as(\"userFactors\")\n\nz.show(userFactorsDF)",
      "dateUpdated": "Jun 11, 2016 5:40:56 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 135.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "userFactors",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "userFactors",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456873568687_1047705598",
      "id": "20160301-230608_2073461478",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\tuserFactors\n308\tWrappedArray(-0.17737817764282227, -0.20854251086711884, 0.04136478155851364, 0.49143457412719727, 0.14726540446281433, 1.642783754505217E-4, 0.23227830231189728, 0.32616710662841797, 0.46448206901550293, -0.303312212228775)\n3342\tWrappedArray(-0.05148479714989662, 0.5635057091712952, -0.10690464079380035, 0.07417914271354675, 0.5438995957374573, 0.2173623889684677, -0.406960129737854, 0.49697503447532654, 0.060459062457084656, 0.17666687071323395)\n21619\tWrappedArray(-0.4271702766418457, -0.2568177282810211, -0.4628252685070038, 0.2588568329811096, 0.19703032076358795, -0.30235812067985535, -0.05028396099805832, -0.11636366695165634, -0.3589180111885071, 0.4519263505935669)\n27981\tWrappedArray(-0.014062833972275257, 0.052201882004737854, 0.2557031512260437, -0.07259570807218552, 0.26989662647247314, -0.5122823119163513, 0.06666462868452072, 0.8723391890525818, -0.026934675872325897, 0.0237866323441267)\n47154\tWrappedArray(0.07558826357126236, 0.17274488508701324, -0.476077675819397, 0.20661397278308868, -0.24742673337459564, -0.11784394085407257, 0.2887322008609772, 0.6569904088973999, 0.4000217020511627, 0.07501426339149475)\n"
      },
      "dateCreated": "Mar 1, 2016 11:06:08 PM",
      "dateStarted": "Jun 11, 2016 5:50:59 AM",
      "dateFinished": "Jun 11, 2016 5:51:10 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Show ItemFactors Matrix",
      "text": "import org.apache.spark.mllib.linalg.Vectors\n \nval itemFactorsDF \u003d model.itemFactors.map(row \u003d\u003e\n  (row.getInt(0), row.getSeq[Float](1).toArray.map(_.toDouble))\n).toDF(\"itemId\", \"itemFactors\")\n .sort($\"itemId\" asc)\n .as(\"itemFactors\")\n\nz.show(itemFactorsDF)",
      "dateUpdated": "Jun 11, 2016 5:40:56 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 314.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456865217092_774550692",
      "id": "20160301-204657_541485869",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "itemId\titemFactors\n10001\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\n10002\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\n10003\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\n10004\tWrappedArray(-0.48586517572402954, 0.11044920980930328, 0.10175096988677979, 0.8975138068199158, 0.9797528386116028, 0.62549889087677, -0.3409882187843323, 0.15194955468177795, 0.5806983113288879, -0.35270509123802185)\n10005\tWrappedArray(-0.24834878742694855, 0.3767443895339966, -0.6060032248497009, 0.8721209168434143, 0.3859187364578247, 0.5947469472885132, -0.05192231386899948, 0.5010042786598206, 0.8407634496688843, -0.11407560110092163)\n10006\tWrappedArray(-0.22673851251602173, 0.2200668305158615, -0.13837561011314392, 0.5867212414741516, 0.5306106209754944, -0.03788437694311142, 0.03821028023958206, 1.0410995483398438, 0.5618112683296204, -0.1077485904097557)\n10007\tWrappedArray(-0.13931381702423096, -0.28943589329719543, -0.01397622562944889, 0.4322599172592163, 0.0014919909881427884, -0.47958847880363464, 0.49447837471961975, 0.8971498012542725, 0.46936675906181335, -0.21745099127292633)\n10008\tWrappedArray(-0.13931381702423096, -0.28943589329719543, -0.01397622562944889, 0.4322599172592163, 0.0014919909881427884, -0.47958847880363464, 0.49447837471961975, 0.8971498012542725, 0.46936675906181335, -0.21745099127292633)\n10009\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\n10010\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\n10011\tWrappedArray(-0.15998072922229767, -0.1349567323923111, -0.48799803853034973, 0.7199497222900391, -0.15112712979316711, 0.15684430301189423, 0.408088356256485, 0.34977400302886963, 0.7516242861747742, -0.22433380782604218)\n10012\tWrappedArray(-0.611869752407074, -0.43018078804016113, -0.9184210896492004, 1.0370264053344727, 0.07369246333837509, -0.13940854370594025, 0.38086390495300293, 0.2499788999557495, 0.4440004229545593, 0.17583566904067993)\n10013\tWrappedArray(-0.611869752407074, -0.43018078804016113, -0.9184210896492004, 1.0370264053344727, 0.07369246333837509, -0.13940854370594025, 0.38086390495300293, 0.2499788999557495, 0.4440004229545593, 0.17583566904067993)\n10014\tWrappedArray(-0.611869752407074, -0.43018078804016113, -0.9184210896492004, 1.0370264053344727, 0.07369246333837509, -0.13940854370594025, 0.38086390495300293, 0.2499788999557495, 0.4440004229545593, 0.17583566904067993)\n10015\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\n90001\tWrappedArray(-0.8509779572486877, -0.7021375298500061, -0.20975498855113983, 1.0617326498031616, 0.6657741069793701, -0.11553911864757538, 0.09498735517263412, -0.0987415537238121, 0.18053753674030304, -0.06166806071996689)\n90002\tWrappedArray(-0.15998072922229767, -0.1349567323923111, -0.48799803853034973, 0.7199497222900391, -0.15112712979316711, 0.15684430301189423, 0.408088356256485, 0.34977400302886963, 0.7516242861747742, -0.22433380782604218)\n90003\tWrappedArray(-0.15998072922229767, -0.1349567323923111, -0.48799803853034973, 0.7199497222900391, -0.15112712979316711, 0.15684430301189423, 0.408088356256485, 0.34977400302886963, 0.7516242861747742, -0.22433380782604218)\n90004\tWrappedArray(-0.15998072922229767, -0.1349567323923111, -0.48799803853034973, 0.7199497222900391, -0.15112712979316711, 0.15684430301189423, 0.408088356256485, 0.34977400302886963, 0.7516242861747742, -0.22433380782604218)\n90005\tWrappedArray(-0.15998072922229767, -0.1349567323923111, -0.48799803853034973, 0.7199497222900391, -0.15112712979316711, 0.15684430301189423, 0.408088356256485, 0.34977400302886963, 0.7516242861747742, -0.22433380782604218)\n90006\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\n90007\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\n90008\tWrappedArray(-0.15998072922229767, -0.1349567323923111, -0.48799803853034973, 0.7199497222900391, -0.15112712979316711, 0.15684430301189423, 0.408088356256485, 0.34977400302886963, 0.7516242861747742, -0.22433380782604218)\n90009\tWrappedArray(-0.22673851251602173, 0.2200668305158615, -0.13837561011314392, 0.5867212414741516, 0.5306106209754944, -0.03788437694311142, 0.03821028023958206, 1.0410995483398438, 0.5618112683296204, -0.1077485904097557)\n90010\tWrappedArray(-0.13931381702423096, -0.28943589329719543, -0.01397622562944889, 0.4322599172592163, 0.0014919909881427884, -0.47958847880363464, 0.49447837471961975, 0.8971498012542725, 0.46936675906181335, -0.21745099127292633)\n90011\tWrappedArray(-0.22673851251602173, 0.2200668305158615, -0.13837561011314392, 0.5867212414741516, 0.5306106209754944, -0.03788437694311142, 0.03821028023958206, 1.0410995483398438, 0.5618112683296204, -0.1077485904097557)\n90012\tWrappedArray(-0.48586517572402954, 0.11044920980930328, 0.10175096988677979, 0.8975138068199158, 0.9797528386116028, 0.62549889087677, -0.3409882187843323, 0.15194955468177795, 0.5806983113288879, -0.35270509123802185)\n90013\tWrappedArray(-0.8509779572486877, -0.7021375298500061, -0.20975498855113983, 1.0617326498031616, 0.6657741069793701, -0.11553911864757538, 0.09498735517263412, -0.0987415537238121, 0.18053753674030304, -0.06166806071996689)\n90014\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\n90015\tWrappedArray(-0.8509779572486877, -0.7021375298500061, -0.20975498855113983, 1.0617326498031616, 0.6657741069793701, -0.11553911864757538, 0.09498735517263412, -0.0987415537238121, 0.18053753674030304, -0.06166806071996689)\n"
      },
      "dateCreated": "Mar 1, 2016 8:46:57 PM",
      "dateStarted": "Jun 11, 2016 5:51:08 AM",
      "dateFinished": "Jun 11, 2016 5:51:12 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Enriched ItemFactors Matrix",
      "text": "val enrichedItemFactorsDF \u003d itemFactorsDF\n  .join(itemsDF, $\"items.itemId\" \u003d\u003d\u003d $\"itemFactors.itemId\")\n  .select($\"items.itemId\", $\"title\", $\"tags\", $\"itemFactors\", $\"img\")\n  .sort($\"items.itemId\")\n  .as(\"enrichedItemFactors\")\n\nz.show(enrichedItemFactorsDF)",
      "dateUpdated": "Jun 11, 2016 5:40:56 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1461098265813_1981370856",
      "id": "20160419-203745_842155819",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "itemId\ttitle\ttags\titemFactors\timg\n10001\tLeonardo DiCaprio\tHollywood, California, United States\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\timg/actors/10001.jpg\n10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\timg/actors/10002.jpg\n10003\tAl Pacino\tManhattan, New York, United States\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\timg/actors/10003.jpg\n10004\tMorgan Freeman\tMemphis, Tennessee, United States\tWrappedArray(-0.48586517572402954, 0.11044920980930328, 0.10175096988677979, 0.8975138068199158, 0.9797528386116028, 0.62549889087677, -0.3409882187843323, 0.15194955468177795, 0.5806983113288879, -0.35270509123802185)\timg/actors/10004.jpg\n10005\tJames Gandolfini\tWestwood, New Jersey, United States\tWrappedArray(-0.24834878742694855, 0.3767443895339966, -0.6060032248497009, 0.8721209168434143, 0.3859187364578247, 0.5947469472885132, -0.05192231386899948, 0.5010042786598206, 0.8407634496688843, -0.11407560110092163)\timg/actors/10005.jpg\n10006\tTom Cruise\tSyracuse, New York, United States\tWrappedArray(-0.22673851251602173, 0.2200668305158615, -0.13837561011314392, 0.5867212414741516, 0.5306106209754944, -0.03788437694311142, 0.03821028023958206, 1.0410995483398438, 0.5618112683296204, -0.1077485904097557)\timg/actors/10006.jpg\n10007\tDenzel Washington\tMount Vernon, New York, United States\tWrappedArray(-0.13931381702423096, -0.28943589329719543, -0.01397622562944889, 0.4322599172592163, 0.0014919909881427884, -0.47958847880363464, 0.49447837471961975, 0.8971498012542725, 0.46936675906181335, -0.21745099127292633)\timg/actors/10007.jpg\n10008\tRobert De Niro\tManhattan, New York, United States\tWrappedArray(-0.13931381702423096, -0.28943589329719543, -0.01397622562944889, 0.4322599172592163, 0.0014919909881427884, -0.47958847880363464, 0.49447837471961975, 0.8971498012542725, 0.46936675906181335, -0.21745099127292633)\timg/actors/10008.jpg\n10009\tChazz Palminteri\tBronx, New York, United States\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\timg/actors/10009.jpg\n10010\tTom Hanks\tConcord, California, United States\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\timg/actors/10010.jpg\n10011\tJohn Travolta\tEnglewood, New York, United States\tWrappedArray(-0.15998072922229767, -0.1349567323923111, -0.48799803853034973, 0.7199497222900391, -0.15112712979316711, 0.15684430301189423, 0.408088356256485, 0.34977400302886963, 0.7516242861747742, -0.22433380782604218)\timg/actors/10011.jpg\n10012\tJohnny Depp\tOwensboro, Kentucky, United States\tWrappedArray(-0.611869752407074, -0.43018078804016113, -0.9184210896492004, 1.0370264053344727, 0.07369246333837509, -0.13940854370594025, 0.38086390495300293, 0.2499788999557495, 0.4440004229545593, 0.17583566904067993)\timg/actors/10012.jpg\n10013\tMark Wahlberg\tBoston, Massachusetts, United States\tWrappedArray(-0.611869752407074, -0.43018078804016113, -0.9184210896492004, 1.0370264053344727, 0.07369246333837509, -0.13940854370594025, 0.38086390495300293, 0.2499788999557495, 0.4440004229545593, 0.17583566904067993)\timg/actors/10013.jpg\n10014\tJames Franco\tPalo Alto, California, United States\tWrappedArray(-0.611869752407074, -0.43018078804016113, -0.9184210896492004, 1.0370264053344727, 0.07369246333837509, -0.13940854370594025, 0.38086390495300293, 0.2499788999557495, 0.4440004229545593, 0.17583566904067993)\timg/actors/10014.jpg\n10015\tClive Owen\tCoventry, Warwickshire, England\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\timg/actors/10015.jpg\n90001\tLinda Blair\tSt. Louis, Missouri, United States\tWrappedArray(-0.8509779572486877, -0.7021375298500061, -0.20975498855113983, 1.0617326498031616, 0.6657741069793701, -0.11553911864757538, 0.09498735517263412, -0.0987415537238121, 0.18053753674030304, -0.06166806071996689)\timg/actors/90001.jpg\n90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\tWrappedArray(-0.15998072922229767, -0.1349567323923111, -0.48799803853034973, 0.7199497222900391, -0.15112712979316711, 0.15684430301189423, 0.408088356256485, 0.34977400302886963, 0.7516242861747742, -0.22433380782604218)\timg/actors/90002.jpg\n90003\tRosalind Allen\tWellington, New Zealand, New Zealand\tWrappedArray(-0.15998072922229767, -0.1349567323923111, -0.48799803853034973, 0.7199497222900391, -0.15112712979316711, 0.15684430301189423, 0.408088356256485, 0.34977400302886963, 0.7516242861747742, -0.22433380782604218)\timg/actors/90003.jpg\n90004\tBobbie Phillips\tSalisbury, North Carolina, United States\tWrappedArray(-0.15998072922229767, -0.1349567323923111, -0.48799803853034973, 0.7199497222900391, -0.15112712979316711, 0.15684430301189423, 0.408088356256485, 0.34977400302886963, 0.7516242861747742, -0.22433380782604218)\timg/actors/90004.jpg\n90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\tWrappedArray(-0.15998072922229767, -0.1349567323923111, -0.48799803853034973, 0.7199497222900391, -0.15112712979316711, 0.15684430301189423, 0.408088356256485, 0.34977400302886963, 0.7516242861747742, -0.22433380782604218)\timg/actors/90005.jpg\n90006\tTatyana Ali\tBrooklyn, New York, United States\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\timg/actors/90006.jpg\n90007\tAngell Conwell\tOrangeburg, South Carolina, United States\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\timg/actors/90007.jpg\n90008\tShannah Laumeister\tSan Francisco, California, United States\tWrappedArray(-0.15998072922229767, -0.1349567323923111, -0.48799803853034973, 0.7199497222900391, -0.15112712979316711, 0.15684430301189423, 0.408088356256485, 0.34977400302886963, 0.7516242861747742, -0.22433380782604218)\timg/actors/90008.jpg\n90009\tPam Grier\tWinstom-Salem, North Carolina, United States\tWrappedArray(-0.22673851251602173, 0.2200668305158615, -0.13837561011314392, 0.5867212414741516, 0.5306106209754944, -0.03788437694311142, 0.03821028023958206, 1.0410995483398438, 0.5618112683296204, -0.1077485904097557)\timg/actors/90009.jpg\n90010\tTiffani Thiessen\tLong Beach, California, United States\tWrappedArray(-0.13931381702423096, -0.28943589329719543, -0.01397622562944889, 0.4322599172592163, 0.0014919909881427884, -0.47958847880363464, 0.49447837471961975, 0.8971498012542725, 0.46936675906181335, -0.21745099127292633)\timg/actors/90010.jpg\n90011\tAshley Judd\tGranada Hills, California, United States\tWrappedArray(-0.22673851251602173, 0.2200668305158615, -0.13837561011314392, 0.5867212414741516, 0.5306106209754944, -0.03788437694311142, 0.03821028023958206, 1.0410995483398438, 0.5618112683296204, -0.1077485904097557)\timg/actors/90011.jpg\n90012\tStacey Dash\tBronx, New York, United States\tWrappedArray(-0.48586517572402954, 0.11044920980930328, 0.10175096988677979, 0.8975138068199158, 0.9797528386116028, 0.62549889087677, -0.3409882187843323, 0.15194955468177795, 0.5806983113288879, -0.35270509123802185)\timg/actors/90012.jpg\n90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\tWrappedArray(-0.8509779572486877, -0.7021375298500061, -0.20975498855113983, 1.0617326498031616, 0.6657741069793701, -0.11553911864757538, 0.09498735517263412, -0.0987415537238121, 0.18053753674030304, -0.06166806071996689)\timg/actors/90013.jpg\n90014\tGail O\u0027Grady\tDetroit, Michigan, United States\tWrappedArray(-0.400493323802948, -0.408937931060791, 0.2315906584262848, 0.7445540428161621, 0.4483347237110138, 0.1813896894454956, 0.11924625188112259, -2.0522742488537915E-5, 0.48725828528404236, -0.46690067648887634)\timg/actors/90014.jpg\n90015\tBarbara Niven\tPortland, Oregon, United States\tWrappedArray(-0.8509779572486877, -0.7021375298500061, -0.20975498855113983, 1.0617326498031616, 0.6657741069793701, -0.11553911864757538, 0.09498735517263412, -0.0987415537238121, 0.18053753674030304, -0.06166806071996689)\timg/actors/90015.jpg\n"
      },
      "dateCreated": "Apr 19, 2016 8:37:45 PM",
      "dateStarted": "Jun 11, 2016 5:51:11 AM",
      "dateFinished": "Jun 11, 2016 5:51:14 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Calculate Predicted Rating for a Given userId and ItemId - compare Prediction to above",
      "text": "import com.advancedspark.ml.BLAS\nimport com.advancedspark.ml.Vectors\n\n// User 21619\nval givenUserId \u003d 21619\nval givenUserFactors \u003d userFactorsDF.select($\"userId\", $\"userFactors\")\n  .where($\"userId\" \u003d\u003d\u003d givenUserId)\n  .map(row \u003d\u003e row.getSeq[Double](1).toArray)\n  .collect()(0)\n\n// Item 10006 - Tom Cruise\nval givenItemId \u003d 10006\nval givenItemFactors \u003d itemFactorsDF.select($\"itemId\", $\"itemFactors\")\n  .where($\"itemId\" \u003d\u003d\u003d givenItemId)\n  .map(row \u003d\u003e row.getSeq[Double](1).toArray)\n  .collect()(0)\n  \nval givenUserFactorsVector \u003d Vectors.dense(givenUserFactors)\nval givenItemFactorsVector \u003d Vectors.dense(givenItemFactors)\n\n// Take dot product of the User x Item vectors\n// This should equal the prediction value in the offline-generated matrix\nval prediction \u003d BLAS.dot(givenUserFactorsVector, givenItemFactorsVector)",
      "dateUpdated": "Jun 11, 2016 5:40:56 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456954812726_1681075178",
      "id": "20160302-214012_540640872",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import com.advancedspark.ml.BLAS\nimport com.advancedspark.ml.Vectors\ngivenUserId: Int \u003d 21619\ngivenUserFactors: Array[Double] \u003d Array(-0.4271702766418457, -0.2568177282810211, -0.4628252685070038, 0.2588568329811096, 0.19703032076358795, -0.30235812067985535, -0.05028396099805832, -0.11636366695165634, -0.3589180111885071, 0.4519263505935669)\ngivenItemId: Int \u003d 10006\ngivenItemFactors: Array[Double] \u003d Array(-0.22673851251602173, 0.2200668305158615, -0.13837561011314392, 0.5867212414741516, 0.5306106209754944, -0.03788437694311142, 0.03821028023958206, 1.0410995483398438, 0.5618112683296204, -0.1077485904097557)\ngivenUserFactorsVector: com.advancedspark.ml.Vector \u003d [-0.4271702766418457,-0.2568177282810211,-0.4628252685070038,0.2588568329811096,0.19703032076358795,-0.30235812067985535,-0.05028396099805832,-0.11636366695165634,-0.3589180111885071,0.4519263505935669]\ngivenItemFactorsVector: com.advancedspark.ml.Vector \u003d [-0.22673851251602173,0.2200668305158615,-0.13837561011314392,0.5867212414741516,0.5306106209754944,-0.03788437694311142,0.03821028023958206,1.0410995483398438,0.5618112683296204,-0.1077485904097557]\nprediction: Double \u003d -0.0011456848685351129\n"
      },
      "dateCreated": "Mar 2, 2016 9:40:12 PM",
      "dateStarted": "Jun 11, 2016 5:51:12 AM",
      "dateFinished": "Jun 11, 2016 5:51:17 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Write the User and item factor vectors to elasticSearch",
      "text": "val esConfig \u003d Map(\"pushdown\" -\u003e \"true\", \"es.nodes\" -\u003e \"127.0.0.1\", \"es.port\" -\u003e \"9200\")\n\nuserFactorsDF.select($\"userId\", $\"userFactors\")\n .sort($\"userId\" asc)\n .write.format(\"org.elasticsearch.spark.sql\")\n .mode(\"overwrite\")\n .options(esConfig)\n .save(\"advancedspark/user-factors-als\")\n \nenrichedItemFactorsDF.select($\"itemId\", $\"title\", $\"itemFactors\", $\"tags\", $\"img\")\n .sort($\"itemId\" asc)\n .write.format(\"org.elasticsearch.spark.sql\")\n .mode(\"overwrite\")\n .options(esConfig)\n .save(\"advancedspark/item-factors-als\")",
      "dateUpdated": "Jun 11, 2016 5:40:56 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1460932159717_2026735022",
      "id": "20160417-222919_647801278",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "esConfig: scala.collection.immutable.Map[String,String] \u003d Map(pushdown -\u003e true, es.nodes -\u003e 127.0.0.1, es.port -\u003e 9200)\nwarning: there were 1 feature warning(s); re-run with -feature for details\nwarning: there were 1 feature warning(s); re-run with -feature for details\n"
      },
      "dateCreated": "Apr 17, 2016 10:29:19 PM",
      "dateStarted": "Jun 11, 2016 5:51:14 AM",
      "dateFinished": "Jun 11, 2016 5:51:23 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Save UserFactors In Json Format",
      "text": "userFactorsDF.select($\"userId\", $\"userFactors\")\n .sort($\"userId\" asc)\n .coalesce(1)\n .write.format(\"json\")\n .partitionBy(\"userId\")\n .mode(\"overwrite\")\n .save(\"/root/pipeline/datasets/serving/live-recommendations/json/als\")",
      "dateUpdated": "Jun 11, 2016 5:40:56 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1463430259467_1664797820",
      "id": "20160516-202419_1447370371",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "warning: there were 1 feature warning(s); re-run with -feature for details\n"
      },
      "dateCreated": "May 16, 2016 8:24:19 PM",
      "dateStarted": "Jun 11, 2016 5:51:18 AM",
      "dateFinished": "Jun 11, 2016 5:51:25 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Save ItemFactors in json Format",
      "text": "enrichedItemFactorsDF.select($\"itemId\", $\"itemFactors\")\n .sort($\"itemId\" asc)\n .coalesce(1)\n .write.format(\"json\")\n .partitionBy(\"itemId\")\n .mode(\"overwrite\")\n .save(\"/root/pipeline/datasets/serving/live-recommendations/json/als\")",
      "dateUpdated": "Jun 11, 2016 5:40:56 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1463425670691_616880560",
      "id": "20160516-190750_911979488",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "warning: there were 1 feature warning(s); re-run with -feature for details\n"
      },
      "dateCreated": "May 16, 2016 7:07:50 PM",
      "dateStarted": "Jun 11, 2016 5:51:23 AM",
      "dateFinished": "Jun 11, 2016 5:51:29 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Save model in spark parquet format",
      "text": "model.save(s\"/root/pipeline/datasets/serving/live-recommendations/spark-1.6.1/als/${System.currentTimeMillis}.parquet\")",
      "dateUpdated": "Jun 11, 2016 5:40:56 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1463371290389_-1491857833",
      "id": "20160516-040130_1028627154",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": ""
      },
      "dateCreated": "May 16, 2016 4:01:30 AM",
      "dateStarted": "Jun 11, 2016 5:51:26 AM",
      "dateFinished": "Jun 11, 2016 5:51:30 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "dateUpdated": "Jun 11, 2016 5:40:56 AM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala"
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464665341507_-1919350067",
      "id": "20160531-032901_1479451131",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT"
      },
      "dateCreated": "May 31, 2016 3:29:01 AM",
      "dateStarted": "Jun 11, 2016 5:51:29 AM",
      "dateFinished": "Jun 11, 2016 5:51:30 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    }
  ],
  "name": "Live Recs/02: User-to-Item Collaborative Filter Recs (ALS)",
  "id": "2AUYFSKXN",
  "angularObjects": {
    "2ARR8UZDJ": [],
    "2AS9P7JSA": [],
    "2AR33ZMZJ": []
  },
  "config": {
    "looknfeel": "default"
  },
  "info": {}
}