{
  "paragraphs": [
    {
      "title": "Collaborative Filtering:  Matrix Factorization using Alternating Least Squares (ALS)",
      "text": "%md ![Alternating Least Squares - Matrix Factorization](http://advancedspark.com/img/collaborative-filtering-with-als-matrix-factorization.png)",
      "dateUpdated": "Jun 21, 2016 3:43:16 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "title": true,
        "editorHide": true,
        "editorMode": "ace/mode/markdown",
        "enabled": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1435978153894_1534941045",
      "id": "20150704-024913_884517592",
      "result": {
        "code": "SUCCESS",
        "type": "HTML",
        "msg": "\u003cp\u003e\u003cimg src\u003d\"http://advancedspark.com/img/collaborative-filtering-with-als-matrix-factorization.png\" alt\u003d\"Alternating Least Squares - Matrix Factorization\" /\u003e\u003c/p\u003e\n"
      },
      "dateCreated": "Jul 4, 2015 2:49:13 AM",
      "dateStarted": "Jun 21, 2016 3:43:16 PM",
      "dateFinished": "Jun 21, 2016 3:43:17 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Get Reference Data for Enrichment",
      "text": "val itemsDF \u003d sqlContext.read.format(\"json\")\n  .load(\"file:/root/pipeline/myapps/html/advancedspark.com/json/actors.json\")\n  .withColumnRenamed(\"id\", \"itemId\")\n  .as(\"items\")\n\nz.show(itemsDF.select($\"itemId\", $\"title\", $\"img\", $\"tags\", $\"description\"))",
      "dateUpdated": "Jun 21, 2016 3:43:16 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 175.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "itemId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "title",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "itemId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "title",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456864386968_-1684206029",
      "id": "20160301-203306_1764877860",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "itemId\ttitle\timg\ttags\tdescription\n90001\tLinda Blair\timg/actors/90001.jpg\tSt. Louis, Missouri, United States\tFrom the age of five, Linda Blair had to get used to the spotlight, first as a child model and then as an actress, when out of 600 applicants she was picked for the role of Regan, the possessed child, in The Exorcist. Linda quickly rose to international fame, won the Golden Globe, and seemed to be set to take the Academy Award for that role...\n90002\tShannon Whirry\timg/actors/90002.jpg\tGreen Lake, Wisconsin, United States\tShannon Whirry is not just a talented actress with girl-next-door looks, she captured a generation of viewers\u0027 imaginations by wishing that she actually was the girl-next-door. Born in Green Lake County, Wisconsin, Whirry graduated from high school and packed her bags for New York. She trained at the...\n90003\tRosalind Allen\timg/actors/90003.jpg\tWellington, New Zealand, New Zealand\tRosalind Allen (born Rosalind Ingledew) hails from New Zealand and studied acting there before coming to the United States. Her movie debut was in the film, Perfect, and she continues a long career in television \u0026 film. Famously remembered as the \"It girl\" in the Seinfeld episode, The Marine Biologist...\n90004\tBobbie Phillips\timg/actors/90004.jpg\tSalisbury, North Carolina, United States\tBrains and beauty are two words that have been repeatedly used to describe Bobbie Phillips throughout her career. Graduating high school at 16 years old, Bobbie tried several different career paths. After taking college classes to become a litigation attorney, it was suggested she also take drama classes...\n90005\tKeshia Knight Pulliam\timg/actors/90005.jpg\tNewark, New Jersey, United States\tKeshia Knight Pulliam was born on April 9, 1979 in Newark, New Jersey, USA. She is an actress, known for The Cosby Show (1984), Madea Goes to Jail (2009) and Beauty Shop (2005).\n90006\tTatyana Ali\timg/actors/90006.jpg\tBrooklyn, New York, United States\tOn January 24, 1979, Tatyana Marisol Ali was born to Sonia, who was a nurse from Panama, and Sheriff Ali, a retired police officer from Trinidad. At the age of four she started singing and got a taste of fame when she begged her mother to take her to an audition for Sesame Street. She went on to perform in many productions in her native city...\n90007\tAngell Conwell\timg/actors/90007.jpg\tOrangeburg, South Carolina, United States\tBorn in the tiny town of Orangeburg, South Carolina, Angell Conwell began her journey at a very young age. After winning countless pageants locally, she signed with Wilhelmina\u0027s Kids Division in New York at the age of 10. Angell enjoyed modeling but yearned for more of a challenge. She begged for her parents permission to audition for a role in August Wilson\u0027s highly acclaimed...\n90008\tShannah Laumeister\timg/actors/90008.jpg\tSan Francisco, California, United States\tShannah Laumeister was born on July 23, 1969 in San Francisco, California, USA. She is an actress and director, known for Bullets Over Broadway (1994), Nobody\u0027s Fool (1994) and 61* (2001). She was previously married to Bert Stern.\n90009\tPam Grier\timg/actors/90009.jpg\tWinstom-Salem, North Carolina, United States\tPam Grier was born in Winston-Salem, NC, one of four children of Gwendolyn Sylvia (Samuels), a nurse, and Clarence Ransom Grier Jr., an Air Force mechanic. Pam has been a major African-American star from the early 1970s. Her career started in 1971, when Roger Corman of New World Pictures launched her with The Big Doll House...\n90010\tTiffani Thiessen\timg/actors/90010.jpg\tLong Beach, California, United States\tTiffani-Amber Thiessen was born on January 23, 1974, in Long Beach, California, USA, to Frank Thiessen, a park designer, and Robyn Ernest, a homemaker. She grew up in Long Beach with her parents and her brothers, professional cyclist Todd (b. 1968) and Schuyler (b. 1977). When Tiffani was 8, her uncle...\n90011\tAshley Judd\timg/actors/90011.jpg\tGranada Hills, California, United States\tAshley Judd was born on April 19, 1968 in Granada Hills, California, USA as Ashley Tyler Ciminella. She is an actress and producer, known for Divergent (2014), Heat (1995) and Double Jeopardy (1999). She was previously married to Dario Franchitti.\n90012\tStacey Dash\timg/actors/90012.jpg\tBronx, New York, United States\tStacey Dash was born in the Bronx, New York. Stacy knew that she wanted to act, and from an early age began to act professionally. She made regular appearances on The Cosby Show, The Fresh Prince of Bel-Air, and also St. Elsewhere. At 21 she made her feature film debut in Enemy Territory, which was quickly followed by Moving...\n90013\tSofia Vergara\timg/actors/90013.jpg\tBarranquilla, Atlantico, Colombia\tSofia Margarita Vergara Vergara was born and raised in Barranquilla, Colombia. Her mother, Margarita Vergara Davila de Vergara, is a housewife. Her father, Julio Enrique Vergara Robayo, provides cattle to the meat industry. She has five siblings. She was educated at a private bilingual Spanish/English school...\n90014\tGail O\u0027Grady\timg/actors/90014.jpg\tDetroit, Michigan, United States\tGail O\u0027Grady was born on January 23, 1963 in Detroit, Michigan, USA as Gail Ann O\u0027Grady. She is an actress and producer, known for American Dreams (2002), Deuce Bigalow: Male Gigolo (1999) and NYPD Blue (1993). She was previously married to John Stamatakis, Anthony J Pellegrino, Steve Fenton, Severin Wunderman, Jeffrey Byron and Richard Dasko.\n90015\tBarbara Niven\timg/actors/90015.jpg\tPortland, Oregon, United States\tBarbara Niven was born on February 26, 1953 in Portland, Oregon, USA as Barbara Lee Bucholz. She is an actress and producer, known for A Perfect Ending (2012), Pensacola: Wings of Gold (1997) and The Rat Pack (1998).\n10001\tLeonardo DiCaprio\timg/actors/10001.jpg\tHollywood, California, United States\tFew actors in the world have had a career quite as diverse as Leonardo DiCaprio\u0027s. DiCaprio has gone from relatively humble beginnings, as a supporting cast member of the sitcom Growing Pains and low budget horror movies, such as Critters 3, to a major teenage heartthrob in the 1990s, as the hunky lead actor in movies such as Romeo + Juliet and Titanic...\n10002\tAnthony Hopkins\timg/actors/10002.jpg\tPort Talbot, Glamorgan, Wales\tAnthony Hopkins was born on December 31, 1937, in Margam, Wales, to Muriel Anne (Yeats) and Richard Arthur Hopkins, a baker. His parents were both of half Welsh and half English descent. Influenced by Richard Burton, he decided to study at College of Music and Drama and graduated in 1957. In 1965, he moved to London and joined the National Theatre...\n10003\tAl Pacino\timg/actors/10003.jpg\tManhattan, New York, United States\tOne of the greatest actors in all of film history, Al Pacino established himself during one of film\u0027s greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents...\n10004\tMorgan Freeman\timg/actors/10004.jpg\tMemphis, Tennessee, United States\tWith an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born in June 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended...\n10005\tJames Gandolfini\timg/actors/10005.jpg\tWestwood, New Jersey, United States\tJames Gandolfini was born in Westwood, New Jersey, to Santa (Penna), a high school lunchlady, and James Joseph Gandolfini, Sr., a bricklayer and head school janitor. His parents were both of Italian origin. Gandolfini began acting in the New York theater. His Broadway debut was in the 1992 revival of \"A Streetcar Named Desire\" with Jessica Lange and Alec Baldwin...\n10006\tTom Cruise\timg/actors/10006.jpg\tSyracuse, New York, United States\tIf you had told fourteen-year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not-too-distant future he would be considered one of the top hundred movie stars of all time, he would have probably grinned and told you that his ambition was to become a priest. None the less, this sensitive, deeply religious youngster who...\n10007\tDenzel Washington\timg/actors/10007.jpg\tMount Vernon, New York, United States\tDenzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis (Lowe), from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University...\n10008\tRobert De Niro\timg/actors/10008.jpg\tManhattan, New York, United States\tRobert De Niro, thought of as one of the greatest American actors of all time, was born in New York City, to artists Virginia (Admiral) and Robert De Niro Sr. His paternal grandfather was of Italian descent, and his other ancestry is Irish, Dutch, English, French, and German. He was trained at the Stella Adler Conservatory and the American Workshop...\n10009\tChazz Palminteri\timg/actors/10009.jpg\tBronx, New York, United States\tBronx-born and raised Chazz Palminteri was a natural choice to continue the Italianate torch in film. In the tradition set forth in the 1970s by such icons as director Martin Scorsese and actors Robert De Niro, Al Pacino, John Cazale and Joe Pesci, Palminteri has brought grit, muscle and an evocative realism to the sidewalks of his New York neighborhood...\n10010\tTom Hanks\timg/actors/10010.jpg\tConcord, California, United States\tThomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an itinerant cook. His father had English, and some German, ancestry, while his mother\u0027s family, originally surnamed \"Fraga\", was entirely Portuguese. Tom grew up in what he has called a \"fractured\" family...\n10011\tJohn Travolta\timg/actors/10011.jpg\tEnglewood, New York, United States\tJohn Travolta was born in Englewood, New Jersey, one of six children of Helen Travolta Helen Cecilia Burke) and Salvatore Travolta. His father was of Italian descent and his mother was of Irish ancestry. His father owned a tire repair shop called Travolta Tires in Hillsdale, NJ. Travolta appeared in a local production of \"Who\u0027ll Save the Plowboy?\"...\n10012\tJohnny Depp\timg/actors/10012.jpg\tOwensboro, Kentucky, United States\tJohnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15...\n10013\tMark Wahlberg\timg/actors/10013.jpg\tBoston, Massachusetts, United States\tAmerican actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to respected actor. A Best Supporting Actor Oscar nominee for The Departed who went on to receive positive critical reviews for his performance in The Fighter, Wahlberg also is a solid comedy actor, proven by his starring role in Ted...\n10014\tJames Franco\timg/actors/10014.jpg\tPalo Alto, California, United States\tKnown for his breakthrough starring role on Freaks and Geeks, James Franco was born in Palo Alto, California on April 19, 1978. His mother, Betsy Franco, is Jewish, and his father, Douglas Eugene \"Doug\" Franco, was of Portuguese and Swedish descent, and ran a Silicon Valley business. James\u0027s mother, a writer, has occasionally acted...\n10015\tClive Owen\timg/actors/10015.jpg\tCoventry, Warwickshire, England\tDarkly handsome British actor Clive Owen is one of a handful of stars best known for his art house films but how has handle more mainstream action films lately with equal measures of grace and skill. Owen typically is cast as characters whose primary traits are a balance of physical strength, intellect...\n"
      },
      "dateCreated": "Mar 1, 2016 8:33:06 PM",
      "dateStarted": "Jun 21, 2016 3:43:17 PM",
      "dateFinished": "Jun 21, 2016 3:43:18 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Get Live Ratings from Cassandra",
      "text": "val cassandraConfig \u003d Map(\"keyspace\" -\u003e \"advancedspark\", \"table\" -\u003e \"item_ratings\")\n\nval itemRatingsDF \u003d sqlContext.read.format(\"org.apache.spark.sql.cassandra\")\n  .options(cassandraConfig)\n  .load()\n  .select($\"userid\", $\"itemid\", $\"rating\", $\"timestamp\")\n  .withColumnRenamed(\"userid\", \"userId\")\n  .withColumnRenamed(\"itemid\", \"itemId\")\n  .as(\"itemRatings\")\n  \nz.show(itemRatingsDF.sort($\"userId\" asc))",
      "dateUpdated": "Jun 21, 2016 3:43:17 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 294.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456864425764_-1117794352",
      "id": "20160301-203345_1180596367",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\titemId\trating\ttimestamp\n666\t90004\t1.0\t1466172314000\n666\t10014\t1.0\t1466172322000\n666\t90010\t1.0\t1466172310000\n666\t90013\t1.0\t1466172318000\n666\t10013\t1.0\t1466172320000\n666\t10015\t1.0\t1466172322000\n671\t10010\t1.0\t1466172312000\n671\t10012\t1.0\t1466172310000\n671\t90006\t1.0\t1466172304000\n671\t90011\t1.0\t1466172306000\n671\t90014\t1.0\t1466172302000\n671\t10006\t1.0\t1466172308000\n2708\t10004\t1.0\t1466259490000\n2708\t10007\t1.0\t1466259496000\n2708\t90001\t1.0\t1466259478000\n2879\t10010\t1.0\t1466259456000\n2879\t10015\t1.0\t1466259450000\n2879\t10007\t1.0\t1466259466000\n5980\t10002\t1.0\t1466100186000\n5980\t10012\t1.0\t1466100190000\n5980\t90010\t1.0\t1466100182000\n5980\t90011\t1.0\t1466100210000\n5980\t10001\t1.0\t1466100186000\n5980\t90014\t1.0\t1466100222000\n5983\t90007\t1.0\t1466259458000\n5983\t90015\t1.0\t1466265952000\n5983\t10005\t1.0\t1466265950000\n5983\t10011\t1.0\t1466259474000\n5983\t10010\t1.0\t1466265938000\n5983\t10012\t1.0\t1466259472000\n5983\t10013\t1.0\t1466259470000\n5983\t90005\t1.0\t1466259456000\n5983\t90006\t1.0\t1466259458000\n7467\t90011\t1.0\t1466259632000\n7467\t90012\t1.0\t1466259636000\n7467\t90013\t1.0\t1466259634000\n7726\t10015\t1.0\t1466259588000\n7726\t90002\t1.0\t1466259572000\n7726\t90010\t1.0\t1466259568000\n7726\t90013\t1.0\t1466259558000\n7726\t10010\t1.0\t1466259518000\n7726\t10007\t1.0\t1466259544000\n9040\t10012\t1.0\t1466259468000\n9040\t10014\t1.0\t1466259476000\n9040\t90007\t1.0\t1466259502000\n9040\t90012\t1.0\t1466259460000\n9040\t10003\t1.0\t1466259466000\n9040\t90014\t1.0\t1466259494000\n9773\t10010\t1.0\t1466259488000\n9773\t10012\t1.0\t1466259446000\n9773\t90003\t1.0\t1466259460000\n9773\t90010\t1.0\t1466259462000\n9773\t90011\t1.0\t1466259460000\n9773\t10006\t1.0\t1466259444000\n9773\t10007\t1.0\t1466259448000\n10198\t90009\t1.0\t1466265520000\n10198\t90013\t1.0\t1466259454000\n10198\t90012\t1.0\t1466265506000\n10198\t10001\t1.0\t1466259470000\n10198\t90011\t1.0\t1466265506000\n10198\t10002\t1.0\t1466259472000\n10198\t10007\t1.0\t1466259458000\n10198\t10004\t1.0\t1466259456000\n10198\t90001\t1.0\t1466259448000\n10198\t90004\t1.0\t1466259450000\n10198\t90008\t1.0\t1466265520000\n10469\t90003\t1.0\t1466259482000\n10469\t90008\t1.0\t1466259486000\n10469\t10007\t1.0\t1466259470000\n10469\t10014\t1.0\t1466259454000\n10469\t90009\t1.0\t1466259456000\n10469\t10004\t1.0\t1466259464000\n10921\t10010\t1.0\t1466172716000\n10921\t90005\t1.0\t1466172704000\n10921\t90012\t1.0\t1466172704000\n10921\t90013\t1.0\t1466172706000\n10921\t90015\t1.0\t1466172800000\n10921\t10007\t1.0\t1466172722000\n10921\t10009\t1.0\t1466172718000\n11905\t10010\t1.0\t1466259460000\n11905\t10013\t1.0\t1466259458000\n11905\t90014\t1.0\t1466259444000\n11905\t90012\t1.0\t1466259442000\n11905\t90013\t1.0\t1466259450000\n11905\t10006\t1.0\t1466259452000\n13397\t90010\t1.0\t1466178878000\n13397\t10002\t1.0\t1466178884000\n13397\t90013\t1.0\t1466178880000\n13397\t10004\t1.0\t1466178884000\n13397\t90014\t1.0\t1466178880000\n13397\t10014\t1.0\t1466178890000\n13397\t10015\t1.0\t1466178890000\n14806\t10006\t1.0\t1466523786000\n14806\t10007\t1.0\t1466523786000\n14806\t90004\t1.0\t1466523788000\n14806\t10013\t1.0\t1466523786000\n14806\t90003\t1.0\t1466523788000\n14806\t90010\t1.0\t1466523790000\n14806\t90009\t1.0\t1466523790000\n14806\t90015\t1.0\t1466523790000\n14806\t10001\t1.0\t1466523790000\n14806\t10012\t1.0\t1466523786000\n17802\t90013\t1.0\t1466270700000\n17802\t10001\t1.0\t1466270706000\n17802\t10006\t1.0\t1466270706000\n17802\t90014\t1.0\t1466270702000\n17802\t10013\t1.0\t1466270710000\n17802\t90010\t1.0\t1466270692000\n17928\t90011\t1.0\t1466259790000\n18910\t10012\t1.0\t1466259466000\n18910\t10010\t1.0\t1466259464000\n18910\t10013\t1.0\t1466259498000\n18910\t90001\t1.0\t1466259454000\n18910\t90004\t1.0\t1466259494000\n18910\t90005\t1.0\t1466259460000\n18910\t90011\t1.0\t1466259454000\n18910\t10001\t1.0\t1466259446000\n18910\t10004\t1.0\t1466259448000\n18910\t10006\t1.0\t1466259474000\n19149\t90001\t1.0\t1466172712000\n19149\t90002\t1.0\t1466172712000\n19149\t10006\t1.0\t1466172726000\n19149\t10007\t1.0\t1466172724000\n19149\t10008\t1.0\t1466172716000\n19149\t90003\t1.0\t1466172712000\n19186\t10004\t1.0\t1466259456000\n19186\t10013\t1.0\t1466259466000\n19186\t90014\t1.0\t1466259444000\n19186\t90006\t1.0\t1466259448000\n19186\t90011\t1.0\t1466259452000\n19186\t10010\t1.0\t1466259468000\n19829\t90012\t1.0\t1466259694000\n19829\t90013\t1.0\t1466259696000\n19829\t90014\t1.0\t1466259696000\n19901\t90002\t1.0\t1466172288000\n19901\t90003\t1.0\t1466172286000\n19901\t90015\t1.0\t1466172290000\n19901\t90004\t1.0\t1466172286000\n19901\t90012\t1.0\t1466172276000\n20269\t90011\t1.0\t1466270292000\n20269\t90007\t1.0\t1466270294000\n20269\t90013\t1.0\t1466259450000\n20269\t90004\t1.0\t1466259464000\n20269\t90003\t1.0\t1466270328000\n20599\t90003\t1.0\t1466259490000\n20599\t90004\t1.0\t1466259492000\n20599\t90006\t1.0\t1466259500000\n20599\t10006\t1.0\t1466259460000\n20599\t10007\t1.0\t1466259472000\n20599\t10015\t1.0\t1466259464000\n20599\t10001\t1.0\t1466259484000\n21141\t10002\t1.0\t1466099810000\n21141\t10003\t1.0\t1466099812000\n21141\t10004\t1.0\t1466099812000\n21141\t90001\t1.0\t1466099800000\n21141\t90002\t1.0\t1466099802000\n21141\t90003\t1.0\t1466099804000\n21423\t90007\t1.0\t1466259462000\n21423\t10006\t1.0\t1466259468000\n21423\t10010\t1.0\t1466259472000\n21423\t90003\t1.0\t1466259460000\n21423\t10012\t1.0\t1466259470000\n21423\t90001\t1.0\t1466259458000\n21619\t90001\t1.0\t1465049312000\n21619\t90013\t1.0\t1465049314000\n21619\t90015\t1.0\t1465049314000\n21619\t10014\t1.0\t1465049318000\n21619\t10012\t1.0\t1465049318000\n21619\t10013\t1.0\t1465049318000\n22945\t90011\t1.0\t1466172750000\n22945\t90013\t1.0\t1466172750000\n22945\t90014\t1.0\t1466172748000\n22945\t10012\t1.0\t1466172754000\n22945\t10013\t1.0\t1466172754000\n22945\t10009\t1.0\t1466172752000\n23393\t10003\t1.0\t1466259446000\n23393\t90006\t1.0\t1466259442000\n23393\t90007\t1.0\t1466259444000\n23393\t90008\t1.0\t1466259444000\n23393\t10001\t1.0\t1466259444000\n23393\t10002\t1.0\t1466259446000\n23983\t90011\t1.0\t1466259482000\n23983\t90008\t1.0\t1466259464000\n23983\t90002\t1.0\t1466259454000\n24600\t10002\t1.0\t1466172744000\n24600\t10001\t1.0\t1466172714000\n24600\t10011\t1.0\t1466172752000\n24600\t90003\t1.0\t1466172754000\n24600\t90004\t1.0\t1466172756000\n24600\t90006\t1.0\t1466172758000\n25094\t10014\t1.0\t1466172736000\n25094\t90004\t1.0\t1466172756000\n25094\t90013\t1.0\t1466172764000\n25094\t90009\t1.0\t1466172760000\n25094\t90012\t1.0\t1466172748000\n25094\t10004\t1.0\t1466172724000\n25094\t10007\t1.0\t1466172746000\n25237\t90014\t1.0\t1466172804000\n25237\t10008\t1.0\t1466172820000\n25237\t10012\t1.0\t1466172826000\n25237\t90012\t1.0\t1466172806000\n25237\t10015\t1.0\t1466172824000\n25237\t90011\t1.0\t1466172814000\n25475\t90014\t1.0\t1466172278000\n25475\t90002\t1.0\t1466172294000\n25475\t90013\t1.0\t1466172300000\n27981\t10007\t1.0\t1465047836000\n27981\t10008\t1.0\t1465047836000\n27981\t90011\t1.0\t1465047834000\n27981\t90009\t1.0\t1465047834000\n27981\t90010\t1.0\t1465047834000\n27981\t10006\t1.0\t1465047836000\n28024\t90006\t1.0\t1466100196000\n28024\t90007\t1.0\t1466100196000\n28024\t10001\t1.0\t1466100176000\n28024\t90003\t1.0\t1466100194000\n28024\t10004\t1.0\t1466100192000\n28024\t10006\t1.0\t1466100188000\n28865\t10007\t1.0\t1466100066000\n28865\t90004\t1.0\t1466100094000\n28865\t90009\t1.0\t1466100092000\n28865\t90011\t1.0\t1466100082000\n28865\t10003\t1.0\t1466100158000\n28865\t10001\t1.0\t1466100062000\n29428\t10001\t1.0\t1466260446000\n29428\t10006\t1.0\t1466260446000\n29428\t10014\t1.0\t1466260450000\n30205\t10014\t1.0\t1466172772000\n30205\t90011\t1.0\t1466172782000\n30205\t90013\t1.0\t1466172750000\n30205\t10010\t1.0\t1466172788000\n30205\t10001\t1.0\t1466172788000\n30205\t10006\t1.0\t1466172754000\n30699\t10001\t1.0\t1466091806000\n30699\t90011\t1.0\t1466091806000\n30701\t90010\t1.0\t1466259486000\n30701\t90011\t1.0\t1466259486000\n30701\t90013\t1.0\t1466259462000\n30701\t10008\t1.0\t1466259498000\n30701\t10001\t1.0\t1466259488000\n30701\t10003\t1.0\t1466259490000\n31604\t10010\t1.0\t1466259746000\n31604\t90011\t1.0\t1466259738000\n31604\t10004\t1.0\t1466259744000\n31604\t90013\t1.0\t1466259740000\n31604\t90014\t1.0\t1466259740000\n31604\t10006\t1.0\t1466259742000\n32831\t90012\t1.0\t1466259694000\n32831\t10005\t1.0\t1466259696000\n32831\t90013\t1.0\t1466259644000\n32831\t90014\t1.0\t1466259694000\n32831\t10006\t1.0\t1466259696000\n32831\t10007\t1.0\t1466259696000\n32940\t90012\t1.0\t1466100192000\n32940\t10015\t1.0\t1466100182000\n32940\t90013\t1.0\t1466100192000\n32940\t90015\t1.0\t1466100194000\n32940\t10005\t1.0\t1466100186000\n32940\t10007\t1.0\t1466100188000\n34091\t10011\t1.0\t1466260422000\n34091\t90002\t1.0\t1466260382000\n34091\t10014\t1.0\t1466260396000\n34091\t10004\t1.0\t1466260388000\n34091\t10012\t1.0\t1466260406000\n34091\t90008\t1.0\t1466260400000\n34091\t90011\t1.0\t1466260392000\n34091\t90009\t1.0\t1466260436000\n34091\t90012\t1.0\t1466260398000\n34091\t10005\t1.0\t1466260416000\n34091\t10003\t1.0\t1466260404000\n34615\t90002\t1.0\t1466092112000\n34615\t10014\t1.0\t1466092102000\n34615\t90011\t1.0\t1466092108000\n34615\t90014\t1.0\t1466092112000\n34615\t10006\t1.0\t1466092100000\n34615\t10012\t1.0\t1466092104000\n34638\t90013\t1.0\t1466259600000\n34638\t10008\t1.0\t1466259604000\n34638\t10004\t1.0\t1466259614000\n34638\t90004\t1.0\t1466259596000\n34638\t10014\t1.0\t1466259604000\n34638\t90003\t1.0\t1466259598000\n34643\t10006\t1.0\t1466091870000\n34643\t90011\t1.0\t1466091880000\n34830\t90013\t1.0\t1466259450000\n34830\t10010\t1.0\t1466259472000\n34830\t10004\t1.0\t1466259498000\n34830\t90011\t1.0\t1466259484000\n34830\t10012\t1.0\t1466259472000\n34830\t90004\t1.0\t1466259466000\n34902\t10007\t1.0\t1466270294000\n35215\t10004\t1.0\t1466259922000\n35215\t10003\t1.0\t1466259918000\n35215\t10005\t1.0\t1466259922000\n35215\t10007\t1.0\t1466259468000\n35215\t10009\t1.0\t1466259460000\n35215\t90001\t1.0\t1466259912000\n35215\t10013\t1.0\t1466259472000\n35215\t90003\t1.0\t1466259914000\n35215\t90008\t1.0\t1466259916000\n35215\t90011\t1.0\t1466259920000\n35215\t10006\t1.0\t1466259922000\n35215\t10008\t1.0\t1466259926000\n35215\t10010\t1.0\t1466259458000\n35215\t10011\t1.0\t1466259928000\n35215\t10012\t1.0\t1466259928000\n35215\t10015\t1.0\t1466259926000\n35215\t90002\t1.0\t1466259912000\n35215\t90004\t1.0\t1466259914000\n35215\t90005\t1.0\t1466259916000\n35215\t90006\t1.0\t1466259916000\n35215\t90007\t1.0\t1466259916000\n35215\t90009\t1.0\t1466259918000\n35215\t90010\t1.0\t1466259482000\n35215\t90012\t1.0\t1466259454000\n35215\t90013\t1.0\t1466259456000\n35215\t90014\t1.0\t1466259826000\n35215\t90015\t1.0\t1466259918000\n35215\t10001\t1.0\t1466259828000\n35215\t10002\t1.0\t1466259918000\n35574\t90012\t1.0\t1466172710000\n35574\t10008\t1.0\t1466172748000\n35574\t90011\t1.0\t1466172722000\n35574\t10012\t1.0\t1466172758000\n35574\t90010\t1.0\t1466172718000\n35574\t10004\t1.0\t1466172726000\n35574\t10002\t1.0\t1466172752000\n35851\t10012\t1.0\t1466259476000\n35851\t90010\t1.0\t1466259472000\n35851\t10001\t1.0\t1466259480000\n35851\t90004\t1.0\t1466259464000\n35851\t90011\t1.0\t1466259460000\n35851\t10010\t1.0\t1466259476000\n36401\t10010\t1.0\t1466100122000\n36401\t10009\t1.0\t1466100122000\n36401\t90007\t1.0\t1466100118000\n36401\t90005\t1.0\t1466100116000\n36401\t90006\t1.0\t1466100116000\n36401\t10008\t1.0\t1466100122000\n37597\t90009\t1.0\t1466259464000\n37597\t10006\t1.0\t1466259498000\n37597\t90011\t1.0\t1466259460000\n37597\t90004\t1.0\t1466259456000\n37597\t10010\t1.0\t1466259444000\n37597\t10015\t1.0\t1466259448000\n38808\t90005\t1.0\t1466100044000\n38808\t90006\t1.0\t1466100044000\n38808\t10013\t1.0\t1466100050000\n38808\t90007\t1.0\t1466100044000\n38808\t10012\t1.0\t1466100048000\n38808\t10011\t1.0\t1466100048000\n39043\t90010\t1.0\t1466171658000\n39043\t10007\t1.0\t1466171664000\n39043\t90002\t1.0\t1466171656000\n39043\t90011\t1.0\t1466171658000\n39043\t10008\t1.0\t1466171664000\n39043\t10009\t1.0\t1466171664000\n39819\t10012\t1.0\t1466100092000\n39819\t90004\t1.0\t1466100536000\n39819\t90013\t1.0\t1466100066000\n39819\t10001\t1.0\t1466100060000\n39819\t90003\t1.0\t1466100534000\n39819\t90005\t1.0\t1466100536000\n39819\t90007\t1.0\t1466100180000\n39819\t90010\t1.0\t1466100174000\n39819\t90015\t1.0\t1466100064000\n39819\t10007\t1.0\t1466100056000\n39819\t10004\t1.0\t1466100070000\n39819\t10006\t1.0\t1466100054000\n40429\t10015\t1.0\t1466259480000\n40429\t10003\t1.0\t1466259464000\n40429\t10014\t1.0\t1466259486000\n40429\t10002\t1.0\t1466259456000\n40429\t90006\t1.0\t1466259454000\n40429\t90012\t1.0\t1466259452000\n40429\t10013\t1.0\t1466259466000\n40429\t10005\t1.0\t1466259486000\n40429\t10009\t1.0\t1466259624000\n41802\t90004\t1.0\t1466259456000\n41802\t10010\t1.0\t1466259468000\n41802\t90014\t1.0\t1466259448000\n41802\t10008\t1.0\t1466259464000\n41802\t10005\t1.0\t1466259458000\n41802\t90015\t1.0\t1466259454000\n42197\t90012\t1.0\t1466303826000\n42197\t10006\t1.0\t1466303824000\n42197\t10005\t1.0\t1466303824000\n42474\t90012\t1.0\t1466172202000\n42474\t10006\t1.0\t1466172222000\n42474\t90013\t1.0\t1466172198000\n42474\t90010\t1.0\t1466172194000\n42474\t10012\t1.0\t1466172220000\n42474\t10014\t1.0\t1466172220000\n43016\t90002\t1.0\t1466259470000\n43016\t10010\t1.0\t1466259478000\n43016\t90004\t1.0\t1466259466000\n43016\t90001\t1.0\t1466259464000\n43016\t10007\t1.0\t1466259482000\n43016\t10004\t1.0\t1466259476000\n43026\t90010\t1.0\t1466259494000\n43026\t10001\t1.0\t1466259488000\n43026\t90004\t1.0\t1466259502000\n43026\t90012\t1.0\t1466259458000\n43026\t10007\t1.0\t1466259470000\n43026\t10011\t1.0\t1466259518000\n43287\t90007\t1.0\t1466172216000\n43287\t10009\t1.0\t1466172714000\n43287\t90004\t1.0\t1466172712000\n44433\t10010\t1.0\t1466259496000\n44433\t90010\t1.0\t1466259492000\n44433\t90015\t1.0\t1466259462000\n44433\t10008\t1.0\t1466259504000\n44433\t90011\t1.0\t1466259490000\n44433\t10004\t1.0\t1466259494000\n44807\t10008\t1.0\t1466259552000\n44807\t10002\t1.0\t1466259550000\n44807\t10013\t1.0\t1466259558000\n44807\t90006\t1.0\t1466259546000\n44954\t10001\t1.0\t1466091704000\n44954\t90011\t1.0\t1466091714000\n45486\t90012\t1.0\t1466172268000\n45486\t90005\t1.0\t1466172272000\n45929\t10012\t1.0\t1466259706000\n45929\t10014\t1.0\t1466259708000\n45929\t90007\t1.0\t1466259526000\n45929\t90005\t1.0\t1466259468000\n45929\t10005\t1.0\t1466259712000\n45929\t10013\t1.0\t1466259706000\n45929\t10015\t1.0\t1466259710000\n45929\t90001\t1.0\t1466259444000\n45929\t90004\t1.0\t1466259454000\n45929\t90008\t1.0\t1466259532000\n45929\t90010\t1.0\t1466259530000\n45929\t90009\t1.0\t1466259530000\n45929\t90011\t1.0\t1466259450000\n45929\t10010\t1.0\t1466259700000\n45929\t10011\t1.0\t1466259704000\n45929\t10004\t1.0\t1466259712000\n46843\t10007\t1.0\t1466100180000\n46843\t10006\t1.0\t1466100180000\n46843\t10009\t1.0\t1466100188000\n46843\t10013\t1.0\t1466100236000\n46843\t10012\t1.0\t1466100234000\n46843\t10014\t1.0\t1466100236000\n46843\t90004\t1.0\t1466100176000\n46843\t90005\t1.0\t1466100178000\n46843\t10001\t1.0\t1466100134000\n46843\t10005\t1.0\t1466100180000\n47366\t90010\t1.0\t1466307430000\n47948\t10008\t1.0\t1466259476000\n47948\t90013\t1.0\t1466259460000\n47948\t90001\t1.0\t1466259458000\n47948\t90011\t1.0\t1466259452000\n47948\t10004\t1.0\t1466259478000\n47948\t10003\t1.0\t1466259484000\n49153\t10005\t1.0\t1466259608000\n49153\t10007\t1.0\t1466259474000\n49153\t90005\t1.0\t1466259598000\n49153\t90007\t1.0\t1466259598000\n49153\t10004\t1.0\t1466259472000\n49153\t10006\t1.0\t1466259474000\n49153\t90001\t1.0\t1466259480000\n49153\t90003\t1.0\t1466259598000\n49153\t90006\t1.0\t1466259596000\n49153\t90011\t1.0\t1466259620000\n49153\t90013\t1.0\t1466259480000\n49153\t90014\t1.0\t1466259478000\n49153\t90002\t1.0\t1466259600000\n49153\t90015\t1.0\t1466259478000\n49153\t10003\t1.0\t1466259468000\n49153\t10001\t1.0\t1466259468000\n49153\t10002\t1.0\t1466259468000\n49906\t90004\t1.0\t1466259474000\n49906\t90014\t1.0\t1466259458000\n49906\t90011\t1.0\t1466259454000\n49992\t90002\t1.0\t1466259506000\n49992\t90013\t1.0\t1466259498000\n49992\t10001\t1.0\t1466259520000\n49992\t90010\t1.0\t1466259512000\n49992\t10002\t1.0\t1466259520000\n49992\t10004\t1.0\t1466259518000\n50171\t10007\t1.0\t1466172736000\n50171\t90013\t1.0\t1466172708000\n50171\t90006\t1.0\t1466172718000\n50171\t90010\t1.0\t1466172730000\n50171\t10006\t1.0\t1466172750000\n50171\t10004\t1.0\t1466172732000\n52654\t10013\t1.0\t1466259456000\n52654\t90010\t1.0\t1466259476000\n52654\t10006\t1.0\t1466259454000\n52654\t90001\t1.0\t1466259464000\n52654\t90011\t1.0\t1466259478000\n52654\t10009\t1.0\t1466259474000\n53395\t10004\t1.0\t1466259474000\n53395\t90005\t1.0\t1466259490000\n53395\t10007\t1.0\t1466259460000\n53395\t10001\t1.0\t1466259486000\n53395\t90004\t1.0\t1466259490000\n53395\t90009\t1.0\t1466259476000\n53395\t10008\t1.0\t1466259456000\n53395\t10014\t1.0\t1466259474000\n53395\t90007\t1.0\t1466259450000\n53758\t90007\t1.0\t1466270860000\n53758\t90008\t1.0\t1466270872000\n53758\t90004\t1.0\t1466270806000\n53758\t90009\t1.0\t1466270870000\n53758\t90003\t1.0\t1466270868000\n53758\t90006\t1.0\t1466270810000\n53758\t90010\t1.0\t1466270808000\n53817\t90001\t1.0\t1466259448000\n53817\t90011\t1.0\t1466259456000\n53817\t90010\t1.0\t1466259448000\n53980\t90011\t1.0\t1466259450000\n53980\t10015\t1.0\t1466259456000\n53980\t90004\t1.0\t1466259448000\n53980\t10014\t1.0\t1466259454000\n53980\t10006\t1.0\t1466259454000\n53980\t90010\t1.0\t1466259450000\n53980\t10007\t1.0\t1466259478000\n54570\t10015\t1.0\t1466259530000\n54570\t90005\t1.0\t1466259526000\n54570\t90010\t1.0\t1466259504000\n54570\t10010\t1.0\t1466259460000\n54570\t10013\t1.0\t1466259484000\n54570\t10009\t1.0\t1466259538000\n55425\t10013\t1.0\t1466259460000\n55425\t90010\t1.0\t1466259452000\n55425\t90011\t1.0\t1466259450000\n55425\t10001\t1.0\t1466259456000\n55425\t90014\t1.0\t1466259454000\n55425\t10010\t1.0\t1466259458000\n56770\t10001\t1.0\t1466259470000\n56770\t90012\t1.0\t1466259452000\n56770\t10009\t1.0\t1466259464000\n56770\t90011\t1.0\t1466259454000\n56770\t10013\t1.0\t1466259462000\n56770\t90007\t1.0\t1466259452000\n57052\t10011\t1.0\t1466259554000\n57052\t10012\t1.0\t1466259554000\n57052\t90001\t1.0\t1466259396000\n57052\t90004\t1.0\t1466259548000\n57052\t90002\t1.0\t1466259396000\n57052\t10008\t1.0\t1466259402000\n57052\t90006\t1.0\t1466259550000\n57052\t90003\t1.0\t1466259398000\n57052\t10009\t1.0\t1466259400000\n57052\t10001\t1.0\t1466259400000\n57052\t90005\t1.0\t1466259550000\n57052\t10010\t1.0\t1466259554000\n57462\t10010\t1.0\t1466092054000\n57462\t10012\t1.0\t1466092066000\n57462\t10013\t1.0\t1466092082000\n57462\t10003\t1.0\t1466092056000\n57462\t10014\t1.0\t1466092050000\n57462\t10006\t1.0\t1466092024000\n57462\t10001\t1.0\t1466092046000\n57462\t90011\t1.0\t1466092060000\n57606\t90004\t1.0\t1466261086000\n57606\t90008\t1.0\t1466261048000\n57606\t10006\t1.0\t1466261056000\n57606\t90010\t1.0\t1466261044000\n57606\t10012\t1.0\t1466261070000\n57606\t10005\t1.0\t1466261054000\n57606\t10003\t1.0\t1466261080000\n57606\t90013\t1.0\t1466261046000\n57606\t10013\t1.0\t1466261074000\n57606\t10004\t1.0\t1466261056000\n58436\t10012\t1.0\t1466259474000\n58436\t10014\t1.0\t1466259478000\n58436\t90010\t1.0\t1466259500000\n58436\t90013\t1.0\t1466259486000\n58436\t90015\t1.0\t1466259492000\n58436\t10005\t1.0\t1466259468000\n59047\t90004\t1.0\t1466259522000\n59047\t90011\t1.0\t1466259446000\n59047\t10013\t1.0\t1466259474000\n59047\t90013\t1.0\t1466259446000\n59047\t10014\t1.0\t1466259456000\n59047\t10006\t1.0\t1466259494000\n59047\t90014\t1.0\t1466259450000\n59047\t90002\t1.0\t1466259524000\n59047\t10002\t1.0\t1466259460000\n60009\t10010\t1.0\t1466274006000\n60009\t10011\t1.0\t1466274006000\n60009\t10012\t1.0\t1466274008000\n60009\t10008\t1.0\t1466274006000\n60009\t10013\t1.0\t1466274010000\n60009\t10009\t1.0\t1466274006000\n60365\t10004\t1.0\t1466172722000\n60365\t10008\t1.0\t1466172720000\n60365\t90013\t1.0\t1466172706000\n60365\t90004\t1.0\t1466172716000\n60365\t90010\t1.0\t1466172706000\n60365\t10002\t1.0\t1466172718000\n60555\t90002\t1.0\t1466263380000\n60555\t10005\t1.0\t1466260452000\n60555\t90010\t1.0\t1466263402000\n60555\t90001\t1.0\t1466263340000\n60555\t10014\t1.0\t1466260450000\n60555\t10015\t1.0\t1466260450000\n61945\t90005\t1.0\t1466100112000\n61945\t90006\t1.0\t1466100112000\n61945\t90007\t1.0\t1466100112000\n61945\t10011\t1.0\t1466100100000\n61945\t10007\t1.0\t1466100108000\n61945\t10004\t1.0\t1466100164000\n61945\t10005\t1.0\t1466100162000\n61982\t90014\t1.0\t1466259460000\n61982\t90015\t1.0\t1466259460000\n61982\t10007\t1.0\t1466259466000\n61982\t10008\t1.0\t1466259466000\n61982\t10001\t1.0\t1466259462000\n61982\t10009\t1.0\t1466259464000\n62431\t90012\t1.0\t1466261078000\n62554\t10008\t1.0\t1466259736000\n62554\t90002\t1.0\t1466259456000\n62554\t90006\t1.0\t1466259452000\n62554\t10003\t1.0\t1466259730000\n62554\t90014\t1.0\t1466259456000\n62554\t10006\t1.0\t1466259730000\n62948\t10008\t1.0\t1466259802000\n62948\t10006\t1.0\t1466259796000\n63041\t90004\t1.0\t1466260508000\n63041\t90011\t1.0\t1466260504000\n63041\t10006\t1.0\t1466260512000\n63041\t90013\t1.0\t1466260504000\n63041\t10010\t1.0\t1466260512000\n63041\t10015\t1.0\t1466260514000\n64121\t10001\t1.0\t1466259478000\n64121\t10004\t1.0\t1466259474000\n64121\t10012\t1.0\t1466259480000\n64121\t90006\t1.0\t1466259492000\n64121\t90012\t1.0\t1466259494000\n64121\t90009\t1.0\t1466259488000\n64121\t90011\t1.0\t1466259506000\n64504\t10013\t1.0\t1466172740000\n64504\t90004\t1.0\t1466172716000\n64504\t10001\t1.0\t1466172734000\n64504\t10006\t1.0\t1466172732000\n64504\t90010\t1.0\t1466172712000\n64504\t90013\t1.0\t1466172708000\n65336\t10007\t1.0\t1466259466000\n65336\t90010\t1.0\t1466259458000\n65336\t10013\t1.0\t1466259472000\n65336\t90011\t1.0\t1466259454000\n65336\t90008\t1.0\t1466259484000\n65336\t90002\t1.0\t1466259454000\n65336\t90013\t1.0\t1466259462000\n65336\t90004\t1.0\t1466259480000\n66348\t90015\t1.0\t1466099670000\n66348\t90013\t1.0\t1466099668000\n66348\t90014\t1.0\t1466099670000\n66348\t10012\t1.0\t1466099672000\n66348\t10010\t1.0\t1466099670000\n66348\t10011\t1.0\t1466099672000\n66907\t90008\t1.0\t1466259994000\n66907\t90013\t1.0\t1466259996000\n66907\t10010\t1.0\t1466259952000\n66907\t10015\t1.0\t1466259986000\n66907\t10007\t1.0\t1466259962000\n66907\t90004\t1.0\t1466259990000\n67581\t90001\t1.0\t1466283436000\n67581\t90002\t1.0\t1466283436000\n67581\t90003\t1.0\t1466283436000\n68641\t90004\t1.0\t1466177106000\n68641\t90005\t1.0\t1466177106000\n68641\t90006\t1.0\t1466177106000\n68641\t90013\t1.0\t1466177108000\n68641\t10008\t1.0\t1466177108000\n68641\t10011\t1.0\t1466177110000\n68641\t10009\t1.0\t1466177108000\n68641\t10010\t1.0\t1466177108000\n68754\t90010\t1.0\t1466100186000\n68754\t90009\t1.0\t1466100158000\n68962\t90004\t1.0\t1466341826000\n68962\t10006\t1.0\t1466341838000\n68962\t90010\t1.0\t1466341836000\n68962\t90002\t1.0\t1466341834000\n68962\t10013\t1.0\t1466341840000\n68962\t10015\t1.0\t1466341838000\n69265\t90010\t1.0\t1466391672000\n69265\t90011\t1.0\t1466391672000\n69278\t90013\t1.0\t1466436134000\n69278\t10001\t1.0\t1466436122000\n69278\t90014\t1.0\t1466436140000\n69278\t90010\t1.0\t1466436136000\n69278\t10006\t1.0\t1466436126000\n69278\t10012\t1.0\t1466436130000\n69971\t90006\t1.0\t1466185942000\n69971\t90003\t1.0\t1466185940000\n69971\t90004\t1.0\t1466185942000\n69971\t90005\t1.0\t1466185942000\n70281\t90006\t1.0\t1466103828000\n70370\t10004\t1.0\t1466172720000\n70370\t10008\t1.0\t1466172724000\n70370\t10015\t1.0\t1466172718000\n70370\t90007\t1.0\t1466172740000\n70370\t90010\t1.0\t1466172702000\n70370\t90013\t1.0\t1466172706000\n70370\t90014\t1.0\t1466172708000\n71084\t10007\t1.0\t1466259472000\n71084\t10008\t1.0\t1466259472000\n71084\t90013\t1.0\t1466259504000\n71084\t90002\t1.0\t1466259508000\n71084\t90004\t1.0\t1466259506000\n71084\t10001\t1.0\t1466259488000\n72604\t90012\t1.0\t1466171586000\n72604\t10007\t1.0\t1466171602000\n72604\t90013\t1.0\t1466171586000\n72604\t90007\t1.0\t1466171596000\n72604\t10008\t1.0\t1466171600000\n72604\t10010\t1.0\t1466171600000\n72875\t90008\t1.0\t1466100084000\n72875\t90015\t1.0\t1466100090000\n72875\t10012\t1.0\t1466100056000\n72875\t90003\t1.0\t1466100094000\n72875\t10010\t1.0\t1466100058000\n72875\t10002\t1.0\t1466100050000\n72996\t10014\t1.0\t1466172732000\n72996\t90011\t1.0\t1466172754000\n72996\t10001\t1.0\t1466172726000\n72996\t90014\t1.0\t1466172724000\n72996\t10006\t1.0\t1466172730000\n72996\t10012\t1.0\t1466172734000\n73942\t10011\t1.0\t1466259416000\n73942\t90001\t1.0\t1466259412000\n73942\t90002\t1.0\t1466259412000\n73942\t90003\t1.0\t1466259414000\n73942\t10006\t1.0\t1466265708000\n73942\t90013\t1.0\t1466265708000\n73942\t90012\t1.0\t1466265706000\n73942\t10005\t1.0\t1466259418000\n73942\t90014\t1.0\t1466265708000\n73942\t10004\t1.0\t1466259418000\n75370\t90004\t1.0\t1466172802000\n75370\t90011\t1.0\t1466172804000\n75370\t10006\t1.0\t1466172806000\n75370\t90013\t1.0\t1466172802000\n75370\t10012\t1.0\t1466172812000\n75370\t10014\t1.0\t1466172810000\n75826\t10004\t1.0\t1466259508000\n75826\t10008\t1.0\t1466259528000\n75826\t10010\t1.0\t1466259524000\n75826\t90014\t1.0\t1466259490000\n75826\t90010\t1.0\t1466259496000\n75826\t90013\t1.0\t1466259492000\n76593\t90002\t1.0\t1466259456000\n76593\t10001\t1.0\t1466259496000\n76593\t90010\t1.0\t1466259454000\n76593\t90001\t1.0\t1466259452000\n76593\t10004\t1.0\t1466259502000\n76593\t10012\t1.0\t1466259498000\n76829\t90013\t1.0\t1466261170000\n76829\t10014\t1.0\t1466261178000\n76829\t90003\t1.0\t1466261174000\n76829\t10011\t1.0\t1466261166000\n76829\t90005\t1.0\t1466261160000\n76829\t10007\t1.0\t1466261164000\n77124\t10015\t1.0\t1466261084000\n77152\t10004\t1.0\t1466172710000\n77152\t10007\t1.0\t1466172710000\n77152\t10010\t1.0\t1466172736000\n77152\t90005\t1.0\t1466172722000\n77152\t90007\t1.0\t1466172722000\n77152\t90009\t1.0\t1466172724000\n78512\t10004\t1.0\t1466259710000\n78512\t90007\t1.0\t1466259488000\n78512\t90010\t1.0\t1466259492000\n78512\t10007\t1.0\t1466259470000\n78512\t90015\t1.0\t1466259492000\n78512\t10009\t1.0\t1466259706000\n78512\t10006\t1.0\t1466259464000\n78512\t90001\t1.0\t1466259496000\n78512\t10002\t1.0\t1466259712000\n79230\t90005\t1.0\t1466259376000\n79230\t90007\t1.0\t1466259778000\n79230\t90011\t1.0\t1466259384000\n79230\t10007\t1.0\t1466259390000\n79230\t90014\t1.0\t1466259380000\n79230\t10012\t1.0\t1466259386000\n79230\t10006\t1.0\t1466259386000\n79491\t90002\t1.0\t1466259450000\n79491\t90004\t1.0\t1466259460000\n79491\t10001\t1.0\t1466259468000\n79491\t90012\t1.0\t1466259466000\n79491\t10004\t1.0\t1466259470000\n79491\t90013\t1.0\t1466259466000\n79491\t10011\t1.0\t1466259484000\n79568\t10005\t1.0\t1466380550000\n79568\t10006\t1.0\t1466380516000\n79568\t10007\t1.0\t1466380550000\n79568\t10001\t1.0\t1466380562000\n79568\t10008\t1.0\t1466380556000\n79568\t90015\t1.0\t1466380560000\n79568\t10002\t1.0\t1466380562000\n79568\t90001\t1.0\t1466380558000\n79568\t90003\t1.0\t1466380514000\n79568\t90014\t1.0\t1466380560000\n79568\t10003\t1.0\t1466380658000\n79568\t90004\t1.0\t1466380554000\n79568\t10004\t1.0\t1466380548000\n79586\t10008\t1.0\t1466100154000\n79586\t10010\t1.0\t1466100156000\n79586\t90012\t1.0\t1466100842000\n79586\t90002\t1.0\t1466100126000\n79586\t10006\t1.0\t1466100840000\n79586\t90013\t1.0\t1466100842000\n79586\t90015\t1.0\t1466100184000\n79586\t90008\t1.0\t1466100180000\n79586\t10007\t1.0\t1466100840000\n79586\t90014\t1.0\t1466100842000\n79586\t90011\t1.0\t1466100186000\n80374\t90003\t1.0\t1466051470000\n80374\t90004\t1.0\t1466051470000\n80374\t10007\t1.0\t1466051474000\n80374\t90010\t1.0\t1466051472000\n80374\t90009\t1.0\t1466051472000\n80374\t10012\t1.0\t1466051474000\n80374\t10006\t1.0\t1466051474000\n80374\t90015\t1.0\t1466051472000\n80374\t10013\t1.0\t1466051476000\n80374\t10001\t1.0\t1466051472000\n81408\t10004\t1.0\t1466260106000\n81408\t10007\t1.0\t1466260118000\n81408\t10015\t1.0\t1466260106000\n81408\t90005\t1.0\t1466260098000\n81408\t90009\t1.0\t1466260090000\n81408\t90013\t1.0\t1466260086000\n81516\t10012\t1.0\t1466172706000\n81516\t10013\t1.0\t1466172708000\n81516\t90015\t1.0\t1466172706000\n81516\t90013\t1.0\t1466172704000\n81516\t90014\t1.0\t1466172706000\n81516\t10011\t1.0\t1466172706000\n81970\t90010\t1.0\t1466172696000\n81970\t90013\t1.0\t1466172700000\n81970\t10006\t1.0\t1466172710000\n81970\t10001\t1.0\t1466172708000\n81970\t10002\t1.0\t1466172704000\n82059\t90006\t1.0\t1466100186000\n82059\t90007\t1.0\t1466100186000\n82059\t90008\t1.0\t1466100190000\n82059\t10011\t1.0\t1466100176000\n82059\t90005\t1.0\t1466100190000\n82059\t10010\t1.0\t1466100184000\n82059\t10004\t1.0\t1466100180000\n84779\t90010\t1.0\t1466259478000\n84779\t90012\t1.0\t1466259476000\n84779\t10001\t1.0\t1466259450000\n84779\t90013\t1.0\t1466259446000\n84779\t10008\t1.0\t1466259458000\n84779\t10010\t1.0\t1466259468000\n84891\t10001\t1.0\t1466260584000\n84891\t10003\t1.0\t1466260584000\n84891\t10008\t1.0\t1466260586000\n84891\t90013\t1.0\t1466260576000\n84891\t90010\t1.0\t1466260580000\n84891\t90011\t1.0\t1466260582000\n85152\t90013\t1.0\t1466100116000\n85152\t90015\t1.0\t1466100114000\n85152\t10001\t1.0\t1466100088000\n85152\t90004\t1.0\t1466100116000\n85152\t10006\t1.0\t1466100074000\n85152\t10012\t1.0\t1466100090000\n85274\t90013\t1.0\t1466172704000\n85274\t10011\t1.0\t1466172714000\n85274\t90003\t1.0\t1466172700000\n85274\t10005\t1.0\t1466172710000\n85274\t90006\t1.0\t1466172702000\n85274\t10004\t1.0\t1466172710000\n85504\t10006\t1.0\t1466270288000\n85504\t90005\t1.0\t1466270282000\n85504\t90007\t1.0\t1466270282000\n85504\t10002\t1.0\t1466270286000\n85504\t90008\t1.0\t1466270282000\n85504\t10003\t1.0\t1466270286000\n85990\t10007\t1.0\t1466259470000\n85990\t10010\t1.0\t1466259468000\n85990\t90010\t1.0\t1466259462000\n85990\t90004\t1.0\t1466259448000\n85990\t90006\t1.0\t1466259464000\n85990\t10001\t1.0\t1466259472000\n87124\t10004\t1.0\t1466260372000\n87124\t10005\t1.0\t1466259512000\n87124\t10013\t1.0\t1466259520000\n87124\t10014\t1.0\t1466259522000\n87124\t90011\t1.0\t1466259512000\n87124\t90002\t1.0\t1466259496000\n87124\t90014\t1.0\t1466259530000\n87124\t90015\t1.0\t1466259532000\n87124\t90007\t1.0\t1466259498000\n87124\t90008\t1.0\t1466259500000\n87193\t10010\t1.0\t1466192396000\n87193\t10009\t1.0\t1466192396000\n87193\t10011\t1.0\t1466192396000\n87193\t10012\t1.0\t1466192398000\n87193\t10013\t1.0\t1466192398000\n87193\t10008\t1.0\t1466192394000\n87267\t90006\t1.0\t1466259474000\n87267\t10004\t1.0\t1466259482000\n87267\t90013\t1.0\t1466259470000\n87267\t90002\t1.0\t1466259478000\n87267\t10010\t1.0\t1466259484000\n87267\t10013\t1.0\t1466259492000\n88190\t90010\t1.0\t1466100058000\n88190\t90012\t1.0\t1466100054000\n88190\t10014\t1.0\t1466100124000\n88190\t10004\t1.0\t1466100046000\n88190\t90013\t1.0\t1466100054000\n88190\t10010\t1.0\t1466100068000\n88190\t10008\t1.0\t1466100062000\n88190\t10009\t1.0\t1466100122000\n89887\t90011\t1.0\t1466092200000\n89887\t10007\t1.0\t1466092202000\n89887\t90001\t1.0\t1466092202000\n89887\t10006\t1.0\t1466092202000\n89887\t90009\t1.0\t1466092200000\n89887\t10005\t1.0\t1466092202000\n90120\t90010\t1.0\t1466259470000\n90162\t10011\t1.0\t1466100192000\n90162\t10013\t1.0\t1466099708000\n90162\t90001\t1.0\t1466100194000\n90162\t10008\t1.0\t1466099708000\n90162\t90005\t1.0\t1466099702000\n90162\t90014\t1.0\t1466099704000\n90162\t10010\t1.0\t1466100206000\n90162\t90011\t1.0\t1466100194000\n90162\t90006\t1.0\t1466100186000\n90162\t10001\t1.0\t1466099706000\n90162\t90007\t1.0\t1466100186000\n90162\t10007\t1.0\t1466100190000\n90438\t10008\t1.0\t1466259546000\n90438\t90014\t1.0\t1466259470000\n90438\t10014\t1.0\t1466259548000\n90438\t90011\t1.0\t1466259452000\n90438\t10015\t1.0\t1466259548000\n90438\t90006\t1.0\t1466259472000\n92475\t90004\t1.0\t1466172802000\n92475\t10003\t1.0\t1466172764000\n92475\t90009\t1.0\t1466172864000\n92475\t10005\t1.0\t1466172858000\n92475\t90013\t1.0\t1466172770000\n92475\t90007\t1.0\t1466172736000\n92475\t10008\t1.0\t1466172768000\n92475\t10001\t1.0\t1466172778000\n92475\t90005\t1.0\t1466172962000\n92475\t10002\t1.0\t1466172754000\n92584\t10001\t1.0\t1466259510000\n92584\t90013\t1.0\t1466259490000\n92584\t10014\t1.0\t1466259496000\n92584\t90011\t1.0\t1466259470000\n92584\t10015\t1.0\t1466259502000\n92584\t90001\t1.0\t1466259464000\n94460\t90010\t1.0\t1466259454000\n94460\t90011\t1.0\t1466259448000\n94460\t90014\t1.0\t1466259478000\n94460\t10010\t1.0\t1466259458000\n94460\t10001\t1.0\t1466259466000\n94460\t10008\t1.0\t1466259460000\n94486\t90004\t1.0\t1466171346000\n94486\t90005\t1.0\t1466171346000\n94486\t10003\t1.0\t1466171350000\n94486\t10004\t1.0\t1466171348000\n94486\t10002\t1.0\t1466171350000\n94486\t90003\t1.0\t1466171344000\n95421\t90002\t1.0\t1466263560000\n95421\t90003\t1.0\t1466263644000\n96626\t90010\t1.0\t1466259712000\n96626\t90011\t1.0\t1466259724000\n96688\t90007\t1.0\t1466172224000\n96688\t90005\t1.0\t1466172222000\n96688\t90006\t1.0\t1466172222000\n96688\t10008\t1.0\t1466172226000\n96688\t10006\t1.0\t1466172226000\n96688\t10007\t1.0\t1466172226000\n97456\t90002\t1.0\t1466172700000\n97456\t90003\t1.0\t1466172702000\n97456\t10003\t1.0\t1466172720000\n97456\t10004\t1.0\t1466172718000\n97456\t10002\t1.0\t1466172722000\n97456\t90001\t1.0\t1466172700000\n97911\t10006\t1.0\t1466100192000\n97911\t10010\t1.0\t1466100194000\n97911\t90001\t1.0\t1466100198000\n97911\t90004\t1.0\t1466100196000\n97911\t10001\t1.0\t1466100194000\n97911\t90013\t1.0\t1466100188000\n97911\t90014\t1.0\t1466100188000\n98366\t90015\t1.0\t1466259464000\n98366\t90004\t1.0\t1466259476000\n98366\t90014\t1.0\t1466259470000\n98568\t10003\t1.0\t1466259476000\n98568\t10010\t1.0\t1466259494000\n98568\t90011\t1.0\t1466259444000\n98568\t10015\t1.0\t1466259492000\n98568\t90013\t1.0\t1466259472000\n98568\t90004\t1.0\t1466259462000\n98737\t10001\t1.0\t1466259470000\n98737\t10004\t1.0\t1466259466000\n98737\t10010\t1.0\t1466259478000\n\n\u003cfont color\u003dred\u003eResults are limited by 1000.\u003c/font\u003e"
      },
      "dateCreated": "Mar 1, 2016 8:33:45 PM",
      "dateStarted": "Jun 21, 2016 3:43:18 PM",
      "dateFinished": "Jun 21, 2016 3:43:21 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Train ALS Model With the training dataset",
      "text": "import org.apache.spark.ml.recommendation.ALS\n\nval rank \u003d 5 // this is k, number of latent factors we think exist\nval maxIterations \u003d 10\nval convergenceThreshold \u003d 0.01\nval implicitPrefs \u003d false\nval alpha \u003d 1.0\nval nonnegative \u003d true\n\nval als \u003d new ALS()\n  .setRank(rank)\n  .setMaxIter(maxIterations)\n  .setRegParam(convergenceThreshold)\n  .setImplicitPrefs(implicitPrefs)\n  .setAlpha(alpha)\n  .setNonnegative(nonnegative)\n  .setUserCol(\"userId\")\n  .setItemCol(\"itemId\")\n  .setRatingCol(\"rating\")\n  .setPredictionCol(\"prediction\")",
      "dateUpdated": "Jun 21, 2016 3:43:17 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "title": true,
        "editorHide": false,
        "editorMode": "ace/mode/scala",
        "enabled": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1435978256373_-160526409",
      "id": "20150704-025056_169923529",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import org.apache.spark.ml.recommendation.ALS\nrank: Int \u003d 5\nmaxIterations: Int \u003d 10\nconvergenceThreshold: Double \u003d 0.01\nimplicitPrefs: Boolean \u003d false\nalpha: Double \u003d 1.0\nnonnegative: Boolean \u003d true\nals: org.apache.spark.ml.recommendation.ALS \u003d als_648a6fe9228a\n"
      },
      "dateCreated": "Jul 4, 2015 2:50:56 AM",
      "dateStarted": "Jun 21, 2016 3:43:19 PM",
      "dateFinished": "Jun 21, 2016 3:43:23 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Setup ML Pipeline",
      "text": "//import org.apache.spark.ml.Pipeline\n\n//val pipeline \u003d new Pipeline()\n//  .setStages(Array(als))",
      "dateUpdated": "Jun 21, 2016 3:43:17 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465835947993_-1356802902",
      "id": "20160613-163907_1047105704",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": ""
      },
      "dateCreated": "Jun 13, 2016 4:39:07 PM",
      "dateStarted": "Jun 21, 2016 3:43:21 PM",
      "dateFinished": "Jun 21, 2016 3:43:23 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Setup Model Evaluator",
      "text": "//import org.apache.spark.ml.evaluation.RegressionEvaluator\n\n//val modelEvaluator \u003d new RegressionEvaluator()\n//  .setMetricName(\"rmse\")\n//  .setLabelCol(\"rating\")\n//  .setPredictionCol(\"prediction\")",
      "dateUpdated": "Jun 21, 2016 3:43:20 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464992813458_-888489907",
      "id": "20160603-222653_1839242653",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": ""
      },
      "dateCreated": "Jun 3, 2016 10:26:53 PM",
      "dateStarted": "Jun 21, 2016 3:43:24 PM",
      "dateFinished": "Jun 21, 2016 3:43:24 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Build Param Grid Search",
      "text": "//import org.apache.spark.ml.tuning.ParamGridBuilder\n\n//val paramGrid \u003d new ParamGridBuilder()\n//  .addGrid(als.rank, Array(5, 10))\n//  .addGrid(als.maxIter, Array(10, 20))\n//  .addGrid(als.regParam, Array(.01, .001))\n // .build()\n  \n//paramGrid.size",
      "dateUpdated": "Jun 21, 2016 3:43:21 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464996331980_906433755",
      "id": "20160603-232531_2131104428",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": ""
      },
      "dateCreated": "Jun 3, 2016 11:25:31 PM",
      "dateStarted": "Jun 21, 2016 3:43:24 PM",
      "dateFinished": "Jun 21, 2016 3:43:24 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Setup Cross Validator",
      "text": "//import org.apache.spark.ml.tuning.CrossValidator\n\n//val numFolds \u003d 2 // Should be 3+\n\n//val modelValidator \u003d new CrossValidator()\n//  .setEstimator(pipeline)\n//  .setEvaluator(modelEvaluator)\n//  .setEstimatorParamMaps(paramGrid)\n//  .setNumFolds(numFolds) ",
      "dateUpdated": "Jun 21, 2016 3:43:23 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465836085091_-166573695",
      "id": "20160613-164125_1299071014",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": ""
      },
      "dateCreated": "Jun 13, 2016 4:41:25 PM",
      "dateStarted": "Jun 21, 2016 3:43:24 PM",
      "dateFinished": "Jun 21, 2016 3:43:25 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Train CrossValidator Model To Find Best Model",
      "text": "//val crossValidatorModel \u003d modelValidator.fit(itemRatingsDF)",
      "dateUpdated": "Jun 21, 2016 3:43:23 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465836110814_1533459839",
      "id": "20160613-164150_1050480637",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": ""
      },
      "dateCreated": "Jun 13, 2016 4:41:50 PM",
      "dateStarted": "Jun 21, 2016 3:43:25 PM",
      "dateFinished": "Jun 21, 2016 3:43:25 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Find Best Param Grid Options",
      "text": "//val avgMetricsParamGrid \u003d crossValidatorModel.avgMetrics\n\n//val combined \u003d paramGrid.zip(avgMetricsParamGrid)\n//  .sortBy(paramGridMetricTuple \u003d\u003e (1 - paramGridMetricTuple._2))\n//  .take(1)(0)._1",
      "dateUpdated": "Jun 21, 2016 3:43:25 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465836131716_924802403",
      "id": "20160613-164211_11503343",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": ""
      },
      "dateCreated": "Jun 13, 2016 4:42:11 PM",
      "dateStarted": "Jun 21, 2016 3:43:25 PM",
      "dateFinished": "Jun 21, 2016 3:43:25 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Find Best Pipeline Model",
      "text": "//import org.apache.spark.ml.PipelineModel\n\n//val bestPipelineModel \u003d crossValidatorModel.bestModel.asInstanceOf[PipelineModel]",
      "dateUpdated": "Jun 21, 2016 3:43:26 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465836167704_823289991",
      "id": "20160613-164247_421530178",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": ""
      },
      "dateCreated": "Jun 13, 2016 4:42:47 PM",
      "dateStarted": "Jun 21, 2016 3:43:26 PM",
      "dateFinished": "Jun 21, 2016 3:43:26 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Extract Best Recomendation Model",
      "text": "//import org.apache.spark.ml.recommendation.ALSModel\n\n//val bestRecommendationModel \u003d bestPipelineModel.stages(0).asInstanceOf[ALSModel]",
      "dateUpdated": "Jun 21, 2016 3:43:26 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465836184603_1803092197",
      "id": "20160613-164304_1411945185",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": ""
      },
      "dateCreated": "Jun 13, 2016 4:43:04 PM",
      "dateStarted": "Jun 21, 2016 3:43:26 PM",
      "dateFinished": "Jun 21, 2016 3:43:27 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Find all (User, item) pairs without an existing Rating",
      "text": "val allDistinctUsersDF \u003d itemRatingsDF.select($\"userId\").dropDuplicates()\n\nval allDistinctUserItemPairsDF \u003d allDistinctUsersDF\n  .join(itemsDF.select($\"itemId\"))\n  .select($\"userId\", $\"itemId\")\n  .coalesce(1)\n  .distinct()\n\nz.show(allDistinctUserItemPairsDF.sort($\"userId\", $\"itemId\"))",
      "dateUpdated": "Jun 21, 2016 3:43:26 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 288.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1461100304691_419185220",
      "id": "20160419-211144_1773438539",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\titemId\n666\t10001\n666\t10002\n666\t10003\n666\t10004\n666\t10005\n666\t10006\n666\t10007\n666\t10008\n666\t10009\n666\t10010\n666\t10011\n666\t10012\n666\t10013\n666\t10014\n666\t10015\n666\t90001\n666\t90002\n666\t90003\n666\t90004\n666\t90005\n666\t90006\n666\t90007\n666\t90008\n666\t90009\n666\t90010\n666\t90011\n666\t90012\n666\t90013\n666\t90014\n666\t90015\n671\t10001\n671\t10002\n671\t10003\n671\t10004\n671\t10005\n671\t10006\n671\t10007\n671\t10008\n671\t10009\n671\t10010\n671\t10011\n671\t10012\n671\t10013\n671\t10014\n671\t10015\n671\t90001\n671\t90002\n671\t90003\n671\t90004\n671\t90005\n671\t90006\n671\t90007\n671\t90008\n671\t90009\n671\t90010\n671\t90011\n671\t90012\n671\t90013\n671\t90014\n671\t90015\n2708\t10001\n2708\t10002\n2708\t10003\n2708\t10004\n2708\t10005\n2708\t10006\n2708\t10007\n2708\t10008\n2708\t10009\n2708\t10010\n2708\t10011\n2708\t10012\n2708\t10013\n2708\t10014\n2708\t10015\n2708\t90001\n2708\t90002\n2708\t90003\n2708\t90004\n2708\t90005\n2708\t90006\n2708\t90007\n2708\t90008\n2708\t90009\n2708\t90010\n2708\t90011\n2708\t90012\n2708\t90013\n2708\t90014\n2708\t90015\n2879\t10001\n2879\t10002\n2879\t10003\n2879\t10004\n2879\t10005\n2879\t10006\n2879\t10007\n2879\t10008\n2879\t10009\n2879\t10010\n2879\t10011\n2879\t10012\n2879\t10013\n2879\t10014\n2879\t10015\n2879\t90001\n2879\t90002\n2879\t90003\n2879\t90004\n2879\t90005\n2879\t90006\n2879\t90007\n2879\t90008\n2879\t90009\n2879\t90010\n2879\t90011\n2879\t90012\n2879\t90013\n2879\t90014\n2879\t90015\n5980\t10001\n5980\t10002\n5980\t10003\n5980\t10004\n5980\t10005\n5980\t10006\n5980\t10007\n5980\t10008\n5980\t10009\n5980\t10010\n5980\t10011\n5980\t10012\n5980\t10013\n5980\t10014\n5980\t10015\n5980\t90001\n5980\t90002\n5980\t90003\n5980\t90004\n5980\t90005\n5980\t90006\n5980\t90007\n5980\t90008\n5980\t90009\n5980\t90010\n5980\t90011\n5980\t90012\n5980\t90013\n5980\t90014\n5980\t90015\n5983\t10001\n5983\t10002\n5983\t10003\n5983\t10004\n5983\t10005\n5983\t10006\n5983\t10007\n5983\t10008\n5983\t10009\n5983\t10010\n5983\t10011\n5983\t10012\n5983\t10013\n5983\t10014\n5983\t10015\n5983\t90001\n5983\t90002\n5983\t90003\n5983\t90004\n5983\t90005\n5983\t90006\n5983\t90007\n5983\t90008\n5983\t90009\n5983\t90010\n5983\t90011\n5983\t90012\n5983\t90013\n5983\t90014\n5983\t90015\n7467\t10001\n7467\t10002\n7467\t10003\n7467\t10004\n7467\t10005\n7467\t10006\n7467\t10007\n7467\t10008\n7467\t10009\n7467\t10010\n7467\t10011\n7467\t10012\n7467\t10013\n7467\t10014\n7467\t10015\n7467\t90001\n7467\t90002\n7467\t90003\n7467\t90004\n7467\t90005\n7467\t90006\n7467\t90007\n7467\t90008\n7467\t90009\n7467\t90010\n7467\t90011\n7467\t90012\n7467\t90013\n7467\t90014\n7467\t90015\n7726\t10001\n7726\t10002\n7726\t10003\n7726\t10004\n7726\t10005\n7726\t10006\n7726\t10007\n7726\t10008\n7726\t10009\n7726\t10010\n7726\t10011\n7726\t10012\n7726\t10013\n7726\t10014\n7726\t10015\n7726\t90001\n7726\t90002\n7726\t90003\n7726\t90004\n7726\t90005\n7726\t90006\n7726\t90007\n7726\t90008\n7726\t90009\n7726\t90010\n7726\t90011\n7726\t90012\n7726\t90013\n7726\t90014\n7726\t90015\n9040\t10001\n9040\t10002\n9040\t10003\n9040\t10004\n9040\t10005\n9040\t10006\n9040\t10007\n9040\t10008\n9040\t10009\n9040\t10010\n9040\t10011\n9040\t10012\n9040\t10013\n9040\t10014\n9040\t10015\n9040\t90001\n9040\t90002\n9040\t90003\n9040\t90004\n9040\t90005\n9040\t90006\n9040\t90007\n9040\t90008\n9040\t90009\n9040\t90010\n9040\t90011\n9040\t90012\n9040\t90013\n9040\t90014\n9040\t90015\n9773\t10001\n9773\t10002\n9773\t10003\n9773\t10004\n9773\t10005\n9773\t10006\n9773\t10007\n9773\t10008\n9773\t10009\n9773\t10010\n9773\t10011\n9773\t10012\n9773\t10013\n9773\t10014\n9773\t10015\n9773\t90001\n9773\t90002\n9773\t90003\n9773\t90004\n9773\t90005\n9773\t90006\n9773\t90007\n9773\t90008\n9773\t90009\n9773\t90010\n9773\t90011\n9773\t90012\n9773\t90013\n9773\t90014\n9773\t90015\n10198\t10001\n10198\t10002\n10198\t10003\n10198\t10004\n10198\t10005\n10198\t10006\n10198\t10007\n10198\t10008\n10198\t10009\n10198\t10010\n10198\t10011\n10198\t10012\n10198\t10013\n10198\t10014\n10198\t10015\n10198\t90001\n10198\t90002\n10198\t90003\n10198\t90004\n10198\t90005\n10198\t90006\n10198\t90007\n10198\t90008\n10198\t90009\n10198\t90010\n10198\t90011\n10198\t90012\n10198\t90013\n10198\t90014\n10198\t90015\n10469\t10001\n10469\t10002\n10469\t10003\n10469\t10004\n10469\t10005\n10469\t10006\n10469\t10007\n10469\t10008\n10469\t10009\n10469\t10010\n10469\t10011\n10469\t10012\n10469\t10013\n10469\t10014\n10469\t10015\n10469\t90001\n10469\t90002\n10469\t90003\n10469\t90004\n10469\t90005\n10469\t90006\n10469\t90007\n10469\t90008\n10469\t90009\n10469\t90010\n10469\t90011\n10469\t90012\n10469\t90013\n10469\t90014\n10469\t90015\n10921\t10001\n10921\t10002\n10921\t10003\n10921\t10004\n10921\t10005\n10921\t10006\n10921\t10007\n10921\t10008\n10921\t10009\n10921\t10010\n10921\t10011\n10921\t10012\n10921\t10013\n10921\t10014\n10921\t10015\n10921\t90001\n10921\t90002\n10921\t90003\n10921\t90004\n10921\t90005\n10921\t90006\n10921\t90007\n10921\t90008\n10921\t90009\n10921\t90010\n10921\t90011\n10921\t90012\n10921\t90013\n10921\t90014\n10921\t90015\n11905\t10001\n11905\t10002\n11905\t10003\n11905\t10004\n11905\t10005\n11905\t10006\n11905\t10007\n11905\t10008\n11905\t10009\n11905\t10010\n11905\t10011\n11905\t10012\n11905\t10013\n11905\t10014\n11905\t10015\n11905\t90001\n11905\t90002\n11905\t90003\n11905\t90004\n11905\t90005\n11905\t90006\n11905\t90007\n11905\t90008\n11905\t90009\n11905\t90010\n11905\t90011\n11905\t90012\n11905\t90013\n11905\t90014\n11905\t90015\n13397\t10001\n13397\t10002\n13397\t10003\n13397\t10004\n13397\t10005\n13397\t10006\n13397\t10007\n13397\t10008\n13397\t10009\n13397\t10010\n13397\t10011\n13397\t10012\n13397\t10013\n13397\t10014\n13397\t10015\n13397\t90001\n13397\t90002\n13397\t90003\n13397\t90004\n13397\t90005\n13397\t90006\n13397\t90007\n13397\t90008\n13397\t90009\n13397\t90010\n13397\t90011\n13397\t90012\n13397\t90013\n13397\t90014\n13397\t90015\n14806\t10001\n14806\t10002\n14806\t10003\n14806\t10004\n14806\t10005\n14806\t10006\n14806\t10007\n14806\t10008\n14806\t10009\n14806\t10010\n14806\t10011\n14806\t10012\n14806\t10013\n14806\t10014\n14806\t10015\n14806\t90001\n14806\t90002\n14806\t90003\n14806\t90004\n14806\t90005\n14806\t90006\n14806\t90007\n14806\t90008\n14806\t90009\n14806\t90010\n14806\t90011\n14806\t90012\n14806\t90013\n14806\t90014\n14806\t90015\n17802\t10001\n17802\t10002\n17802\t10003\n17802\t10004\n17802\t10005\n17802\t10006\n17802\t10007\n17802\t10008\n17802\t10009\n17802\t10010\n17802\t10011\n17802\t10012\n17802\t10013\n17802\t10014\n17802\t10015\n17802\t90001\n17802\t90002\n17802\t90003\n17802\t90004\n17802\t90005\n17802\t90006\n17802\t90007\n17802\t90008\n17802\t90009\n17802\t90010\n17802\t90011\n17802\t90012\n17802\t90013\n17802\t90014\n17802\t90015\n17928\t10001\n17928\t10002\n17928\t10003\n17928\t10004\n17928\t10005\n17928\t10006\n17928\t10007\n17928\t10008\n17928\t10009\n17928\t10010\n17928\t10011\n17928\t10012\n17928\t10013\n17928\t10014\n17928\t10015\n17928\t90001\n17928\t90002\n17928\t90003\n17928\t90004\n17928\t90005\n17928\t90006\n17928\t90007\n17928\t90008\n17928\t90009\n17928\t90010\n17928\t90011\n17928\t90012\n17928\t90013\n17928\t90014\n17928\t90015\n18910\t10001\n18910\t10002\n18910\t10003\n18910\t10004\n18910\t10005\n18910\t10006\n18910\t10007\n18910\t10008\n18910\t10009\n18910\t10010\n18910\t10011\n18910\t10012\n18910\t10013\n18910\t10014\n18910\t10015\n18910\t90001\n18910\t90002\n18910\t90003\n18910\t90004\n18910\t90005\n18910\t90006\n18910\t90007\n18910\t90008\n18910\t90009\n18910\t90010\n18910\t90011\n18910\t90012\n18910\t90013\n18910\t90014\n18910\t90015\n19149\t10001\n19149\t10002\n19149\t10003\n19149\t10004\n19149\t10005\n19149\t10006\n19149\t10007\n19149\t10008\n19149\t10009\n19149\t10010\n19149\t10011\n19149\t10012\n19149\t10013\n19149\t10014\n19149\t10015\n19149\t90001\n19149\t90002\n19149\t90003\n19149\t90004\n19149\t90005\n19149\t90006\n19149\t90007\n19149\t90008\n19149\t90009\n19149\t90010\n19149\t90011\n19149\t90012\n19149\t90013\n19149\t90014\n19149\t90015\n19186\t10001\n19186\t10002\n19186\t10003\n19186\t10004\n19186\t10005\n19186\t10006\n19186\t10007\n19186\t10008\n19186\t10009\n19186\t10010\n19186\t10011\n19186\t10012\n19186\t10013\n19186\t10014\n19186\t10015\n19186\t90001\n19186\t90002\n19186\t90003\n19186\t90004\n19186\t90005\n19186\t90006\n19186\t90007\n19186\t90008\n19186\t90009\n19186\t90010\n19186\t90011\n19186\t90012\n19186\t90013\n19186\t90014\n19186\t90015\n19829\t10001\n19829\t10002\n19829\t10003\n19829\t10004\n19829\t10005\n19829\t10006\n19829\t10007\n19829\t10008\n19829\t10009\n19829\t10010\n19829\t10011\n19829\t10012\n19829\t10013\n19829\t10014\n19829\t10015\n19829\t90001\n19829\t90002\n19829\t90003\n19829\t90004\n19829\t90005\n19829\t90006\n19829\t90007\n19829\t90008\n19829\t90009\n19829\t90010\n19829\t90011\n19829\t90012\n19829\t90013\n19829\t90014\n19829\t90015\n19901\t10001\n19901\t10002\n19901\t10003\n19901\t10004\n19901\t10005\n19901\t10006\n19901\t10007\n19901\t10008\n19901\t10009\n19901\t10010\n19901\t10011\n19901\t10012\n19901\t10013\n19901\t10014\n19901\t10015\n19901\t90001\n19901\t90002\n19901\t90003\n19901\t90004\n19901\t90005\n19901\t90006\n19901\t90007\n19901\t90008\n19901\t90009\n19901\t90010\n19901\t90011\n19901\t90012\n19901\t90013\n19901\t90014\n19901\t90015\n20269\t10001\n20269\t10002\n20269\t10003\n20269\t10004\n20269\t10005\n20269\t10006\n20269\t10007\n20269\t10008\n20269\t10009\n20269\t10010\n20269\t10011\n20269\t10012\n20269\t10013\n20269\t10014\n20269\t10015\n20269\t90001\n20269\t90002\n20269\t90003\n20269\t90004\n20269\t90005\n20269\t90006\n20269\t90007\n20269\t90008\n20269\t90009\n20269\t90010\n20269\t90011\n20269\t90012\n20269\t90013\n20269\t90014\n20269\t90015\n20599\t10001\n20599\t10002\n20599\t10003\n20599\t10004\n20599\t10005\n20599\t10006\n20599\t10007\n20599\t10008\n20599\t10009\n20599\t10010\n20599\t10011\n20599\t10012\n20599\t10013\n20599\t10014\n20599\t10015\n20599\t90001\n20599\t90002\n20599\t90003\n20599\t90004\n20599\t90005\n20599\t90006\n20599\t90007\n20599\t90008\n20599\t90009\n20599\t90010\n20599\t90011\n20599\t90012\n20599\t90013\n20599\t90014\n20599\t90015\n21141\t10001\n21141\t10002\n21141\t10003\n21141\t10004\n21141\t10005\n21141\t10006\n21141\t10007\n21141\t10008\n21141\t10009\n21141\t10010\n21141\t10011\n21141\t10012\n21141\t10013\n21141\t10014\n21141\t10015\n21141\t90001\n21141\t90002\n21141\t90003\n21141\t90004\n21141\t90005\n21141\t90006\n21141\t90007\n21141\t90008\n21141\t90009\n21141\t90010\n21141\t90011\n21141\t90012\n21141\t90013\n21141\t90014\n21141\t90015\n21423\t10001\n21423\t10002\n21423\t10003\n21423\t10004\n21423\t10005\n21423\t10006\n21423\t10007\n21423\t10008\n21423\t10009\n21423\t10010\n21423\t10011\n21423\t10012\n21423\t10013\n21423\t10014\n21423\t10015\n21423\t90001\n21423\t90002\n21423\t90003\n21423\t90004\n21423\t90005\n21423\t90006\n21423\t90007\n21423\t90008\n21423\t90009\n21423\t90010\n21423\t90011\n21423\t90012\n21423\t90013\n21423\t90014\n21423\t90015\n21619\t10001\n21619\t10002\n21619\t10003\n21619\t10004\n21619\t10005\n21619\t10006\n21619\t10007\n21619\t10008\n21619\t10009\n21619\t10010\n21619\t10011\n21619\t10012\n21619\t10013\n21619\t10014\n21619\t10015\n21619\t90001\n21619\t90002\n21619\t90003\n21619\t90004\n21619\t90005\n21619\t90006\n21619\t90007\n21619\t90008\n21619\t90009\n21619\t90010\n21619\t90011\n21619\t90012\n21619\t90013\n21619\t90014\n21619\t90015\n22945\t10001\n22945\t10002\n22945\t10003\n22945\t10004\n22945\t10005\n22945\t10006\n22945\t10007\n22945\t10008\n22945\t10009\n22945\t10010\n22945\t10011\n22945\t10012\n22945\t10013\n22945\t10014\n22945\t10015\n22945\t90001\n22945\t90002\n22945\t90003\n22945\t90004\n22945\t90005\n22945\t90006\n22945\t90007\n22945\t90008\n22945\t90009\n22945\t90010\n22945\t90011\n22945\t90012\n22945\t90013\n22945\t90014\n22945\t90015\n23393\t10001\n23393\t10002\n23393\t10003\n23393\t10004\n23393\t10005\n23393\t10006\n23393\t10007\n23393\t10008\n23393\t10009\n23393\t10010\n23393\t10011\n23393\t10012\n23393\t10013\n23393\t10014\n23393\t10015\n23393\t90001\n23393\t90002\n23393\t90003\n23393\t90004\n23393\t90005\n23393\t90006\n23393\t90007\n23393\t90008\n23393\t90009\n23393\t90010\n23393\t90011\n23393\t90012\n23393\t90013\n23393\t90014\n23393\t90015\n23983\t10001\n23983\t10002\n23983\t10003\n23983\t10004\n23983\t10005\n23983\t10006\n23983\t10007\n23983\t10008\n23983\t10009\n23983\t10010\n23983\t10011\n23983\t10012\n23983\t10013\n23983\t10014\n23983\t10015\n23983\t90001\n23983\t90002\n23983\t90003\n23983\t90004\n23983\t90005\n23983\t90006\n23983\t90007\n23983\t90008\n23983\t90009\n23983\t90010\n23983\t90011\n23983\t90012\n23983\t90013\n23983\t90014\n23983\t90015\n24600\t10001\n24600\t10002\n24600\t10003\n24600\t10004\n24600\t10005\n24600\t10006\n24600\t10007\n24600\t10008\n24600\t10009\n24600\t10010\n24600\t10011\n24600\t10012\n24600\t10013\n24600\t10014\n24600\t10015\n24600\t90001\n24600\t90002\n24600\t90003\n24600\t90004\n24600\t90005\n24600\t90006\n24600\t90007\n24600\t90008\n24600\t90009\n24600\t90010\n24600\t90011\n24600\t90012\n24600\t90013\n24600\t90014\n24600\t90015\n25094\t10001\n25094\t10002\n25094\t10003\n25094\t10004\n25094\t10005\n25094\t10006\n25094\t10007\n25094\t10008\n25094\t10009\n25094\t10010\n25094\t10011\n25094\t10012\n25094\t10013\n25094\t10014\n25094\t10015\n25094\t90001\n25094\t90002\n25094\t90003\n25094\t90004\n25094\t90005\n25094\t90006\n25094\t90007\n25094\t90008\n25094\t90009\n25094\t90010\n25094\t90011\n25094\t90012\n25094\t90013\n25094\t90014\n25094\t90015\n25237\t10001\n25237\t10002\n25237\t10003\n25237\t10004\n25237\t10005\n25237\t10006\n25237\t10007\n25237\t10008\n25237\t10009\n25237\t10010\n\n\u003cfont color\u003dred\u003eResults are limited by 1000.\u003c/font\u003e"
      },
      "dateCreated": "Apr 19, 2016 9:11:44 PM",
      "dateStarted": "Jun 21, 2016 3:43:27 PM",
      "dateFinished": "Jun 21, 2016 3:43:30 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Train Model",
      "text": "import org.apache.spark.ml.recommendation.ALSModel\nval model \u003d als.fit(itemRatingsDF)",
      "dateUpdated": "Jun 21, 2016 3:43:28 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1466519865275_-1985327032",
      "id": "20160621-143745_2078814942",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import org.apache.spark.ml.recommendation.ALSModel\nmodel: org.apache.spark.ml.recommendation.ALSModel \u003d als_648a6fe9228a\n"
      },
      "dateCreated": "Jun 21, 2016 2:37:45 PM",
      "dateStarted": "Jun 21, 2016 3:43:28 PM",
      "dateFinished": "Jun 21, 2016 3:43:35 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Generate Recommendations for (user, Item) Pairs without existing ratings",
      "text": "//val recommendationsDF \u003d bestRecommendationModel.transform(allDistinctUserItemPairsDF)\n\nval recommendationsDF \u003d model.transform(allDistinctUserItemPairsDF)\n  .as(\"recommendations\")\n  .cache()\n  \nz.show(recommendationsDF.sort($\"userId\", $\"itemId\"))",
      "dateUpdated": "Jun 21, 2016 3:43:28 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464991903856_-1906023745",
      "id": "20160603-221143_1134516290",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\titemId\tprediction\n666\t10001\t0.9826194\n666\t10002\t0.9826226\n666\t10003\t0.98262256\n666\t10004\t0.98262364\n666\t10005\t0.9826258\n666\t10006\t0.9826196\n666\t10007\t0.9826254\n666\t10008\t0.98262274\n666\t10009\t0.9826258\n666\t10010\t0.982623\n666\t10011\t0.9826281\n666\t10012\t0.98262024\n666\t10013\t0.9826216\n666\t10014\t0.9826206\n666\t10015\t0.98262405\n666\t90001\t0.9826207\n666\t90002\t0.98262036\n666\t90003\t0.9826245\n666\t90004\t0.9826226\n666\t90005\t0.9826301\n666\t90006\t0.98262846\n666\t90007\t0.9826285\n666\t90008\t0.98262537\n666\t90009\t0.98262554\n666\t90010\t0.9826183\n666\t90011\t0.98261684\n666\t90012\t0.9826255\n666\t90013\t0.982621\n666\t90014\t0.98261845\n666\t90015\t0.98262256\n671\t10001\t0.9826197\n671\t10002\t0.9826229\n671\t10003\t0.98262274\n671\t10004\t0.9826238\n671\t10005\t0.9826261\n671\t10006\t0.9826197\n671\t10007\t0.98262554\n671\t10008\t0.982623\n671\t10009\t0.9826261\n671\t10010\t0.9826232\n671\t10011\t0.98262835\n671\t10012\t0.98262036\n671\t10013\t0.9826218\n671\t10014\t0.9826208\n671\t10015\t0.9826243\n671\t90001\t0.98262095\n671\t90002\t0.98262066\n671\t90003\t0.98262465\n671\t90004\t0.98262286\n671\t90005\t0.9826303\n671\t90006\t0.9826287\n671\t90007\t0.98262864\n671\t90008\t0.9826256\n671\t90009\t0.9826258\n671\t90010\t0.98261845\n671\t90011\t0.98261714\n671\t90012\t0.9826257\n671\t90013\t0.9826212\n671\t90014\t0.98261875\n671\t90015\t0.98262274\n2708\t10001\t0.9826176\n2708\t10002\t0.98262084\n2708\t10003\t0.9826207\n2708\t10004\t0.9826217\n2708\t10005\t0.98262405\n2708\t10006\t0.9826177\n2708\t10007\t0.9826235\n2708\t10008\t0.98262095\n2708\t10009\t0.98262405\n2708\t10010\t0.98262113\n2708\t10011\t0.9826263\n2708\t10012\t0.98261833\n2708\t10013\t0.98261976\n2708\t10014\t0.9826187\n2708\t10015\t0.9826222\n2708\t90001\t0.9826189\n2708\t90002\t0.98261863\n2708\t90003\t0.9826226\n2708\t90004\t0.9826208\n2708\t90005\t0.9826283\n2708\t90006\t0.9826266\n2708\t90007\t0.9826266\n2708\t90008\t0.9826236\n2708\t90009\t0.98262376\n2708\t90010\t0.9826164\n2708\t90011\t0.9826151\n2708\t90012\t0.9826237\n2708\t90013\t0.98261917\n2708\t90014\t0.98261666\n2708\t90015\t0.9826207\n2879\t10001\t0.9826167\n2879\t10002\t0.9826199\n2879\t10003\t0.9826198\n2879\t10004\t0.9826209\n2879\t10005\t0.9826231\n2879\t10006\t0.9826168\n2879\t10007\t0.9826227\n2879\t10008\t0.98262\n2879\t10009\t0.98262316\n2879\t10010\t0.9826203\n2879\t10011\t0.98262537\n2879\t10012\t0.9826175\n2879\t10013\t0.98261887\n2879\t10014\t0.9826178\n2879\t10015\t0.9826213\n2879\t90001\t0.98261803\n2879\t90002\t0.98261774\n2879\t90003\t0.9826217\n2879\t90004\t0.9826199\n2879\t90005\t0.98262733\n2879\t90006\t0.9826257\n2879\t90007\t0.9826257\n2879\t90008\t0.98262274\n2879\t90009\t0.98262286\n2879\t90010\t0.98261553\n2879\t90011\t0.9826142\n2879\t90012\t0.98262274\n2879\t90013\t0.9826183\n2879\t90014\t0.9826158\n2879\t90015\t0.98261976\n5980\t10001\t0.98262143\n5980\t10002\t0.9826246\n5980\t10003\t0.98262453\n5980\t10004\t0.9826256\n5980\t10005\t0.98262775\n5980\t10006\t0.98262143\n5980\t10007\t0.98262733\n5980\t10008\t0.98262465\n5980\t10009\t0.9826278\n5980\t10010\t0.98262495\n5980\t10011\t0.98263\n5980\t10012\t0.98262215\n5980\t10013\t0.9826236\n5980\t10014\t0.9826225\n5980\t10015\t0.98262596\n5980\t90001\t0.9826227\n5980\t90002\t0.9826224\n5980\t90003\t0.98262644\n5980\t90004\t0.9826246\n5980\t90005\t0.982632\n5980\t90006\t0.9826304\n5980\t90007\t0.98263043\n5980\t90008\t0.9826273\n5980\t90009\t0.98262745\n5980\t90010\t0.98262024\n5980\t90011\t0.9826188\n5980\t90012\t0.9826275\n5980\t90013\t0.9826229\n5980\t90014\t0.9826204\n5980\t90015\t0.9826244\n5983\t10001\t0.98261553\n5983\t10002\t0.98261875\n5983\t10003\t0.9826187\n5983\t10004\t0.98261976\n5983\t10005\t0.9826219\n5983\t10006\t0.9826156\n5983\t10007\t0.9826215\n5983\t10008\t0.98261887\n5983\t10009\t0.9826219\n5983\t10010\t0.98261905\n5983\t10011\t0.98262423\n5983\t10012\t0.9826163\n5983\t10013\t0.9826176\n5983\t10014\t0.9826166\n5983\t10015\t0.9826201\n5983\t90001\t0.9826168\n5983\t90002\t0.98261654\n5983\t90003\t0.9826206\n5983\t90004\t0.9826187\n5983\t90005\t0.9826262\n5983\t90006\t0.9826245\n5983\t90007\t0.98262453\n5983\t90008\t0.98262143\n5983\t90009\t0.98262167\n5983\t90010\t0.9826144\n5983\t90011\t0.98261297\n5983\t90012\t0.9826216\n5983\t90013\t0.98261714\n5983\t90014\t0.9826146\n5983\t90015\t0.98261863\n7467\t10001\t0.98261964\n7467\t10002\t0.98262286\n7467\t10003\t0.9826228\n7467\t10004\t0.9826239\n7467\t10005\t0.982626\n7467\t10006\t0.9826197\n7467\t10007\t0.9826256\n7467\t10008\t0.982623\n7467\t10009\t0.982626\n7467\t10010\t0.98262316\n7467\t10011\t0.9826283\n7467\t10012\t0.98262036\n7467\t10013\t0.9826218\n7467\t10014\t0.9826207\n7467\t10015\t0.9826243\n7467\t90001\t0.9826209\n7467\t90002\t0.9826206\n7467\t90003\t0.98262465\n7467\t90004\t0.9826228\n7467\t90005\t0.9826303\n7467\t90006\t0.98262864\n7467\t90007\t0.98262864\n7467\t90008\t0.9826256\n7467\t90009\t0.9826258\n7467\t90010\t0.9826185\n7467\t90011\t0.9826171\n7467\t90012\t0.9826257\n7467\t90013\t0.9826212\n7467\t90014\t0.9826187\n7467\t90015\t0.98262274\n7726\t10001\t0.9826188\n7726\t10002\t0.98262197\n7726\t10003\t0.9826219\n7726\t10004\t0.98262286\n7726\t10005\t0.9826251\n7726\t10006\t0.98261887\n7726\t10007\t0.9826247\n7726\t10008\t0.98262215\n7726\t10009\t0.9826251\n7726\t10010\t0.98262227\n7726\t10011\t0.9826274\n7726\t10012\t0.9826195\n7726\t10013\t0.98262095\n7726\t10014\t0.9826199\n7726\t10015\t0.98262334\n7726\t90001\t0.98262\n7726\t90002\t0.9826198\n7726\t90003\t0.98262376\n7726\t90004\t0.982622\n7726\t90005\t0.9826295\n7726\t90006\t0.98262775\n7726\t90007\t0.9826278\n7726\t90008\t0.9826247\n7726\t90009\t0.98262495\n7726\t90010\t0.98261756\n7726\t90011\t0.9826162\n7726\t90012\t0.9826248\n7726\t90013\t0.9826203\n7726\t90014\t0.98261786\n7726\t90015\t0.9826219\n9040\t10001\t0.98261815\n9040\t10002\t0.9826214\n9040\t10003\t0.9826213\n9040\t10004\t0.9826224\n9040\t10005\t0.98262453\n9040\t10006\t0.9826183\n9040\t10007\t0.98262405\n9040\t10008\t0.98262155\n9040\t10009\t0.9826246\n9040\t10010\t0.9826217\n9040\t10011\t0.9826268\n9040\t10012\t0.9826189\n9040\t10013\t0.98262036\n9040\t10014\t0.9826193\n9040\t10015\t0.98262274\n9040\t90001\t0.98261946\n9040\t90002\t0.98261917\n9040\t90003\t0.98262316\n9040\t90004\t0.9826214\n9040\t90005\t0.9826289\n9040\t90006\t0.9826272\n9040\t90007\t0.98262715\n9040\t90008\t0.98262405\n9040\t90009\t0.98262435\n9040\t90010\t0.9826169\n9040\t90011\t0.98261565\n9040\t90012\t0.9826243\n9040\t90013\t0.98261976\n9040\t90014\t0.98261726\n9040\t90015\t0.9826213\n9773\t10001\t0.98261964\n9773\t10002\t0.9826229\n9773\t10003\t0.9826228\n9773\t10004\t0.9826239\n9773\t10005\t0.9826261\n9773\t10006\t0.98261976\n9773\t10007\t0.9826256\n9773\t10008\t0.98262304\n9773\t10009\t0.9826261\n9773\t10010\t0.9826232\n9773\t10011\t0.98262835\n9773\t10012\t0.9826204\n9773\t10013\t0.98262185\n9773\t10014\t0.9826208\n9773\t10015\t0.9826243\n9773\t90001\t0.98262095\n9773\t90002\t0.98262066\n9773\t90003\t0.98262465\n9773\t90004\t0.98262286\n9773\t90005\t0.9826304\n9773\t90006\t0.98262864\n9773\t90007\t0.9826287\n9773\t90008\t0.9826256\n9773\t90009\t0.98262584\n9773\t90010\t0.98261845\n9773\t90011\t0.98261714\n9773\t90012\t0.9826257\n9773\t90013\t0.9826212\n9773\t90014\t0.98261875\n9773\t90015\t0.9826228\n10198\t10001\t0.9826182\n10198\t10002\t0.98262143\n10198\t10003\t0.9826213\n10198\t10004\t0.9826224\n10198\t10005\t0.9826246\n10198\t10006\t0.9826183\n10198\t10007\t0.98262405\n10198\t10008\t0.98262155\n10198\t10009\t0.9826246\n10198\t10010\t0.9826217\n10198\t10011\t0.9826268\n10198\t10012\t0.9826189\n10198\t10013\t0.98262036\n10198\t10014\t0.9826193\n10198\t10015\t0.98262274\n10198\t90001\t0.98261946\n10198\t90002\t0.98261917\n10198\t90003\t0.98262316\n10198\t90004\t0.9826214\n10198\t90005\t0.9826289\n10198\t90006\t0.9826272\n10198\t90007\t0.9826272\n10198\t90008\t0.9826242\n10198\t90009\t0.98262435\n10198\t90010\t0.982617\n10198\t90011\t0.98261565\n10198\t90012\t0.9826243\n10198\t90013\t0.98261976\n10198\t90014\t0.98261726\n10198\t90015\t0.9826213\n10469\t10001\t0.9826167\n10469\t10002\t0.98261994\n10469\t10003\t0.98261976\n10469\t10004\t0.9826209\n10469\t10005\t0.98262304\n10469\t10006\t0.98261684\n10469\t10007\t0.9826226\n10469\t10008\t0.98262\n10469\t10009\t0.9826231\n10469\t10010\t0.98262024\n10469\t10011\t0.98262537\n10469\t10012\t0.98261744\n10469\t10013\t0.9826189\n10469\t10014\t0.98261774\n10469\t10015\t0.98262125\n10469\t90001\t0.982618\n10469\t90002\t0.9826177\n10469\t90003\t0.9826217\n10469\t90004\t0.9826199\n10469\t90005\t0.98262733\n10469\t90006\t0.9826257\n10469\t90007\t0.9826257\n10469\t90008\t0.9826226\n10469\t90009\t0.98262286\n10469\t90010\t0.9826155\n10469\t90011\t0.98261416\n10469\t90012\t0.98262274\n10469\t90013\t0.9826182\n10469\t90014\t0.98261577\n10469\t90015\t0.98261976\n10921\t10001\t0.9826162\n10921\t10002\t0.9826194\n10921\t10003\t0.9826193\n10921\t10004\t0.9826203\n10921\t10005\t0.9826225\n10921\t10006\t0.9826162\n10921\t10007\t0.982622\n10921\t10008\t0.98261946\n10921\t10009\t0.9826225\n10921\t10010\t0.98261964\n10921\t10011\t0.98262477\n10921\t10012\t0.9826169\n10921\t10013\t0.9826182\n10921\t10014\t0.9826172\n10921\t10015\t0.98262066\n10921\t90001\t0.98261744\n10921\t90002\t0.98261714\n10921\t90003\t0.9826212\n10921\t90004\t0.98261935\n10921\t90005\t0.9826268\n10921\t90006\t0.9826251\n10921\t90007\t0.9826251\n10921\t90008\t0.982622\n10921\t90009\t0.98262227\n10921\t90010\t0.9826149\n10921\t90011\t0.98261356\n10921\t90012\t0.98262215\n10921\t90013\t0.9826176\n10921\t90014\t0.9826152\n10921\t90015\t0.9826192\n11905\t10001\t0.9826192\n11905\t10002\t0.9826225\n11905\t10003\t0.9826223\n11905\t10004\t0.9826234\n11905\t10005\t0.98262566\n11905\t10006\t0.9826194\n11905\t10007\t0.9826251\n11905\t10008\t0.98262256\n11905\t10009\t0.9826256\n11905\t10010\t0.98262286\n11905\t10011\t0.9826279\n11905\t10012\t0.98262\n11905\t10013\t0.98262143\n11905\t10014\t0.98262036\n11905\t10015\t0.9826238\n11905\t90001\t0.9826206\n11905\t90002\t0.98262024\n11905\t90003\t0.9826243\n11905\t90004\t0.9826225\n11905\t90005\t0.9826299\n11905\t90006\t0.9826283\n11905\t90007\t0.9826283\n11905\t90008\t0.98262525\n11905\t90009\t0.98262537\n11905\t90010\t0.98261803\n11905\t90011\t0.98261666\n11905\t90012\t0.9826253\n11905\t90013\t0.98262084\n11905\t90014\t0.9826183\n11905\t90015\t0.9826223\n13397\t10001\t0.98261964\n13397\t10002\t0.9826228\n13397\t10003\t0.98262274\n13397\t10004\t0.9826237\n13397\t10005\t0.9826259\n13397\t10006\t0.98261964\n13397\t10007\t0.9826255\n13397\t10008\t0.98262286\n13397\t10009\t0.98262596\n13397\t10010\t0.98262304\n13397\t10011\t0.98262817\n13397\t10012\t0.9826203\n13397\t10013\t0.98262167\n13397\t10014\t0.98262066\n13397\t10015\t0.9826241\n13397\t90001\t0.98262084\n13397\t90002\t0.9826205\n13397\t90003\t0.98262453\n13397\t90004\t0.98262274\n13397\t90005\t0.9826302\n13397\t90006\t0.9826286\n13397\t90007\t0.9826286\n13397\t90008\t0.9826255\n13397\t90009\t0.98262566\n13397\t90010\t0.98261833\n13397\t90011\t0.982617\n13397\t90012\t0.9826256\n13397\t90013\t0.9826211\n13397\t90014\t0.9826186\n13397\t90015\t0.9826226\n14806\t10001\t0.98261887\n14806\t10002\t0.982622\n14806\t10003\t0.982622\n14806\t10004\t0.982623\n14806\t10005\t0.9826251\n14806\t10006\t0.9826189\n14806\t10007\t0.9826247\n14806\t10008\t0.98262215\n14806\t10009\t0.9826252\n14806\t10010\t0.9826224\n14806\t10011\t0.98262745\n14806\t10012\t0.9826195\n14806\t10013\t0.98262095\n14806\t10014\t0.98261994\n14806\t10015\t0.98262334\n14806\t90001\t0.9826201\n14806\t90002\t0.9826198\n14806\t90003\t0.9826238\n14806\t90004\t0.982622\n14806\t90005\t0.9826294\n14806\t90006\t0.98262787\n14806\t90007\t0.98262787\n14806\t90008\t0.9826247\n14806\t90009\t0.98262495\n14806\t90010\t0.9826176\n14806\t90011\t0.98261625\n14806\t90012\t0.9826249\n14806\t90013\t0.9826203\n14806\t90014\t0.9826179\n14806\t90015\t0.9826219\n17802\t10001\t0.982621\n17802\t10002\t0.98262423\n17802\t10003\t0.9826242\n17802\t10004\t0.9826251\n17802\t10005\t0.9826274\n17802\t10006\t0.9826211\n17802\t10007\t0.98262686\n17802\t10008\t0.98262435\n17802\t10009\t0.9826274\n17802\t10010\t0.98262453\n17802\t10011\t0.9826296\n17802\t10012\t0.9826218\n17802\t10013\t0.9826231\n17802\t10014\t0.98262215\n17802\t10015\t0.9826255\n17802\t90001\t0.98262227\n17802\t90002\t0.98262197\n17802\t90003\t0.98262596\n17802\t90004\t0.9826242\n17802\t90005\t0.9826316\n17802\t90006\t0.98263\n17802\t90007\t0.98263\n17802\t90008\t0.982627\n17802\t90009\t0.98262715\n17802\t90010\t0.98261976\n17802\t90011\t0.98261845\n17802\t90012\t0.98262703\n17802\t90013\t0.9826225\n17802\t90014\t0.9826201\n17802\t90015\t0.9826241\n17928\t10001\t0.9826237\n17928\t10002\t0.9826269\n17928\t10003\t0.9826268\n17928\t10004\t0.9826279\n17928\t10005\t0.98263013\n17928\t10006\t0.9826238\n17928\t10007\t0.98262966\n17928\t10008\t0.98262703\n17928\t10009\t0.98263\n17928\t10010\t0.9826273\n17928\t10011\t0.9826324\n17928\t10012\t0.98262453\n17928\t10013\t0.98262584\n17928\t10014\t0.98262477\n17928\t10015\t0.9826283\n17928\t90001\t0.982625\n17928\t90002\t0.98262465\n17928\t90003\t0.9826287\n17928\t90004\t0.9826269\n17928\t90005\t0.98263437\n17928\t90006\t0.9826327\n17928\t90007\t0.98263276\n17928\t90008\t0.9826296\n17928\t90009\t0.98262984\n17928\t90010\t0.9826225\n17928\t90011\t0.98262113\n17928\t90012\t0.9826297\n17928\t90013\t0.98262525\n17928\t90014\t0.98262274\n17928\t90015\t0.9826268\n18910\t10001\t0.98261905\n18910\t10002\t0.9826222\n18910\t10003\t0.98262215\n18910\t10004\t0.9826232\n18910\t10005\t0.98262537\n18910\t10006\t0.9826191\n18910\t10007\t0.98262495\n18910\t10008\t0.9826223\n18910\t10009\t0.9826254\n18910\t10010\t0.9826226\n18910\t10011\t0.98262763\n18910\t10012\t0.98261976\n18910\t10013\t0.9826212\n18910\t10014\t0.98262006\n18910\t10015\t0.9826236\n18910\t90001\t0.9826203\n18910\t90002\t0.98262\n18910\t90003\t0.98262405\n18910\t90004\t0.9826222\n18910\t90005\t0.9826296\n18910\t90006\t0.982628\n18910\t90007\t0.98262805\n18910\t90008\t0.982625\n18910\t90009\t0.9826251\n18910\t90010\t0.98261786\n18910\t90011\t0.9826164\n18910\t90012\t0.9826251\n18910\t90013\t0.9826206\n18910\t90014\t0.98261803\n18910\t90015\t0.982622\n19149\t10001\t0.98261863\n19149\t10002\t0.9826218\n19149\t10003\t0.9826217\n19149\t10004\t0.9826228\n19149\t10005\t0.982625\n19149\t10006\t0.9826187\n19149\t10007\t0.9826245\n19149\t10008\t0.9826219\n19149\t10009\t0.98262495\n19149\t10010\t0.98262215\n19149\t10011\t0.9826273\n19149\t10012\t0.98261935\n19149\t10013\t0.9826207\n19149\t10014\t0.9826197\n19149\t10015\t0.9826232\n19149\t90001\t0.9826199\n19149\t90002\t0.98261964\n19149\t90003\t0.98262364\n19149\t90004\t0.9826218\n19149\t90005\t0.98262924\n19149\t90006\t0.9826276\n19149\t90007\t0.98262763\n19149\t90008\t0.98262453\n19149\t90009\t0.98262477\n19149\t90010\t0.9826174\n19149\t90011\t0.9826161\n19149\t90012\t0.98262465\n19149\t90013\t0.9826201\n19149\t90014\t0.98261774\n19149\t90015\t0.98262167\n19186\t10001\t0.9826188\n19186\t10002\t0.982622\n19186\t10003\t0.9826219\n19186\t10004\t0.982623\n19186\t10005\t0.9826252\n19186\t10006\t0.98261887\n19186\t10007\t0.98262477\n19186\t10008\t0.98262215\n19186\t10009\t0.9826251\n19186\t10010\t0.9826223\n19186\t10011\t0.98262745\n19186\t10012\t0.9826196\n19186\t10013\t0.98262095\n19186\t10014\t0.9826199\n19186\t10015\t0.98262334\n19186\t90001\t0.98262006\n19186\t90002\t0.9826198\n19186\t90003\t0.9826238\n19186\t90004\t0.98262197\n19186\t90005\t0.9826294\n19186\t90006\t0.9826278\n19186\t90007\t0.9826278\n19186\t90008\t0.9826247\n19186\t90009\t0.98262495\n19186\t90010\t0.9826175\n19186\t90011\t0.9826163\n19186\t90012\t0.9826248\n19186\t90013\t0.98262024\n19186\t90014\t0.9826179\n19186\t90015\t0.9826219\n19829\t10001\t0.98261917\n19829\t10002\t0.9826224\n19829\t10003\t0.9826222\n19829\t10004\t0.98262334\n19829\t10005\t0.9826255\n19829\t10006\t0.9826192\n19829\t10007\t0.982625\n19829\t10008\t0.9826224\n19829\t10009\t0.98262554\n19829\t10010\t0.9826227\n19829\t10011\t0.98262775\n19829\t10012\t0.9826199\n19829\t10013\t0.9826213\n19829\t10014\t0.98262024\n19829\t10015\t0.98262364\n19829\t90001\t0.9826204\n19829\t90002\t0.9826201\n19829\t90003\t0.9826242\n19829\t90004\t0.9826223\n19829\t90005\t0.9826297\n19829\t90006\t0.9826281\n19829\t90007\t0.9826281\n19829\t90008\t0.98262507\n19829\t90009\t0.98262525\n19829\t90010\t0.9826179\n19829\t90011\t0.9826166\n19829\t90012\t0.9826252\n19829\t90013\t0.9826206\n19829\t90014\t0.9826182\n19829\t90015\t0.98262215\n19901\t10001\t0.9826178\n19901\t10002\t0.98262095\n19901\t10003\t0.98262084\n19901\t10004\t0.9826219\n19901\t10005\t0.9826241\n19901\t10006\t0.98261786\n19901\t10007\t0.98262364\n19901\t10008\t0.9826211\n19901\t10009\t0.9826241\n19901\t10010\t0.9826213\n19901\t10011\t0.98262644\n19901\t10012\t0.98261845\n19901\t10013\t0.9826199\n19901\t10014\t0.9826188\n19901\t10015\t0.9826223\n19901\t90001\t0.98261905\n19901\t90002\t0.98261875\n19901\t90003\t0.98262274\n19901\t90004\t0.98262095\n19901\t90005\t0.9826284\n19901\t90006\t0.9826267\n19901\t90007\t0.98262674\n19901\t90008\t0.9826237\n19901\t90009\t0.98262393\n19901\t90010\t0.98261654\n19901\t90011\t0.98261523\n19901\t90012\t0.9826238\n19901\t90013\t0.9826192\n19901\t90014\t0.9826168\n19901\t90015\t0.98262084\n20269\t10001\t0.9826181\n20269\t10002\t0.9826213\n20269\t10003\t0.9826212\n20269\t10004\t0.9826223\n20269\t10005\t0.98262453\n20269\t10006\t0.9826182\n20269\t10007\t0.98262405\n20269\t10008\t0.98262143\n20269\t10009\t0.9826245\n20269\t10010\t0.98262167\n20269\t10011\t0.9826268\n20269\t10012\t0.98261887\n20269\t10013\t0.9826203\n20269\t10014\t0.9826193\n20269\t10015\t0.98262274\n20269\t90001\t0.9826194\n20269\t90002\t0.9826191\n20269\t90003\t0.98262316\n20269\t90004\t0.98262125\n20269\t90005\t0.9826288\n20269\t90006\t0.98262715\n20269\t90007\t0.98262715\n20269\t90008\t0.98262405\n20269\t90009\t0.9826243\n20269\t90010\t0.98261696\n20269\t90011\t0.9826156\n20269\t90012\t0.9826242\n20269\t90013\t0.9826197\n20269\t90014\t0.9826172\n20269\t90015\t0.98262125\n20599\t10001\t0.9826174\n20599\t10002\t0.9826207\n20599\t10003\t0.9826206\n20599\t10004\t0.9826216\n20599\t10005\t0.9826238\n20599\t10006\t0.9826175\n20599\t10007\t0.98262334\n20599\t10008\t0.9826208\n20599\t10009\t0.9826238\n20599\t10010\t0.982621\n20599\t10011\t0.9826261\n20599\t10012\t0.9826182\n20599\t10013\t0.98261964\n20599\t10014\t0.9826185\n20599\t10015\t0.982622\n20599\t90001\t0.98261875\n20599\t90002\t0.98261845\n20599\t90003\t0.98262244\n20599\t90004\t0.98262066\n20599\t90005\t0.9826281\n20599\t90006\t0.9826265\n20599\t90007\t0.98262644\n20599\t90008\t0.98262334\n20599\t90009\t0.9826236\n20599\t90010\t0.9826162\n20599\t90011\t0.9826149\n20599\t90012\t0.98262346\n20599\t90013\t0.9826189\n20599\t90014\t0.9826165\n20599\t90015\t0.98262054\n21141\t10001\t0.9826184\n21141\t10002\t0.9826216\n21141\t10003\t0.98262143\n21141\t10004\t0.98262256\n21141\t10005\t0.98262477\n21141\t10006\t0.98261845\n21141\t10007\t0.98262435\n21141\t10008\t0.98262167\n21141\t10009\t0.98262477\n21141\t10010\t0.9826219\n21141\t10011\t0.98262703\n21141\t10012\t0.98261917\n21141\t10013\t0.9826205\n21141\t10014\t0.98261946\n21141\t10015\t0.982623\n21141\t90001\t0.98261964\n21141\t90002\t0.98261935\n21141\t90003\t0.98262346\n21141\t90004\t0.9826216\n21141\t90005\t0.982629\n21141\t90006\t0.98262733\n21141\t90007\t0.98262745\n21141\t90008\t0.9826243\n21141\t90009\t0.98262453\n21141\t90010\t0.9826172\n21141\t90011\t0.9826158\n21141\t90012\t0.9826244\n21141\t90013\t0.9826199\n21141\t90014\t0.9826175\n21141\t90015\t0.98262143\n21423\t10001\t0.9826181\n21423\t10002\t0.9826213\n21423\t10003\t0.9826212\n21423\t10004\t0.98262227\n21423\t10005\t0.9826245\n21423\t10006\t0.98261815\n21423\t10007\t0.98262405\n21423\t10008\t0.98262143\n21423\t10009\t0.9826245\n21423\t10010\t0.98262167\n21423\t10011\t0.98262674\n21423\t10012\t0.9826188\n21423\t10013\t0.98262024\n21423\t10014\t0.9826192\n21423\t10015\t0.98262274\n21423\t90001\t0.9826194\n21423\t90002\t0.98261905\n21423\t90003\t0.9826231\n21423\t90004\t0.9826213\n21423\t90005\t0.98262876\n21423\t90006\t0.98262715\n21423\t90007\t0.9826271\n21423\t90008\t0.98262405\n21423\t90009\t0.98262423\n21423\t90010\t0.98261696\n21423\t90011\t0.9826156\n21423\t90012\t0.9826242\n21423\t90013\t0.9826197\n21423\t90014\t0.9826172\n21423\t90015\t0.9826212\n21619\t10001\t0.98261964\n21619\t10002\t0.98262286\n21619\t10003\t0.98262274\n21619\t10004\t0.9826238\n21619\t10005\t0.9826261\n21619\t10006\t0.9826198\n21619\t10007\t0.9826256\n21619\t10008\t0.982623\n21619\t10009\t0.9826261\n21619\t10010\t0.9826232\n21619\t10011\t0.9826283\n21619\t10012\t0.9826204\n21619\t10013\t0.9826219\n21619\t10014\t0.98262084\n21619\t10015\t0.98262423\n21619\t90001\t0.982621\n21619\t90002\t0.9826206\n21619\t90003\t0.9826247\n21619\t90004\t0.98262286\n21619\t90005\t0.98263025\n21619\t90006\t0.9826287\n21619\t90007\t0.9826287\n21619\t90008\t0.9826256\n21619\t90009\t0.9826258\n21619\t90010\t0.98261845\n21619\t90011\t0.98261714\n21619\t90012\t0.9826257\n21619\t90013\t0.9826212\n21619\t90014\t0.98261875\n21619\t90015\t0.98262286\n22945\t10001\t0.98262\n22945\t10002\t0.9826233\n22945\t10003\t0.98262316\n22945\t10004\t0.98262423\n22945\t10005\t0.9826264\n22945\t10006\t0.9826202\n22945\t10007\t0.98262596\n22945\t10008\t0.9826234\n22945\t10009\t0.98262644\n22945\t10010\t0.9826236\n22945\t10011\t0.9826287\n22945\t10012\t0.98262084\n22945\t10013\t0.9826222\n22945\t10014\t0.9826212\n22945\t10015\t0.9826246\n22945\t90001\t0.9826213\n22945\t90002\t0.982621\n22945\t90003\t0.98262507\n22945\t90004\t0.9826232\n22945\t90005\t0.98263067\n22945\t90006\t0.9826291\n22945\t90007\t0.98262906\n22945\t90008\t0.982626\n22945\t90009\t0.9826262\n22945\t90010\t0.98261887\n22945\t90011\t0.9826175\n22945\t90012\t0.9826261\n22945\t90013\t0.9826216\n22945\t90014\t0.9826191\n22945\t90015\t0.98262316\n23393\t10001\t0.98261636\n23393\t10002\t0.98261964\n23393\t10003\t0.9826195\n23393\t10004\t0.9826206\n23393\t10005\t0.98262274\n23393\t10006\t0.9826165\n23393\t10007\t0.98262227\n23393\t10008\t0.9826197\n23393\t10009\t0.98262274\n23393\t10010\t0.98262\n23393\t10011\t0.98262507\n23393\t10012\t0.98261714\n23393\t10013\t0.9826185\n23393\t10014\t0.9826175\n23393\t10015\t0.98262095\n23393\t90001\t0.9826176\n23393\t90002\t0.9826174\n23393\t90003\t0.98262143\n23393\t90004\t0.98261964\n23393\t90005\t0.98262703\n23393\t90006\t0.98262537\n23393\t90007\t0.98262537\n23393\t90008\t0.9826224\n23393\t90009\t0.98262256\n23393\t90010\t0.98261523\n23393\t90011\t0.98261386\n23393\t90012\t0.9826225\n23393\t90013\t0.982618\n23393\t90014\t0.9826155\n23393\t90015\t0.9826195\n23983\t10001\t0.9826198\n23983\t10002\t0.9826231\n23983\t10003\t0.982623\n23983\t10004\t0.98262405\n23983\t10005\t0.9826262\n23983\t10006\t0.98262\n23983\t10007\t0.9826257\n23983\t10008\t0.9826231\n23983\t10009\t0.9826262\n23983\t10010\t0.9826234\n23983\t10011\t0.98262846\n23983\t10012\t0.98262066\n23983\t10013\t0.982622\n23983\t10014\t0.98262095\n23983\t10015\t0.9826244\n23983\t90001\t0.9826212\n23983\t90002\t0.9826208\n23983\t90003\t0.9826249\n23983\t90004\t0.9826231\n23983\t90005\t0.9826305\n23983\t90006\t0.9826289\n23983\t90007\t0.98262894\n23983\t90008\t0.9826258\n23983\t90009\t0.98262596\n23983\t90010\t0.9826187\n23983\t90011\t0.98261726\n23983\t90012\t0.98262596\n23983\t90013\t0.9826214\n23983\t90014\t0.9826189\n23983\t90015\t0.9826229\n24600\t10001\t0.9826166\n24600\t10002\t0.9826198\n24600\t10003\t0.98261976\n24600\t10004\t0.9826207\n24600\t10005\t0.982623\n24600\t10006\t0.98261666\n24600\t10007\t0.9826225\n24600\t10008\t0.98262\n24600\t10009\t0.982623\n24600\t10010\t0.9826201\n24600\t10011\t0.98262525\n24600\t10012\t0.9826174\n24600\t10013\t0.98261875\n24600\t10014\t0.9826177\n24600\t10015\t0.98262113\n24600\t90001\t0.98261786\n24600\t90002\t0.9826176\n24600\t90003\t0.98262155\n24600\t90004\t0.98261976\n24600\t90005\t0.98262715\n24600\t90006\t0.9826256\n24600\t90007\t0.9826256\n24600\t90008\t0.9826225\n24600\t90009\t0.98262274\n24600\t90010\t0.9826154\n24600\t90011\t0.98261404\n24600\t90012\t0.9826226\n24600\t90013\t0.98261815\n24600\t90014\t0.98261565\n24600\t90015\t0.9826197\n25094\t10001\t0.9826174\n25094\t10002\t0.98262054\n25094\t10003\t0.9826205\n25094\t10004\t0.9826216\n25094\t10005\t0.98262376\n25094\t10006\t0.98261744\n25094\t10007\t0.9826233\n25094\t10008\t0.9826207\n25094\t10009\t0.9826237\n25094\t10010\t0.9826209\n25094\t10011\t0.9826261\n25094\t10012\t0.9826181\n25094\t10013\t0.9826195\n25094\t10014\t0.98261845\n25094\t10015\t0.9826219\n25094\t90001\t0.98261863\n25094\t90002\t0.98261833\n25094\t90003\t0.9826224\n25094\t90004\t0.98262054\n25094\t90005\t0.982628\n25094\t90006\t0.9826264\n25094\t90007\t0.9826263\n25094\t90008\t0.9826233\n25094\t90009\t0.9826235\n25094\t90010\t0.9826162\n25094\t90011\t0.9826149\n25094\t90012\t0.9826234\n25094\t90013\t0.9826189\n25094\t90014\t0.9826165\n25094\t90015\t0.9826204\n25237\t10001\t0.9826195\n25237\t10002\t0.9826227\n25237\t10003\t0.98262256\n25237\t10004\t0.9826236\n25237\t10005\t0.9826258\n25237\t10006\t0.9826195\n25237\t10007\t0.98262537\n25237\t10008\t0.98262274\n25237\t10009\t0.98262584\n25237\t10010\t0.982623\n\n\u003cfont color\u003dred\u003eResults are limited by 1000.\u003c/font\u003e"
      },
      "dateCreated": "Jun 3, 2016 10:11:43 PM",
      "dateStarted": "Jun 21, 2016 3:43:31 PM",
      "dateFinished": "Jun 21, 2016 3:43:45 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Enrich the Recommendations",
      "text": "val enrichedRecommendationsDF \u003d \n   recommendationsDF.join(itemsDF, $\"items.itemId\" \u003d\u003d\u003d $\"recommendations.itemId\")\n   .select($\"userId\", $\"items.itemId\", $\"title\", $\"tags\", $\"prediction\", $\"img\")\n   .sort($\"userId\", $\"prediction\" desc, $\"items.itemId\")\n   .na.drop(Seq(\"prediction\"))\n   \nz.show(enrichedRecommendationsDF.select($\"userId\", $\"itemId\", $\"title\", $\"prediction\"))",
      "dateUpdated": "Jun 21, 2016 3:43:28 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 294.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1464987868025_89875713",
      "id": "20160603-210428_1545017316",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\titemId\ttitle\tprediction\n666\t90005\tKeshia Knight Pulliam\t0.9826301\n666\t90007\tAngell Conwell\t0.9826285\n666\t90006\tTatyana Ali\t0.98262846\n666\t10011\tJohn Travolta\t0.9826281\n666\t10005\tJames Gandolfini\t0.9826258\n666\t10009\tChazz Palminteri\t0.9826258\n666\t90009\tPam Grier\t0.98262554\n666\t90012\tStacey Dash\t0.9826255\n666\t10007\tDenzel Washington\t0.9826254\n666\t90008\tShannah Laumeister\t0.98262537\n666\t90003\tRosalind Allen\t0.9826245\n666\t10015\tClive Owen\t0.98262405\n666\t10004\tMorgan Freeman\t0.98262364\n666\t10010\tTom Hanks\t0.982623\n666\t10008\tRobert De Niro\t0.98262274\n666\t10002\tAnthony Hopkins\t0.9826226\n666\t90004\tBobbie Phillips\t0.9826226\n666\t10003\tAl Pacino\t0.98262256\n666\t90015\tBarbara Niven\t0.98262256\n666\t10013\tMark Wahlberg\t0.9826216\n666\t90013\tSofia Vergara\t0.982621\n666\t90001\tLinda Blair\t0.9826207\n666\t10014\tJames Franco\t0.9826206\n666\t90002\tShannon Whirry\t0.98262036\n666\t10012\tJohnny Depp\t0.98262024\n666\t10006\tTom Cruise\t0.9826196\n666\t10001\tLeonardo DiCaprio\t0.9826194\n666\t90014\tGail O\u0027Grady\t0.98261845\n666\t90010\tTiffani Thiessen\t0.9826183\n666\t90011\tAshley Judd\t0.98261684\n671\t90005\tKeshia Knight Pulliam\t0.9826303\n671\t90006\tTatyana Ali\t0.9826287\n671\t90007\tAngell Conwell\t0.98262864\n671\t10011\tJohn Travolta\t0.98262835\n671\t10005\tJames Gandolfini\t0.9826261\n671\t10009\tChazz Palminteri\t0.9826261\n671\t90009\tPam Grier\t0.9826258\n671\t90012\tStacey Dash\t0.9826257\n671\t90008\tShannah Laumeister\t0.9826256\n671\t10007\tDenzel Washington\t0.98262554\n671\t90003\tRosalind Allen\t0.98262465\n671\t10015\tClive Owen\t0.9826243\n671\t10004\tMorgan Freeman\t0.9826238\n671\t10010\tTom Hanks\t0.9826232\n671\t10008\tRobert De Niro\t0.982623\n671\t10002\tAnthony Hopkins\t0.9826229\n671\t90004\tBobbie Phillips\t0.98262286\n671\t10003\tAl Pacino\t0.98262274\n671\t90015\tBarbara Niven\t0.98262274\n671\t10013\tMark Wahlberg\t0.9826218\n671\t90013\tSofia Vergara\t0.9826212\n671\t90001\tLinda Blair\t0.98262095\n671\t10014\tJames Franco\t0.9826208\n671\t90002\tShannon Whirry\t0.98262066\n671\t10012\tJohnny Depp\t0.98262036\n671\t10001\tLeonardo DiCaprio\t0.9826197\n671\t10006\tTom Cruise\t0.9826197\n671\t90014\tGail O\u0027Grady\t0.98261875\n671\t90010\tTiffani Thiessen\t0.98261845\n671\t90011\tAshley Judd\t0.98261714\n2708\t90005\tKeshia Knight Pulliam\t0.9826283\n2708\t90006\tTatyana Ali\t0.9826266\n2708\t90007\tAngell Conwell\t0.9826266\n2708\t10011\tJohn Travolta\t0.9826263\n2708\t10005\tJames Gandolfini\t0.98262405\n2708\t10009\tChazz Palminteri\t0.98262405\n2708\t90009\tPam Grier\t0.98262376\n2708\t90012\tStacey Dash\t0.9826237\n2708\t90008\tShannah Laumeister\t0.9826236\n2708\t10007\tDenzel Washington\t0.9826235\n2708\t90003\tRosalind Allen\t0.9826226\n2708\t10015\tClive Owen\t0.9826222\n2708\t10004\tMorgan Freeman\t0.9826217\n2708\t10010\tTom Hanks\t0.98262113\n2708\t10008\tRobert De Niro\t0.98262095\n2708\t10002\tAnthony Hopkins\t0.98262084\n2708\t90004\tBobbie Phillips\t0.9826208\n2708\t10003\tAl Pacino\t0.9826207\n2708\t90015\tBarbara Niven\t0.9826207\n2708\t10013\tMark Wahlberg\t0.98261976\n2708\t90013\tSofia Vergara\t0.98261917\n2708\t90001\tLinda Blair\t0.9826189\n2708\t10014\tJames Franco\t0.9826187\n2708\t90002\tShannon Whirry\t0.98261863\n2708\t10012\tJohnny Depp\t0.98261833\n2708\t10006\tTom Cruise\t0.9826177\n2708\t10001\tLeonardo DiCaprio\t0.9826176\n2708\t90014\tGail O\u0027Grady\t0.98261666\n2708\t90010\tTiffani Thiessen\t0.9826164\n2708\t90011\tAshley Judd\t0.9826151\n2879\t90005\tKeshia Knight Pulliam\t0.98262733\n2879\t90006\tTatyana Ali\t0.9826257\n2879\t90007\tAngell Conwell\t0.9826257\n2879\t10011\tJohn Travolta\t0.98262537\n2879\t10009\tChazz Palminteri\t0.98262316\n2879\t10005\tJames Gandolfini\t0.9826231\n2879\t90009\tPam Grier\t0.98262286\n2879\t90008\tShannah Laumeister\t0.98262274\n2879\t90012\tStacey Dash\t0.98262274\n2879\t10007\tDenzel Washington\t0.9826227\n2879\t90003\tRosalind Allen\t0.9826217\n2879\t10015\tClive Owen\t0.9826213\n2879\t10004\tMorgan Freeman\t0.9826209\n2879\t10010\tTom Hanks\t0.9826203\n2879\t10008\tRobert De Niro\t0.98262\n2879\t10002\tAnthony Hopkins\t0.9826199\n2879\t90004\tBobbie Phillips\t0.9826199\n2879\t10003\tAl Pacino\t0.9826198\n2879\t90015\tBarbara Niven\t0.98261976\n2879\t10013\tMark Wahlberg\t0.98261887\n2879\t90013\tSofia Vergara\t0.9826183\n2879\t90001\tLinda Blair\t0.98261803\n2879\t10014\tJames Franco\t0.9826178\n2879\t90002\tShannon Whirry\t0.98261774\n2879\t10012\tJohnny Depp\t0.9826175\n2879\t10006\tTom Cruise\t0.9826168\n2879\t10001\tLeonardo DiCaprio\t0.9826167\n2879\t90014\tGail O\u0027Grady\t0.9826158\n2879\t90010\tTiffani Thiessen\t0.98261553\n2879\t90011\tAshley Judd\t0.9826142\n5980\t90005\tKeshia Knight Pulliam\t0.982632\n5980\t90007\tAngell Conwell\t0.98263043\n5980\t90006\tTatyana Ali\t0.9826304\n5980\t10011\tJohn Travolta\t0.98263\n5980\t10009\tChazz Palminteri\t0.9826278\n5980\t10005\tJames Gandolfini\t0.98262775\n5980\t90012\tStacey Dash\t0.9826275\n5980\t90009\tPam Grier\t0.98262745\n5980\t10007\tDenzel Washington\t0.98262733\n5980\t90008\tShannah Laumeister\t0.9826273\n5980\t90003\tRosalind Allen\t0.98262644\n5980\t10015\tClive Owen\t0.98262596\n5980\t10004\tMorgan Freeman\t0.9826256\n5980\t10010\tTom Hanks\t0.98262495\n5980\t10008\tRobert De Niro\t0.98262465\n5980\t10002\tAnthony Hopkins\t0.9826246\n5980\t90004\tBobbie Phillips\t0.9826246\n5980\t10003\tAl Pacino\t0.98262453\n5980\t90015\tBarbara Niven\t0.9826244\n5980\t10013\tMark Wahlberg\t0.9826236\n5980\t90013\tSofia Vergara\t0.9826229\n5980\t90001\tLinda Blair\t0.9826227\n5980\t10014\tJames Franco\t0.9826225\n5980\t90002\tShannon Whirry\t0.9826224\n5980\t10012\tJohnny Depp\t0.98262215\n5980\t10001\tLeonardo DiCaprio\t0.98262143\n5980\t10006\tTom Cruise\t0.98262143\n5980\t90014\tGail O\u0027Grady\t0.9826204\n5980\t90010\tTiffani Thiessen\t0.98262024\n5980\t90011\tAshley Judd\t0.9826188\n5983\t90005\tKeshia Knight Pulliam\t0.9826262\n5983\t90007\tAngell Conwell\t0.98262453\n5983\t90006\tTatyana Ali\t0.9826245\n5983\t10011\tJohn Travolta\t0.98262423\n5983\t10005\tJames Gandolfini\t0.9826219\n5983\t10009\tChazz Palminteri\t0.9826219\n5983\t90009\tPam Grier\t0.98262167\n5983\t90012\tStacey Dash\t0.9826216\n5983\t10007\tDenzel Washington\t0.9826215\n5983\t90008\tShannah Laumeister\t0.98262143\n5983\t90003\tRosalind Allen\t0.9826206\n5983\t10015\tClive Owen\t0.9826201\n5983\t10004\tMorgan Freeman\t0.98261976\n5983\t10010\tTom Hanks\t0.98261905\n5983\t10008\tRobert De Niro\t0.98261887\n5983\t10002\tAnthony Hopkins\t0.98261875\n5983\t10003\tAl Pacino\t0.9826187\n5983\t90004\tBobbie Phillips\t0.9826187\n5983\t90015\tBarbara Niven\t0.98261863\n5983\t10013\tMark Wahlberg\t0.9826176\n5983\t90013\tSofia Vergara\t0.98261714\n5983\t90001\tLinda Blair\t0.9826168\n5983\t10014\tJames Franco\t0.9826166\n5983\t90002\tShannon Whirry\t0.98261654\n5983\t10012\tJohnny Depp\t0.9826163\n5983\t10006\tTom Cruise\t0.9826156\n5983\t10001\tLeonardo DiCaprio\t0.98261553\n5983\t90014\tGail O\u0027Grady\t0.9826146\n5983\t90010\tTiffani Thiessen\t0.9826144\n5983\t90011\tAshley Judd\t0.98261297\n7467\t90005\tKeshia Knight Pulliam\t0.9826303\n7467\t90006\tTatyana Ali\t0.98262864\n7467\t90007\tAngell Conwell\t0.98262864\n7467\t10011\tJohn Travolta\t0.9826283\n7467\t10005\tJames Gandolfini\t0.982626\n7467\t10009\tChazz Palminteri\t0.982626\n7467\t90009\tPam Grier\t0.9826258\n7467\t90012\tStacey Dash\t0.9826257\n7467\t10007\tDenzel Washington\t0.9826256\n7467\t90008\tShannah Laumeister\t0.9826256\n7467\t90003\tRosalind Allen\t0.98262465\n7467\t10015\tClive Owen\t0.9826243\n7467\t10004\tMorgan Freeman\t0.9826239\n7467\t10010\tTom Hanks\t0.98262316\n7467\t10008\tRobert De Niro\t0.982623\n7467\t10002\tAnthony Hopkins\t0.98262286\n7467\t10003\tAl Pacino\t0.9826228\n7467\t90004\tBobbie Phillips\t0.9826228\n7467\t90015\tBarbara Niven\t0.98262274\n7467\t10013\tMark Wahlberg\t0.9826218\n7467\t90013\tSofia Vergara\t0.9826212\n7467\t90001\tLinda Blair\t0.9826209\n7467\t10014\tJames Franco\t0.9826207\n7467\t90002\tShannon Whirry\t0.9826206\n7467\t10012\tJohnny Depp\t0.98262036\n7467\t10006\tTom Cruise\t0.9826197\n7467\t10001\tLeonardo DiCaprio\t0.98261964\n7467\t90014\tGail O\u0027Grady\t0.9826187\n7467\t90010\tTiffani Thiessen\t0.9826185\n7467\t90011\tAshley Judd\t0.9826171\n7726\t90005\tKeshia Knight Pulliam\t0.9826295\n7726\t90007\tAngell Conwell\t0.9826278\n7726\t90006\tTatyana Ali\t0.98262775\n7726\t10011\tJohn Travolta\t0.9826274\n7726\t10005\tJames Gandolfini\t0.9826251\n7726\t10009\tChazz Palminteri\t0.9826251\n7726\t90009\tPam Grier\t0.98262495\n7726\t90012\tStacey Dash\t0.9826248\n7726\t10007\tDenzel Washington\t0.9826247\n7726\t90008\tShannah Laumeister\t0.9826247\n7726\t90003\tRosalind Allen\t0.98262376\n7726\t10015\tClive Owen\t0.98262334\n7726\t10004\tMorgan Freeman\t0.98262286\n7726\t10010\tTom Hanks\t0.98262227\n7726\t10008\tRobert De Niro\t0.98262215\n7726\t90004\tBobbie Phillips\t0.982622\n7726\t10002\tAnthony Hopkins\t0.98262197\n7726\t10003\tAl Pacino\t0.9826219\n7726\t90015\tBarbara Niven\t0.9826219\n7726\t10013\tMark Wahlberg\t0.98262095\n7726\t90013\tSofia Vergara\t0.9826203\n7726\t90001\tLinda Blair\t0.98262\n7726\t10014\tJames Franco\t0.9826199\n7726\t90002\tShannon Whirry\t0.9826198\n7726\t10012\tJohnny Depp\t0.9826195\n7726\t10006\tTom Cruise\t0.98261887\n7726\t10001\tLeonardo DiCaprio\t0.9826188\n7726\t90014\tGail O\u0027Grady\t0.98261786\n7726\t90010\tTiffani Thiessen\t0.98261756\n7726\t90011\tAshley Judd\t0.9826162\n9040\t90005\tKeshia Knight Pulliam\t0.9826289\n9040\t90006\tTatyana Ali\t0.9826272\n9040\t90007\tAngell Conwell\t0.98262715\n9040\t10011\tJohn Travolta\t0.9826268\n9040\t10009\tChazz Palminteri\t0.9826246\n9040\t10005\tJames Gandolfini\t0.98262453\n9040\t90009\tPam Grier\t0.98262435\n9040\t90012\tStacey Dash\t0.9826243\n9040\t10007\tDenzel Washington\t0.98262405\n9040\t90008\tShannah Laumeister\t0.98262405\n9040\t90003\tRosalind Allen\t0.98262316\n9040\t10015\tClive Owen\t0.98262274\n9040\t10004\tMorgan Freeman\t0.9826224\n9040\t10010\tTom Hanks\t0.9826217\n9040\t10008\tRobert De Niro\t0.98262155\n9040\t10002\tAnthony Hopkins\t0.9826214\n9040\t90004\tBobbie Phillips\t0.9826214\n9040\t10003\tAl Pacino\t0.9826213\n9040\t90015\tBarbara Niven\t0.9826213\n9040\t10013\tMark Wahlberg\t0.98262036\n9040\t90013\tSofia Vergara\t0.98261976\n9040\t90001\tLinda Blair\t0.98261946\n9040\t10014\tJames Franco\t0.9826193\n9040\t90002\tShannon Whirry\t0.98261917\n9040\t10012\tJohnny Depp\t0.9826189\n9040\t10006\tTom Cruise\t0.9826183\n9040\t10001\tLeonardo DiCaprio\t0.98261815\n9040\t90014\tGail O\u0027Grady\t0.98261726\n9040\t90010\tTiffani Thiessen\t0.9826169\n9040\t90011\tAshley Judd\t0.98261565\n9773\t90005\tKeshia Knight Pulliam\t0.9826304\n9773\t90007\tAngell Conwell\t0.9826287\n9773\t90006\tTatyana Ali\t0.98262864\n9773\t10011\tJohn Travolta\t0.98262835\n9773\t10005\tJames Gandolfini\t0.9826261\n9773\t10009\tChazz Palminteri\t0.9826261\n9773\t90009\tPam Grier\t0.98262584\n9773\t90012\tStacey Dash\t0.9826257\n9773\t10007\tDenzel Washington\t0.9826256\n9773\t90008\tShannah Laumeister\t0.9826256\n9773\t90003\tRosalind Allen\t0.98262465\n9773\t10015\tClive Owen\t0.9826243\n9773\t10004\tMorgan Freeman\t0.9826239\n9773\t10010\tTom Hanks\t0.9826232\n9773\t10008\tRobert De Niro\t0.98262304\n9773\t10002\tAnthony Hopkins\t0.9826229\n9773\t90004\tBobbie Phillips\t0.98262286\n9773\t10003\tAl Pacino\t0.9826228\n9773\t90015\tBarbara Niven\t0.9826228\n9773\t10013\tMark Wahlberg\t0.98262185\n9773\t90013\tSofia Vergara\t0.9826212\n9773\t90001\tLinda Blair\t0.98262095\n9773\t10014\tJames Franco\t0.9826208\n9773\t90002\tShannon Whirry\t0.98262066\n9773\t10012\tJohnny Depp\t0.9826204\n9773\t10006\tTom Cruise\t0.98261976\n9773\t10001\tLeonardo DiCaprio\t0.98261964\n9773\t90014\tGail O\u0027Grady\t0.98261875\n9773\t90010\tTiffani Thiessen\t0.98261845\n9773\t90011\tAshley Judd\t0.98261714\n10198\t90005\tKeshia Knight Pulliam\t0.9826289\n10198\t90006\tTatyana Ali\t0.9826272\n10198\t90007\tAngell Conwell\t0.9826272\n10198\t10011\tJohn Travolta\t0.9826268\n10198\t10005\tJames Gandolfini\t0.9826246\n10198\t10009\tChazz Palminteri\t0.9826246\n10198\t90009\tPam Grier\t0.98262435\n10198\t90012\tStacey Dash\t0.9826243\n10198\t90008\tShannah Laumeister\t0.9826242\n10198\t10007\tDenzel Washington\t0.98262405\n10198\t90003\tRosalind Allen\t0.98262316\n10198\t10015\tClive Owen\t0.98262274\n10198\t10004\tMorgan Freeman\t0.9826224\n10198\t10010\tTom Hanks\t0.9826217\n10198\t10008\tRobert De Niro\t0.98262155\n10198\t10002\tAnthony Hopkins\t0.98262143\n10198\t90004\tBobbie Phillips\t0.9826214\n10198\t10003\tAl Pacino\t0.9826213\n10198\t90015\tBarbara Niven\t0.9826213\n10198\t10013\tMark Wahlberg\t0.98262036\n10198\t90013\tSofia Vergara\t0.98261976\n10198\t90001\tLinda Blair\t0.98261946\n10198\t10014\tJames Franco\t0.9826193\n10198\t90002\tShannon Whirry\t0.98261917\n10198\t10012\tJohnny Depp\t0.9826189\n10198\t10006\tTom Cruise\t0.9826183\n10198\t10001\tLeonardo DiCaprio\t0.9826182\n10198\t90014\tGail O\u0027Grady\t0.98261726\n10198\t90010\tTiffani Thiessen\t0.982617\n10198\t90011\tAshley Judd\t0.98261565\n10469\t90005\tKeshia Knight Pulliam\t0.98262733\n10469\t90006\tTatyana Ali\t0.9826257\n10469\t90007\tAngell Conwell\t0.9826257\n10469\t10011\tJohn Travolta\t0.98262537\n10469\t10009\tChazz Palminteri\t0.9826231\n10469\t10005\tJames Gandolfini\t0.98262304\n10469\t90009\tPam Grier\t0.98262286\n10469\t90012\tStacey Dash\t0.98262274\n10469\t10007\tDenzel Washington\t0.9826226\n10469\t90008\tShannah Laumeister\t0.9826226\n10469\t90003\tRosalind Allen\t0.9826217\n10469\t10015\tClive Owen\t0.98262125\n10469\t10004\tMorgan Freeman\t0.9826209\n10469\t10010\tTom Hanks\t0.98262024\n10469\t10008\tRobert De Niro\t0.98262\n10469\t10002\tAnthony Hopkins\t0.98261994\n10469\t90004\tBobbie Phillips\t0.9826199\n10469\t10003\tAl Pacino\t0.98261976\n10469\t90015\tBarbara Niven\t0.98261976\n10469\t10013\tMark Wahlberg\t0.9826189\n10469\t90013\tSofia Vergara\t0.9826182\n10469\t90001\tLinda Blair\t0.982618\n10469\t10014\tJames Franco\t0.98261774\n10469\t90002\tShannon Whirry\t0.9826177\n10469\t10012\tJohnny Depp\t0.98261744\n10469\t10006\tTom Cruise\t0.98261684\n10469\t10001\tLeonardo DiCaprio\t0.9826167\n10469\t90014\tGail O\u0027Grady\t0.98261577\n10469\t90010\tTiffani Thiessen\t0.9826155\n10469\t90011\tAshley Judd\t0.98261416\n10921\t90005\tKeshia Knight Pulliam\t0.9826268\n10921\t90006\tTatyana Ali\t0.9826251\n10921\t90007\tAngell Conwell\t0.9826251\n10921\t10011\tJohn Travolta\t0.98262477\n10921\t10005\tJames Gandolfini\t0.9826225\n10921\t10009\tChazz Palminteri\t0.9826225\n10921\t90009\tPam Grier\t0.98262227\n10921\t90012\tStacey Dash\t0.98262215\n10921\t10007\tDenzel Washington\t0.982622\n10921\t90008\tShannah Laumeister\t0.982622\n10921\t90003\tRosalind Allen\t0.9826212\n10921\t10015\tClive Owen\t0.98262066\n10921\t10004\tMorgan Freeman\t0.9826203\n10921\t10010\tTom Hanks\t0.98261964\n10921\t10008\tRobert De Niro\t0.98261946\n10921\t10002\tAnthony Hopkins\t0.9826194\n10921\t90004\tBobbie Phillips\t0.98261935\n10921\t10003\tAl Pacino\t0.9826193\n10921\t90015\tBarbara Niven\t0.9826192\n10921\t10013\tMark Wahlberg\t0.9826182\n10921\t90013\tSofia Vergara\t0.9826176\n10921\t90001\tLinda Blair\t0.98261744\n10921\t10014\tJames Franco\t0.9826172\n10921\t90002\tShannon Whirry\t0.98261714\n10921\t10012\tJohnny Depp\t0.9826169\n10921\t10001\tLeonardo DiCaprio\t0.9826162\n10921\t10006\tTom Cruise\t0.9826162\n10921\t90014\tGail O\u0027Grady\t0.9826152\n10921\t90010\tTiffani Thiessen\t0.9826149\n10921\t90011\tAshley Judd\t0.98261356\n11905\t90005\tKeshia Knight Pulliam\t0.9826299\n11905\t90006\tTatyana Ali\t0.9826283\n11905\t90007\tAngell Conwell\t0.9826283\n11905\t10011\tJohn Travolta\t0.9826279\n11905\t10005\tJames Gandolfini\t0.98262566\n11905\t10009\tChazz Palminteri\t0.9826256\n11905\t90009\tPam Grier\t0.98262537\n11905\t90012\tStacey Dash\t0.9826253\n11905\t90008\tShannah Laumeister\t0.98262525\n11905\t10007\tDenzel Washington\t0.9826251\n11905\t90003\tRosalind Allen\t0.9826243\n11905\t10015\tClive Owen\t0.9826238\n11905\t10004\tMorgan Freeman\t0.9826234\n11905\t10010\tTom Hanks\t0.98262286\n11905\t10008\tRobert De Niro\t0.98262256\n11905\t10002\tAnthony Hopkins\t0.9826225\n11905\t90004\tBobbie Phillips\t0.9826225\n11905\t10003\tAl Pacino\t0.9826223\n11905\t90015\tBarbara Niven\t0.9826223\n11905\t10013\tMark Wahlberg\t0.98262143\n11905\t90013\tSofia Vergara\t0.98262084\n11905\t90001\tLinda Blair\t0.9826206\n11905\t10014\tJames Franco\t0.98262036\n11905\t90002\tShannon Whirry\t0.98262024\n11905\t10012\tJohnny Depp\t0.98262\n11905\t10006\tTom Cruise\t0.9826194\n11905\t10001\tLeonardo DiCaprio\t0.9826192\n11905\t90014\tGail O\u0027Grady\t0.9826183\n11905\t90010\tTiffani Thiessen\t0.98261803\n11905\t90011\tAshley Judd\t0.98261666\n13397\t90005\tKeshia Knight Pulliam\t0.9826302\n13397\t90006\tTatyana Ali\t0.9826286\n13397\t90007\tAngell Conwell\t0.9826286\n13397\t10011\tJohn Travolta\t0.98262817\n13397\t10009\tChazz Palminteri\t0.98262596\n13397\t10005\tJames Gandolfini\t0.9826259\n13397\t90009\tPam Grier\t0.98262566\n13397\t90012\tStacey Dash\t0.9826256\n13397\t10007\tDenzel Washington\t0.9826255\n13397\t90008\tShannah Laumeister\t0.9826255\n13397\t90003\tRosalind Allen\t0.98262453\n13397\t10015\tClive Owen\t0.9826241\n13397\t10004\tMorgan Freeman\t0.9826237\n13397\t10010\tTom Hanks\t0.98262304\n13397\t10008\tRobert De Niro\t0.98262286\n13397\t10002\tAnthony Hopkins\t0.9826228\n13397\t10003\tAl Pacino\t0.98262274\n13397\t90004\tBobbie Phillips\t0.98262274\n13397\t90015\tBarbara Niven\t0.9826226\n13397\t10013\tMark Wahlberg\t0.98262167\n13397\t90013\tSofia Vergara\t0.9826211\n13397\t90001\tLinda Blair\t0.98262084\n13397\t10014\tJames Franco\t0.98262066\n13397\t90002\tShannon Whirry\t0.9826205\n13397\t10012\tJohnny Depp\t0.9826203\n13397\t10001\tLeonardo DiCaprio\t0.98261964\n13397\t10006\tTom Cruise\t0.98261964\n13397\t90014\tGail O\u0027Grady\t0.9826186\n13397\t90010\tTiffani Thiessen\t0.98261833\n13397\t90011\tAshley Judd\t0.982617\n14806\t90005\tKeshia Knight Pulliam\t0.9826294\n14806\t90006\tTatyana Ali\t0.98262787\n14806\t90007\tAngell Conwell\t0.98262787\n14806\t10011\tJohn Travolta\t0.98262745\n14806\t10009\tChazz Palminteri\t0.9826252\n14806\t10005\tJames Gandolfini\t0.9826251\n14806\t90009\tPam Grier\t0.98262495\n14806\t90012\tStacey Dash\t0.9826249\n14806\t10007\tDenzel Washington\t0.9826247\n14806\t90008\tShannah Laumeister\t0.9826247\n14806\t90003\tRosalind Allen\t0.9826238\n14806\t10015\tClive Owen\t0.98262334\n14806\t10004\tMorgan Freeman\t0.982623\n14806\t10010\tTom Hanks\t0.9826224\n14806\t10008\tRobert De Niro\t0.98262215\n14806\t10002\tAnthony Hopkins\t0.982622\n14806\t10003\tAl Pacino\t0.982622\n14806\t90004\tBobbie Phillips\t0.982622\n14806\t90015\tBarbara Niven\t0.9826219\n14806\t10013\tMark Wahlberg\t0.98262095\n14806\t90013\tSofia Vergara\t0.9826203\n14806\t90001\tLinda Blair\t0.9826201\n14806\t10014\tJames Franco\t0.98261994\n14806\t90002\tShannon Whirry\t0.9826198\n14806\t10012\tJohnny Depp\t0.9826195\n14806\t10006\tTom Cruise\t0.9826189\n14806\t10001\tLeonardo DiCaprio\t0.98261887\n14806\t90014\tGail O\u0027Grady\t0.9826179\n14806\t90010\tTiffani Thiessen\t0.9826176\n14806\t90011\tAshley Judd\t0.98261625\n17802\t90005\tKeshia Knight Pulliam\t0.9826316\n17802\t90006\tTatyana Ali\t0.98263\n17802\t90007\tAngell Conwell\t0.98263\n17802\t10011\tJohn Travolta\t0.9826296\n17802\t10005\tJames Gandolfini\t0.9826274\n17802\t10009\tChazz Palminteri\t0.9826274\n17802\t90009\tPam Grier\t0.98262715\n17802\t90012\tStacey Dash\t0.98262703\n17802\t90008\tShannah Laumeister\t0.982627\n17802\t10007\tDenzel Washington\t0.98262686\n17802\t90003\tRosalind Allen\t0.98262596\n17802\t10015\tClive Owen\t0.9826255\n17802\t10004\tMorgan Freeman\t0.9826251\n17802\t10010\tTom Hanks\t0.98262453\n17802\t10008\tRobert De Niro\t0.98262435\n17802\t10002\tAnthony Hopkins\t0.98262423\n17802\t10003\tAl Pacino\t0.9826242\n17802\t90004\tBobbie Phillips\t0.9826242\n17802\t90015\tBarbara Niven\t0.9826241\n17802\t10013\tMark Wahlberg\t0.9826231\n17802\t90013\tSofia Vergara\t0.9826225\n17802\t90001\tLinda Blair\t0.98262227\n17802\t10014\tJames Franco\t0.98262215\n17802\t90002\tShannon Whirry\t0.98262197\n17802\t10012\tJohnny Depp\t0.9826218\n17802\t10006\tTom Cruise\t0.9826211\n17802\t10001\tLeonardo DiCaprio\t0.982621\n17802\t90014\tGail O\u0027Grady\t0.9826201\n17802\t90010\tTiffani Thiessen\t0.98261976\n17802\t90011\tAshley Judd\t0.98261845\n17928\t90005\tKeshia Knight Pulliam\t0.98263437\n17928\t90007\tAngell Conwell\t0.98263276\n17928\t90006\tTatyana Ali\t0.9826327\n17928\t10011\tJohn Travolta\t0.9826324\n17928\t10005\tJames Gandolfini\t0.98263013\n17928\t10009\tChazz Palminteri\t0.98263\n17928\t90009\tPam Grier\t0.98262984\n17928\t90012\tStacey Dash\t0.9826297\n17928\t10007\tDenzel Washington\t0.98262966\n17928\t90008\tShannah Laumeister\t0.9826296\n17928\t90003\tRosalind Allen\t0.9826287\n17928\t10015\tClive Owen\t0.9826283\n17928\t10004\tMorgan Freeman\t0.9826279\n17928\t10010\tTom Hanks\t0.9826273\n17928\t10008\tRobert De Niro\t0.98262703\n17928\t10002\tAnthony Hopkins\t0.9826269\n17928\t90004\tBobbie Phillips\t0.9826269\n17928\t10003\tAl Pacino\t0.9826268\n17928\t90015\tBarbara Niven\t0.9826268\n17928\t10013\tMark Wahlberg\t0.98262584\n17928\t90013\tSofia Vergara\t0.98262525\n17928\t90001\tLinda Blair\t0.982625\n17928\t10014\tJames Franco\t0.98262477\n17928\t90002\tShannon Whirry\t0.98262465\n17928\t10012\tJohnny Depp\t0.98262453\n17928\t10006\tTom Cruise\t0.9826238\n17928\t10001\tLeonardo DiCaprio\t0.9826237\n17928\t90014\tGail O\u0027Grady\t0.98262274\n17928\t90010\tTiffani Thiessen\t0.9826225\n17928\t90011\tAshley Judd\t0.98262113\n18910\t90005\tKeshia Knight Pulliam\t0.9826296\n18910\t90007\tAngell Conwell\t0.98262805\n18910\t90006\tTatyana Ali\t0.982628\n18910\t10011\tJohn Travolta\t0.98262763\n18910\t10009\tChazz Palminteri\t0.9826254\n18910\t10005\tJames Gandolfini\t0.98262537\n18910\t90009\tPam Grier\t0.9826251\n18910\t90012\tStacey Dash\t0.9826251\n18910\t90008\tShannah Laumeister\t0.982625\n18910\t10007\tDenzel Washington\t0.98262495\n18910\t90003\tRosalind Allen\t0.98262405\n18910\t10015\tClive Owen\t0.9826236\n18910\t10004\tMorgan Freeman\t0.9826232\n18910\t10010\tTom Hanks\t0.9826226\n18910\t10008\tRobert De Niro\t0.9826223\n18910\t10002\tAnthony Hopkins\t0.9826222\n18910\t90004\tBobbie Phillips\t0.9826222\n18910\t10003\tAl Pacino\t0.98262215\n18910\t90015\tBarbara Niven\t0.982622\n18910\t10013\tMark Wahlberg\t0.9826212\n18910\t90013\tSofia Vergara\t0.9826206\n18910\t90001\tLinda Blair\t0.9826203\n18910\t10014\tJames Franco\t0.98262006\n18910\t90002\tShannon Whirry\t0.98262\n18910\t10012\tJohnny Depp\t0.98261976\n18910\t10006\tTom Cruise\t0.9826191\n18910\t10001\tLeonardo DiCaprio\t0.98261905\n18910\t90014\tGail O\u0027Grady\t0.98261803\n18910\t90010\tTiffani Thiessen\t0.98261786\n18910\t90011\tAshley Judd\t0.9826164\n19149\t90005\tKeshia Knight Pulliam\t0.98262924\n19149\t90007\tAngell Conwell\t0.98262763\n19149\t90006\tTatyana Ali\t0.9826276\n19149\t10011\tJohn Travolta\t0.9826273\n19149\t10005\tJames Gandolfini\t0.982625\n19149\t10009\tChazz Palminteri\t0.98262495\n19149\t90009\tPam Grier\t0.98262477\n19149\t90012\tStacey Dash\t0.98262465\n19149\t90008\tShannah Laumeister\t0.98262453\n19149\t10007\tDenzel Washington\t0.9826245\n19149\t90003\tRosalind Allen\t0.98262364\n19149\t10015\tClive Owen\t0.9826232\n19149\t10004\tMorgan Freeman\t0.9826228\n19149\t10010\tTom Hanks\t0.98262215\n19149\t10008\tRobert De Niro\t0.9826219\n19149\t10002\tAnthony Hopkins\t0.9826218\n19149\t90004\tBobbie Phillips\t0.9826218\n19149\t10003\tAl Pacino\t0.9826217\n19149\t90015\tBarbara Niven\t0.98262167\n19149\t10013\tMark Wahlberg\t0.9826207\n19149\t90013\tSofia Vergara\t0.9826201\n19149\t90001\tLinda Blair\t0.9826199\n19149\t10014\tJames Franco\t0.9826197\n19149\t90002\tShannon Whirry\t0.98261964\n19149\t10012\tJohnny Depp\t0.98261935\n19149\t10006\tTom Cruise\t0.9826187\n19149\t10001\tLeonardo DiCaprio\t0.98261863\n19149\t90014\tGail O\u0027Grady\t0.98261774\n19149\t90010\tTiffani Thiessen\t0.9826174\n19149\t90011\tAshley Judd\t0.9826161\n19186\t90005\tKeshia Knight Pulliam\t0.9826294\n19186\t90006\tTatyana Ali\t0.9826278\n19186\t90007\tAngell Conwell\t0.9826278\n19186\t10011\tJohn Travolta\t0.98262745\n19186\t10005\tJames Gandolfini\t0.9826252\n19186\t10009\tChazz Palminteri\t0.9826251\n19186\t90009\tPam Grier\t0.98262495\n19186\t90012\tStacey Dash\t0.9826248\n19186\t10007\tDenzel Washington\t0.98262477\n19186\t90008\tShannah Laumeister\t0.9826247\n19186\t90003\tRosalind Allen\t0.9826238\n19186\t10015\tClive Owen\t0.98262334\n19186\t10004\tMorgan Freeman\t0.982623\n19186\t10010\tTom Hanks\t0.9826223\n19186\t10008\tRobert De Niro\t0.98262215\n19186\t10002\tAnthony Hopkins\t0.982622\n19186\t90004\tBobbie Phillips\t0.98262197\n19186\t10003\tAl Pacino\t0.9826219\n19186\t90015\tBarbara Niven\t0.9826219\n19186\t10013\tMark Wahlberg\t0.98262095\n19186\t90013\tSofia Vergara\t0.98262024\n19186\t90001\tLinda Blair\t0.98262006\n19186\t10014\tJames Franco\t0.9826199\n19186\t90002\tShannon Whirry\t0.9826198\n19186\t10012\tJohnny Depp\t0.9826196\n19186\t10006\tTom Cruise\t0.98261887\n19186\t10001\tLeonardo DiCaprio\t0.9826188\n19186\t90014\tGail O\u0027Grady\t0.9826179\n19186\t90010\tTiffani Thiessen\t0.9826175\n19186\t90011\tAshley Judd\t0.9826163\n19829\t90005\tKeshia Knight Pulliam\t0.9826297\n19829\t90006\tTatyana Ali\t0.9826281\n19829\t90007\tAngell Conwell\t0.9826281\n19829\t10011\tJohn Travolta\t0.98262775\n19829\t10009\tChazz Palminteri\t0.98262554\n19829\t10005\tJames Gandolfini\t0.9826255\n19829\t90009\tPam Grier\t0.98262525\n19829\t90012\tStacey Dash\t0.9826252\n19829\t90008\tShannah Laumeister\t0.98262507\n19829\t10007\tDenzel Washington\t0.982625\n19829\t90003\tRosalind Allen\t0.9826242\n19829\t10015\tClive Owen\t0.98262364\n19829\t10004\tMorgan Freeman\t0.98262334\n19829\t10010\tTom Hanks\t0.9826227\n19829\t10002\tAnthony Hopkins\t0.9826224\n19829\t10008\tRobert De Niro\t0.9826224\n19829\t90004\tBobbie Phillips\t0.9826223\n19829\t10003\tAl Pacino\t0.9826222\n19829\t90015\tBarbara Niven\t0.98262215\n19829\t10013\tMark Wahlberg\t0.9826213\n19829\t90013\tSofia Vergara\t0.9826206\n19829\t90001\tLinda Blair\t0.9826204\n19829\t10014\tJames Franco\t0.98262024\n19829\t90002\tShannon Whirry\t0.9826201\n19829\t10012\tJohnny Depp\t0.9826199\n19829\t10006\tTom Cruise\t0.9826192\n19829\t10001\tLeonardo DiCaprio\t0.98261917\n19829\t90014\tGail O\u0027Grady\t0.9826182\n19829\t90010\tTiffani Thiessen\t0.9826179\n19829\t90011\tAshley Judd\t0.9826166\n19901\t90005\tKeshia Knight Pulliam\t0.9826284\n19901\t90007\tAngell Conwell\t0.98262674\n19901\t90006\tTatyana Ali\t0.9826267\n19901\t10011\tJohn Travolta\t0.98262644\n19901\t10005\tJames Gandolfini\t0.9826241\n19901\t10009\tChazz Palminteri\t0.9826241\n19901\t90009\tPam Grier\t0.98262393\n19901\t90012\tStacey Dash\t0.9826238\n19901\t90008\tShannah Laumeister\t0.9826237\n19901\t10007\tDenzel Washington\t0.98262364\n19901\t90003\tRosalind Allen\t0.98262274\n19901\t10015\tClive Owen\t0.9826223\n19901\t10004\tMorgan Freeman\t0.9826219\n19901\t10010\tTom Hanks\t0.9826213\n19901\t10008\tRobert De Niro\t0.9826211\n19901\t10002\tAnthony Hopkins\t0.98262095\n19901\t90004\tBobbie Phillips\t0.98262095\n19901\t10003\tAl Pacino\t0.98262084\n19901\t90015\tBarbara Niven\t0.98262084\n19901\t10013\tMark Wahlberg\t0.9826199\n19901\t90013\tSofia Vergara\t0.9826192\n19901\t90001\tLinda Blair\t0.98261905\n19901\t10014\tJames Franco\t0.9826188\n19901\t90002\tShannon Whirry\t0.98261875\n19901\t10012\tJohnny Depp\t0.98261845\n19901\t10006\tTom Cruise\t0.98261786\n19901\t10001\tLeonardo DiCaprio\t0.9826178\n19901\t90014\tGail O\u0027Grady\t0.9826168\n19901\t90010\tTiffani Thiessen\t0.98261654\n19901\t90011\tAshley Judd\t0.98261523\n20269\t90005\tKeshia Knight Pulliam\t0.9826288\n20269\t90006\tTatyana Ali\t0.98262715\n20269\t90007\tAngell Conwell\t0.98262715\n20269\t10011\tJohn Travolta\t0.9826268\n20269\t10005\tJames Gandolfini\t0.98262453\n20269\t10009\tChazz Palminteri\t0.9826245\n20269\t90009\tPam Grier\t0.9826243\n20269\t90012\tStacey Dash\t0.9826242\n20269\t10007\tDenzel Washington\t0.98262405\n20269\t90008\tShannah Laumeister\t0.98262405\n20269\t90003\tRosalind Allen\t0.98262316\n20269\t10015\tClive Owen\t0.98262274\n20269\t10004\tMorgan Freeman\t0.9826223\n20269\t10010\tTom Hanks\t0.98262167\n20269\t10008\tRobert De Niro\t0.98262143\n20269\t10002\tAnthony Hopkins\t0.9826213\n20269\t90004\tBobbie Phillips\t0.98262125\n20269\t90015\tBarbara Niven\t0.98262125\n20269\t10003\tAl Pacino\t0.9826212\n20269\t10013\tMark Wahlberg\t0.9826203\n20269\t90013\tSofia Vergara\t0.9826197\n20269\t90001\tLinda Blair\t0.9826194\n20269\t10014\tJames Franco\t0.9826193\n20269\t90002\tShannon Whirry\t0.9826191\n20269\t10012\tJohnny Depp\t0.98261887\n20269\t10006\tTom Cruise\t0.9826182\n20269\t10001\tLeonardo DiCaprio\t0.9826181\n20269\t90014\tGail O\u0027Grady\t0.9826172\n20269\t90010\tTiffani Thiessen\t0.98261696\n20269\t90011\tAshley Judd\t0.9826156\n20599\t90005\tKeshia Knight Pulliam\t0.9826281\n20599\t90006\tTatyana Ali\t0.9826265\n20599\t90007\tAngell Conwell\t0.98262644\n20599\t10011\tJohn Travolta\t0.9826261\n20599\t10005\tJames Gandolfini\t0.9826238\n20599\t10009\tChazz Palminteri\t0.9826238\n20599\t90009\tPam Grier\t0.9826236\n20599\t90012\tStacey Dash\t0.98262346\n20599\t10007\tDenzel Washington\t0.98262334\n20599\t90008\tShannah Laumeister\t0.98262334\n20599\t90003\tRosalind Allen\t0.98262244\n20599\t10015\tClive Owen\t0.982622\n20599\t10004\tMorgan Freeman\t0.9826216\n20599\t10010\tTom Hanks\t0.982621\n20599\t10008\tRobert De Niro\t0.9826208\n20599\t10002\tAnthony Hopkins\t0.9826207\n20599\t90004\tBobbie Phillips\t0.98262066\n20599\t10003\tAl Pacino\t0.9826206\n20599\t90015\tBarbara Niven\t0.98262054\n20599\t10013\tMark Wahlberg\t0.98261964\n20599\t90013\tSofia Vergara\t0.9826189\n20599\t90001\tLinda Blair\t0.98261875\n20599\t10014\tJames Franco\t0.9826185\n20599\t90002\tShannon Whirry\t0.98261845\n20599\t10012\tJohnny Depp\t0.9826182\n20599\t10006\tTom Cruise\t0.9826175\n20599\t10001\tLeonardo DiCaprio\t0.9826174\n20599\t90014\tGail O\u0027Grady\t0.9826165\n20599\t90010\tTiffani Thiessen\t0.9826162\n20599\t90011\tAshley Judd\t0.9826149\n21141\t90005\tKeshia Knight Pulliam\t0.982629\n21141\t90007\tAngell Conwell\t0.98262745\n21141\t90006\tTatyana Ali\t0.98262733\n21141\t10011\tJohn Travolta\t0.98262703\n21141\t10005\tJames Gandolfini\t0.98262477\n21141\t10009\tChazz Palminteri\t0.98262477\n21141\t90009\tPam Grier\t0.98262453\n21141\t90012\tStacey Dash\t0.9826244\n21141\t10007\tDenzel Washington\t0.98262435\n21141\t90008\tShannah Laumeister\t0.9826243\n21141\t90003\tRosalind Allen\t0.98262346\n21141\t10015\tClive Owen\t0.982623\n21141\t10004\tMorgan Freeman\t0.98262256\n21141\t10010\tTom Hanks\t0.9826219\n21141\t10008\tRobert De Niro\t0.98262167\n21141\t10002\tAnthony Hopkins\t0.9826216\n21141\t90004\tBobbie Phillips\t0.9826216\n21141\t10003\tAl Pacino\t0.98262143\n21141\t90015\tBarbara Niven\t0.98262143\n21141\t10013\tMark Wahlberg\t0.9826205\n21141\t90013\tSofia Vergara\t0.9826199\n21141\t90001\tLinda Blair\t0.98261964\n21141\t10014\tJames Franco\t0.98261946\n21141\t90002\tShannon Whirry\t0.98261935\n21141\t10012\tJohnny Depp\t0.98261917\n21141\t10006\tTom Cruise\t0.98261845\n21141\t10001\tLeonardo DiCaprio\t0.9826184\n21141\t90014\tGail O\u0027Grady\t0.9826175\n21141\t90010\tTiffani Thiessen\t0.9826172\n21141\t90011\tAshley Judd\t0.9826158\n21423\t90005\tKeshia Knight Pulliam\t0.98262876\n21423\t90006\tTatyana Ali\t0.98262715\n21423\t90007\tAngell Conwell\t0.9826271\n21423\t10011\tJohn Travolta\t0.98262674\n21423\t10005\tJames Gandolfini\t0.9826245\n21423\t10009\tChazz Palminteri\t0.9826245\n21423\t90009\tPam Grier\t0.98262423\n21423\t90012\tStacey Dash\t0.9826242\n21423\t10007\tDenzel Washington\t0.98262405\n21423\t90008\tShannah Laumeister\t0.98262405\n21423\t90003\tRosalind Allen\t0.9826231\n21423\t10015\tClive Owen\t0.98262274\n21423\t10004\tMorgan Freeman\t0.98262227\n21423\t10010\tTom Hanks\t0.98262167\n21423\t10008\tRobert De Niro\t0.98262143\n21423\t10002\tAnthony Hopkins\t0.9826213\n21423\t90004\tBobbie Phillips\t0.9826213\n21423\t10003\tAl Pacino\t0.9826212\n21423\t90015\tBarbara Niven\t0.9826212\n21423\t10013\tMark Wahlberg\t0.98262024\n21423\t90013\tSofia Vergara\t0.9826197\n21423\t90001\tLinda Blair\t0.9826194\n21423\t10014\tJames Franco\t0.9826192\n21423\t90002\tShannon Whirry\t0.98261905\n21423\t10012\tJohnny Depp\t0.9826188\n21423\t10006\tTom Cruise\t0.98261815\n21423\t10001\tLeonardo DiCaprio\t0.9826181\n21423\t90014\tGail O\u0027Grady\t0.9826172\n21423\t90010\tTiffani Thiessen\t0.98261696\n21423\t90011\tAshley Judd\t0.9826156\n21619\t90005\tKeshia Knight Pulliam\t0.98263025\n21619\t90006\tTatyana Ali\t0.9826287\n21619\t90007\tAngell Conwell\t0.9826287\n21619\t10011\tJohn Travolta\t0.9826283\n21619\t10005\tJames Gandolfini\t0.9826261\n21619\t10009\tChazz Palminteri\t0.9826261\n21619\t90009\tPam Grier\t0.9826258\n21619\t90012\tStacey Dash\t0.9826257\n21619\t10007\tDenzel Washington\t0.9826256\n21619\t90008\tShannah Laumeister\t0.9826256\n21619\t90003\tRosalind Allen\t0.9826247\n21619\t10015\tClive Owen\t0.98262423\n21619\t10004\tMorgan Freeman\t0.9826238\n21619\t10010\tTom Hanks\t0.9826232\n21619\t10008\tRobert De Niro\t0.982623\n21619\t10002\tAnthony Hopkins\t0.98262286\n21619\t90004\tBobbie Phillips\t0.98262286\n21619\t90015\tBarbara Niven\t0.98262286\n21619\t10003\tAl Pacino\t0.98262274\n21619\t10013\tMark Wahlberg\t0.9826219\n21619\t90013\tSofia Vergara\t0.9826212\n21619\t90001\tLinda Blair\t0.982621\n21619\t10014\tJames Franco\t0.98262084\n21619\t90002\tShannon Whirry\t0.9826206\n21619\t10012\tJohnny Depp\t0.9826204\n21619\t10006\tTom Cruise\t0.9826198\n21619\t10001\tLeonardo DiCaprio\t0.98261964\n21619\t90014\tGail O\u0027Grady\t0.98261875\n21619\t90010\tTiffani Thiessen\t0.98261845\n21619\t90011\tAshley Judd\t0.98261714\n22945\t90005\tKeshia Knight Pulliam\t0.98263067\n22945\t90006\tTatyana Ali\t0.9826291\n22945\t90007\tAngell Conwell\t0.98262906\n22945\t10011\tJohn Travolta\t0.9826287\n22945\t10009\tChazz Palminteri\t0.98262644\n22945\t10005\tJames Gandolfini\t0.9826264\n22945\t90009\tPam Grier\t0.9826262\n22945\t90012\tStacey Dash\t0.9826261\n22945\t90008\tShannah Laumeister\t0.982626\n22945\t10007\tDenzel Washington\t0.98262596\n22945\t90003\tRosalind Allen\t0.98262507\n22945\t10015\tClive Owen\t0.9826246\n22945\t10004\tMorgan Freeman\t0.98262423\n22945\t10010\tTom Hanks\t0.9826236\n22945\t10008\tRobert De Niro\t0.9826234\n22945\t10002\tAnthony Hopkins\t0.9826233\n22945\t90004\tBobbie Phillips\t0.9826232\n22945\t10003\tAl Pacino\t0.98262316\n22945\t90015\tBarbara Niven\t0.98262316\n22945\t10013\tMark Wahlberg\t0.9826222\n22945\t90013\tSofia Vergara\t0.9826216\n22945\t90001\tLinda Blair\t0.9826213\n22945\t10014\tJames Franco\t0.9826212\n22945\t90002\tShannon Whirry\t0.982621\n22945\t10012\tJohnny Depp\t0.98262084\n22945\t10006\tTom Cruise\t0.9826202\n22945\t10001\tLeonardo DiCaprio\t0.98262\n22945\t90014\tGail O\u0027Grady\t0.9826191\n22945\t90010\tTiffani Thiessen\t0.98261887\n22945\t90011\tAshley Judd\t0.9826175\n23393\t90005\tKeshia Knight Pulliam\t0.98262703\n23393\t90006\tTatyana Ali\t0.98262537\n23393\t90007\tAngell Conwell\t0.98262537\n23393\t10011\tJohn Travolta\t0.98262507\n23393\t10005\tJames Gandolfini\t0.98262274\n23393\t10009\tChazz Palminteri\t0.98262274\n23393\t90009\tPam Grier\t0.98262256\n23393\t90012\tStacey Dash\t0.9826225\n23393\t90008\tShannah Laumeister\t0.9826224\n23393\t10007\tDenzel Washington\t0.98262227\n23393\t90003\tRosalind Allen\t0.98262143\n23393\t10015\tClive Owen\t0.98262095\n23393\t10004\tMorgan Freeman\t0.9826206\n23393\t10010\tTom Hanks\t0.98262\n23393\t10008\tRobert De Niro\t0.9826197\n23393\t10002\tAnthony Hopkins\t0.98261964\n23393\t90004\tBobbie Phillips\t0.98261964\n23393\t10003\tAl Pacino\t0.9826195\n23393\t90015\tBarbara Niven\t0.9826195\n23393\t10013\tMark Wahlberg\t0.9826185\n23393\t90013\tSofia Vergara\t0.982618\n23393\t90001\tLinda Blair\t0.9826176\n23393\t10014\tJames Franco\t0.9826175\n23393\t90002\tShannon Whirry\t0.9826174\n23393\t10012\tJohnny Depp\t0.98261714\n23393\t10006\tTom Cruise\t0.9826165\n23393\t10001\tLeonardo DiCaprio\t0.98261636\n23393\t90014\tGail O\u0027Grady\t0.9826155\n23393\t90010\tTiffani Thiessen\t0.98261523\n23393\t90011\tAshley Judd\t0.98261386\n23983\t90005\tKeshia Knight Pulliam\t0.9826305\n23983\t90007\tAngell Conwell\t0.98262894\n23983\t90006\tTatyana Ali\t0.9826289\n23983\t10011\tJohn Travolta\t0.98262846\n23983\t10005\tJames Gandolfini\t0.9826262\n23983\t10009\tChazz Palminteri\t0.9826262\n23983\t90009\tPam Grier\t0.98262596\n23983\t90012\tStacey Dash\t0.98262596\n23983\t90008\tShannah Laumeister\t0.9826258\n23983\t10007\tDenzel Washington\t0.9826257\n23983\t90003\tRosalind Allen\t0.9826249\n23983\t10015\tClive Owen\t0.9826244\n23983\t10004\tMorgan Freeman\t0.98262405\n23983\t10010\tTom Hanks\t0.9826234\n23983\t10002\tAnthony Hopkins\t0.9826231\n23983\t10008\tRobert De Niro\t0.9826231\n23983\t90004\tBobbie Phillips\t0.9826231\n23983\t10003\tAl Pacino\t0.982623\n23983\t90015\tBarbara Niven\t0.9826229\n23983\t10013\tMark Wahlberg\t0.982622\n23983\t90013\tSofia Vergara\t0.9826214\n23983\t90001\tLinda Blair\t0.9826212\n23983\t10014\tJames Franco\t0.98262095\n23983\t90002\tShannon Whirry\t0.9826208\n23983\t10012\tJohnny Depp\t0.98262066\n23983\t10006\tTom Cruise\t0.98262\n23983\t10001\tLeonardo DiCaprio\t0.9826198\n23983\t90014\tGail O\u0027Grady\t0.9826189\n23983\t90010\tTiffani Thiessen\t0.9826187\n23983\t90011\tAshley Judd\t0.98261726\n24600\t90005\tKeshia Knight Pulliam\t0.98262715\n24600\t90006\tTatyana Ali\t0.9826256\n24600\t90007\tAngell Conwell\t0.9826256\n24600\t10011\tJohn Travolta\t0.98262525\n24600\t10005\tJames Gandolfini\t0.982623\n24600\t10009\tChazz Palminteri\t0.982623\n24600\t90009\tPam Grier\t0.98262274\n24600\t90012\tStacey Dash\t0.9826226\n24600\t10007\tDenzel Washington\t0.9826225\n24600\t90008\tShannah Laumeister\t0.9826225\n24600\t90003\tRosalind Allen\t0.98262155\n24600\t10015\tClive Owen\t0.98262113\n24600\t10004\tMorgan Freeman\t0.9826207\n24600\t10010\tTom Hanks\t0.9826201\n24600\t10008\tRobert De Niro\t0.98262\n24600\t10002\tAnthony Hopkins\t0.9826198\n24600\t10003\tAl Pacino\t0.98261976\n24600\t90004\tBobbie Phillips\t0.98261976\n24600\t90015\tBarbara Niven\t0.9826197\n24600\t10013\tMark Wahlberg\t0.98261875\n24600\t90013\tSofia Vergara\t0.98261815\n24600\t90001\tLinda Blair\t0.98261786\n24600\t10014\tJames Franco\t0.9826177\n24600\t90002\tShannon Whirry\t0.9826176\n24600\t10012\tJohnny Depp\t0.9826174\n24600\t10006\tTom Cruise\t0.98261666\n24600\t10001\tLeonardo DiCaprio\t0.9826166\n24600\t90014\tGail O\u0027Grady\t0.98261565\n24600\t90010\tTiffani Thiessen\t0.9826154\n24600\t90011\tAshley Judd\t0.98261404\n25094\t90005\tKeshia Knight Pulliam\t0.982628\n25094\t90006\tTatyana Ali\t0.9826264\n25094\t90007\tAngell Conwell\t0.9826263\n25094\t10011\tJohn Travolta\t0.9826261\n25094\t10005\tJames Gandolfini\t0.98262376\n25094\t10009\tChazz Palminteri\t0.9826237\n25094\t90009\tPam Grier\t0.9826235\n25094\t90012\tStacey Dash\t0.9826234\n25094\t10007\tDenzel Washington\t0.9826233\n25094\t90008\tShannah Laumeister\t0.9826233\n25094\t90003\tRosalind Allen\t0.9826224\n25094\t10015\tClive Owen\t0.9826219\n25094\t10004\tMorgan Freeman\t0.9826216\n25094\t10010\tTom Hanks\t0.9826209\n25094\t10008\tRobert De Niro\t0.9826207\n25094\t10002\tAnthony Hopkins\t0.98262054\n25094\t90004\tBobbie Phillips\t0.98262054\n25094\t10003\tAl Pacino\t0.9826205\n25094\t90015\tBarbara Niven\t0.9826204\n25094\t10013\tMark Wahlberg\t0.9826195\n25094\t90013\tSofia Vergara\t0.9826189\n25094\t90001\tLinda Blair\t0.98261863\n25094\t10014\tJames Franco\t0.98261845\n25094\t90002\tShannon Whirry\t0.98261833\n25094\t10012\tJohnny Depp\t0.9826181\n25094\t10006\tTom Cruise\t0.98261744\n25094\t10001\tLeonardo DiCaprio\t0.9826174\n25094\t90014\tGail O\u0027Grady\t0.9826165\n25094\t90010\tTiffani Thiessen\t0.9826162\n25094\t90011\tAshley Judd\t0.9826149\n25237\t90005\tKeshia Knight Pulliam\t0.98263013\n25237\t90007\tAngell Conwell\t0.98262846\n25237\t90006\tTatyana Ali\t0.9826284\n25237\t10011\tJohn Travolta\t0.9826281\n25237\t10009\tChazz Palminteri\t0.98262584\n25237\t10005\tJames Gandolfini\t0.9826258\n25237\t90009\tPam Grier\t0.9826256\n25237\t90012\tStacey Dash\t0.9826255\n25237\t10007\tDenzel Washington\t0.98262537\n25237\t90008\tShannah Laumeister\t0.98262537\n\n\u003cfont color\u003dred\u003eResults are limited by 1000.\u003c/font\u003e"
      },
      "dateCreated": "Jun 3, 2016 9:04:28 PM",
      "dateStarted": "Jun 21, 2016 3:43:35 PM",
      "dateFinished": "Jun 21, 2016 3:43:51 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Store Recommendations in ElasticSearch",
      "text": "import org.elasticsearch.spark.sql._\n\nval esConfig \u003d Map(\"pushdown\" -\u003e \"true\", \"es.nodes\" -\u003e \"127.0.0.1\", \"es.port\" -\u003e \"9200\")\n\nenrichedRecommendationsDF.write.format(\"org.elasticsearch.spark.sql\")\n  .mode(\"overwrite\")\n  .options(esConfig)\n  .save(\"advancedspark/personalized-als\")\n\nz.show(enrichedRecommendationsDF\n//.where(\"userid \u003d 21619\")\n)",
      "dateUpdated": "Jun 21, 2016 3:43:29 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 294.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "itemId",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "editorHide": false,
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1460922825977_-689845777",
      "id": "20160417-195345_2022099383",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\titemId\ttitle\ttags\tprediction\timg\n666\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826301\timg/actors/90005.jpg\n666\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826285\timg/actors/90007.jpg\n666\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.98262846\timg/actors/90006.jpg\n666\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826281\timg/actors/10011.jpg\n666\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826258\timg/actors/10005.jpg\n666\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826258\timg/actors/10009.jpg\n666\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262554\timg/actors/90009.jpg\n666\t90012\tStacey Dash\tBronx, New York, United States\t0.9826255\timg/actors/90012.jpg\n666\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826254\timg/actors/10007.jpg\n666\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.98262537\timg/actors/90008.jpg\n666\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826245\timg/actors/90003.jpg\n666\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262405\timg/actors/10015.jpg\n666\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.98262364\timg/actors/10004.jpg\n666\t10010\tTom Hanks\tConcord, California, United States\t0.982623\timg/actors/10010.jpg\n666\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262274\timg/actors/10008.jpg\n666\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826226\timg/actors/10002.jpg\n666\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826226\timg/actors/90004.jpg\n666\t10003\tAl Pacino\tManhattan, New York, United States\t0.98262256\timg/actors/10003.jpg\n666\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.98262256\timg/actors/90015.jpg\n666\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826216\timg/actors/10013.jpg\n666\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.982621\timg/actors/90013.jpg\n666\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826207\timg/actors/90001.jpg\n666\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826206\timg/actors/10014.jpg\n666\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98262036\timg/actors/90002.jpg\n666\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98262024\timg/actors/10012.jpg\n666\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826196\timg/actors/10006.jpg\n666\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826194\timg/actors/10001.jpg\n666\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.98261845\timg/actors/90014.jpg\n666\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826183\timg/actors/90010.jpg\n666\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261684\timg/actors/90011.jpg\n671\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826303\timg/actors/90005.jpg\n671\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826287\timg/actors/90006.jpg\n671\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262864\timg/actors/90007.jpg\n671\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262835\timg/actors/10011.jpg\n671\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826261\timg/actors/10005.jpg\n671\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826261\timg/actors/10009.jpg\n671\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9826258\timg/actors/90009.jpg\n671\t90012\tStacey Dash\tBronx, New York, United States\t0.9826257\timg/actors/90012.jpg\n671\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826256\timg/actors/90008.jpg\n671\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262554\timg/actors/10007.jpg\n671\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262465\timg/actors/90003.jpg\n671\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826243\timg/actors/10015.jpg\n671\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826238\timg/actors/10004.jpg\n671\t10010\tTom Hanks\tConcord, California, United States\t0.9826232\timg/actors/10010.jpg\n671\t10008\tRobert De Niro\tManhattan, New York, United States\t0.982623\timg/actors/10008.jpg\n671\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826229\timg/actors/10002.jpg\n671\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.98262286\timg/actors/90004.jpg\n671\t10003\tAl Pacino\tManhattan, New York, United States\t0.98262274\timg/actors/10003.jpg\n671\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.98262274\timg/actors/90015.jpg\n671\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826218\timg/actors/10013.jpg\n671\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826212\timg/actors/90013.jpg\n671\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98262095\timg/actors/90001.jpg\n671\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826208\timg/actors/10014.jpg\n671\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98262066\timg/actors/90002.jpg\n671\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98262036\timg/actors/10012.jpg\n671\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826197\timg/actors/10001.jpg\n671\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826197\timg/actors/10006.jpg\n671\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.98261875\timg/actors/90014.jpg\n671\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98261845\timg/actors/90010.jpg\n671\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261714\timg/actors/90011.jpg\n2708\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826283\timg/actors/90005.jpg\n2708\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826266\timg/actors/90006.jpg\n2708\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826266\timg/actors/90007.jpg\n2708\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826263\timg/actors/10011.jpg\n2708\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.98262405\timg/actors/10005.jpg\n2708\t10009\tChazz Palminteri\tBronx, New York, United States\t0.98262405\timg/actors/10009.jpg\n2708\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262376\timg/actors/90009.jpg\n2708\t90012\tStacey Dash\tBronx, New York, United States\t0.9826237\timg/actors/90012.jpg\n2708\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826236\timg/actors/90008.jpg\n2708\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826235\timg/actors/10007.jpg\n2708\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826226\timg/actors/90003.jpg\n2708\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826222\timg/actors/10015.jpg\n2708\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826217\timg/actors/10004.jpg\n2708\t10010\tTom Hanks\tConcord, California, United States\t0.98262113\timg/actors/10010.jpg\n2708\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262095\timg/actors/10008.jpg\n2708\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.98262084\timg/actors/10002.jpg\n2708\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826208\timg/actors/90004.jpg\n2708\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826207\timg/actors/10003.jpg\n2708\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826207\timg/actors/90015.jpg\n2708\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.98261976\timg/actors/10013.jpg\n2708\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.98261917\timg/actors/90013.jpg\n2708\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826189\timg/actors/90001.jpg\n2708\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826187\timg/actors/10014.jpg\n2708\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98261863\timg/actors/90002.jpg\n2708\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98261833\timg/actors/10012.jpg\n2708\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826177\timg/actors/10006.jpg\n2708\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826176\timg/actors/10001.jpg\n2708\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.98261666\timg/actors/90014.jpg\n2708\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826164\timg/actors/90010.jpg\n2708\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826151\timg/actors/90011.jpg\n2879\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.98262733\timg/actors/90005.jpg\n2879\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826257\timg/actors/90006.jpg\n2879\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826257\timg/actors/90007.jpg\n2879\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262537\timg/actors/10011.jpg\n2879\t10009\tChazz Palminteri\tBronx, New York, United States\t0.98262316\timg/actors/10009.jpg\n2879\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826231\timg/actors/10005.jpg\n2879\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262286\timg/actors/90009.jpg\n2879\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.98262274\timg/actors/90008.jpg\n2879\t90012\tStacey Dash\tBronx, New York, United States\t0.98262274\timg/actors/90012.jpg\n2879\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826227\timg/actors/10007.jpg\n2879\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826217\timg/actors/90003.jpg\n2879\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826213\timg/actors/10015.jpg\n2879\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826209\timg/actors/10004.jpg\n2879\t10010\tTom Hanks\tConcord, California, United States\t0.9826203\timg/actors/10010.jpg\n2879\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262\timg/actors/10008.jpg\n2879\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826199\timg/actors/10002.jpg\n2879\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826199\timg/actors/90004.jpg\n2879\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826198\timg/actors/10003.jpg\n2879\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.98261976\timg/actors/90015.jpg\n2879\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.98261887\timg/actors/10013.jpg\n2879\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826183\timg/actors/90013.jpg\n2879\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98261803\timg/actors/90001.jpg\n2879\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826178\timg/actors/10014.jpg\n2879\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98261774\timg/actors/90002.jpg\n2879\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826175\timg/actors/10012.jpg\n2879\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826168\timg/actors/10006.jpg\n2879\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826167\timg/actors/10001.jpg\n2879\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826158\timg/actors/90014.jpg\n2879\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98261553\timg/actors/90010.jpg\n2879\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826142\timg/actors/90011.jpg\n5980\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.982632\timg/actors/90005.jpg\n5980\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98263043\timg/actors/90007.jpg\n5980\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826304\timg/actors/90006.jpg\n5980\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98263\timg/actors/10011.jpg\n5980\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826278\timg/actors/10009.jpg\n5980\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.98262775\timg/actors/10005.jpg\n5980\t90012\tStacey Dash\tBronx, New York, United States\t0.9826275\timg/actors/90012.jpg\n5980\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262745\timg/actors/90009.jpg\n5980\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262733\timg/actors/10007.jpg\n5980\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826273\timg/actors/90008.jpg\n5980\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262644\timg/actors/90003.jpg\n5980\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262596\timg/actors/10015.jpg\n5980\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826256\timg/actors/10004.jpg\n5980\t10010\tTom Hanks\tConcord, California, United States\t0.98262495\timg/actors/10010.jpg\n5980\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262465\timg/actors/10008.jpg\n5980\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826246\timg/actors/10002.jpg\n5980\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826246\timg/actors/90004.jpg\n5980\t10003\tAl Pacino\tManhattan, New York, United States\t0.98262453\timg/actors/10003.jpg\n5980\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826244\timg/actors/90015.jpg\n5980\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826236\timg/actors/10013.jpg\n5980\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826229\timg/actors/90013.jpg\n5980\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826227\timg/actors/90001.jpg\n5980\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826225\timg/actors/10014.jpg\n5980\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9826224\timg/actors/90002.jpg\n5980\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98262215\timg/actors/10012.jpg\n5980\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.98262143\timg/actors/10001.jpg\n5980\t10006\tTom Cruise\tSyracuse, New York, United States\t0.98262143\timg/actors/10006.jpg\n5980\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826204\timg/actors/90014.jpg\n5980\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98262024\timg/actors/90010.jpg\n5980\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826188\timg/actors/90011.jpg\n5983\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826262\timg/actors/90005.jpg\n5983\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262453\timg/actors/90007.jpg\n5983\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826245\timg/actors/90006.jpg\n5983\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262423\timg/actors/10011.jpg\n5983\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826219\timg/actors/10005.jpg\n5983\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826219\timg/actors/10009.jpg\n5983\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262167\timg/actors/90009.jpg\n5983\t90012\tStacey Dash\tBronx, New York, United States\t0.9826216\timg/actors/90012.jpg\n5983\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826215\timg/actors/10007.jpg\n5983\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.98262143\timg/actors/90008.jpg\n5983\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826206\timg/actors/90003.jpg\n5983\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826201\timg/actors/10015.jpg\n5983\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.98261976\timg/actors/10004.jpg\n5983\t10010\tTom Hanks\tConcord, California, United States\t0.98261905\timg/actors/10010.jpg\n5983\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98261887\timg/actors/10008.jpg\n5983\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.98261875\timg/actors/10002.jpg\n5983\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826187\timg/actors/10003.jpg\n5983\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826187\timg/actors/90004.jpg\n5983\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.98261863\timg/actors/90015.jpg\n5983\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826176\timg/actors/10013.jpg\n5983\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.98261714\timg/actors/90013.jpg\n5983\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826168\timg/actors/90001.jpg\n5983\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826166\timg/actors/10014.jpg\n5983\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98261654\timg/actors/90002.jpg\n5983\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826163\timg/actors/10012.jpg\n5983\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826156\timg/actors/10006.jpg\n5983\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.98261553\timg/actors/10001.jpg\n5983\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826146\timg/actors/90014.jpg\n5983\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826144\timg/actors/90010.jpg\n5983\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261297\timg/actors/90011.jpg\n7467\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826303\timg/actors/90005.jpg\n7467\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.98262864\timg/actors/90006.jpg\n7467\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262864\timg/actors/90007.jpg\n7467\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826283\timg/actors/10011.jpg\n7467\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.982626\timg/actors/10005.jpg\n7467\t10009\tChazz Palminteri\tBronx, New York, United States\t0.982626\timg/actors/10009.jpg\n7467\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9826258\timg/actors/90009.jpg\n7467\t90012\tStacey Dash\tBronx, New York, United States\t0.9826257\timg/actors/90012.jpg\n7467\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826256\timg/actors/10007.jpg\n7467\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826256\timg/actors/90008.jpg\n7467\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262465\timg/actors/90003.jpg\n7467\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826243\timg/actors/10015.jpg\n7467\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826239\timg/actors/10004.jpg\n7467\t10010\tTom Hanks\tConcord, California, United States\t0.98262316\timg/actors/10010.jpg\n7467\t10008\tRobert De Niro\tManhattan, New York, United States\t0.982623\timg/actors/10008.jpg\n7467\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.98262286\timg/actors/10002.jpg\n7467\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826228\timg/actors/10003.jpg\n7467\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826228\timg/actors/90004.jpg\n7467\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.98262274\timg/actors/90015.jpg\n7467\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826218\timg/actors/10013.jpg\n7467\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826212\timg/actors/90013.jpg\n7467\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826209\timg/actors/90001.jpg\n7467\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826207\timg/actors/10014.jpg\n7467\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9826206\timg/actors/90002.jpg\n7467\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98262036\timg/actors/10012.jpg\n7467\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826197\timg/actors/10006.jpg\n7467\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.98261964\timg/actors/10001.jpg\n7467\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826187\timg/actors/90014.jpg\n7467\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826185\timg/actors/90010.jpg\n7467\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826171\timg/actors/90011.jpg\n7726\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826295\timg/actors/90005.jpg\n7726\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826278\timg/actors/90007.jpg\n7726\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.98262775\timg/actors/90006.jpg\n7726\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826274\timg/actors/10011.jpg\n7726\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826251\timg/actors/10005.jpg\n7726\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826251\timg/actors/10009.jpg\n7726\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262495\timg/actors/90009.jpg\n7726\t90012\tStacey Dash\tBronx, New York, United States\t0.9826248\timg/actors/90012.jpg\n7726\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826247\timg/actors/10007.jpg\n7726\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826247\timg/actors/90008.jpg\n7726\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262376\timg/actors/90003.jpg\n7726\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262334\timg/actors/10015.jpg\n7726\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.98262286\timg/actors/10004.jpg\n7726\t10010\tTom Hanks\tConcord, California, United States\t0.98262227\timg/actors/10010.jpg\n7726\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262215\timg/actors/10008.jpg\n7726\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.982622\timg/actors/90004.jpg\n7726\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.98262197\timg/actors/10002.jpg\n7726\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826219\timg/actors/10003.jpg\n7726\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826219\timg/actors/90015.jpg\n7726\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.98262095\timg/actors/10013.jpg\n7726\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826203\timg/actors/90013.jpg\n7726\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98262\timg/actors/90001.jpg\n7726\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826199\timg/actors/10014.jpg\n7726\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9826198\timg/actors/90002.jpg\n7726\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826195\timg/actors/10012.jpg\n7726\t10006\tTom Cruise\tSyracuse, New York, United States\t0.98261887\timg/actors/10006.jpg\n7726\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826188\timg/actors/10001.jpg\n7726\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.98261786\timg/actors/90014.jpg\n7726\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98261756\timg/actors/90010.jpg\n7726\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826162\timg/actors/90011.jpg\n9040\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826289\timg/actors/90005.jpg\n9040\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826272\timg/actors/90006.jpg\n9040\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262715\timg/actors/90007.jpg\n9040\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826268\timg/actors/10011.jpg\n9040\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826246\timg/actors/10009.jpg\n9040\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.98262453\timg/actors/10005.jpg\n9040\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262435\timg/actors/90009.jpg\n9040\t90012\tStacey Dash\tBronx, New York, United States\t0.9826243\timg/actors/90012.jpg\n9040\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262405\timg/actors/10007.jpg\n9040\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.98262405\timg/actors/90008.jpg\n9040\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262316\timg/actors/90003.jpg\n9040\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262274\timg/actors/10015.jpg\n9040\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826224\timg/actors/10004.jpg\n9040\t10010\tTom Hanks\tConcord, California, United States\t0.9826217\timg/actors/10010.jpg\n9040\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262155\timg/actors/10008.jpg\n9040\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826214\timg/actors/10002.jpg\n9040\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826214\timg/actors/90004.jpg\n9040\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826213\timg/actors/10003.jpg\n9040\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826213\timg/actors/90015.jpg\n9040\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.98262036\timg/actors/10013.jpg\n9040\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.98261976\timg/actors/90013.jpg\n9040\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98261946\timg/actors/90001.jpg\n9040\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826193\timg/actors/10014.jpg\n9040\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98261917\timg/actors/90002.jpg\n9040\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826189\timg/actors/10012.jpg\n9040\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826183\timg/actors/10006.jpg\n9040\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.98261815\timg/actors/10001.jpg\n9040\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.98261726\timg/actors/90014.jpg\n9040\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826169\timg/actors/90010.jpg\n9040\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261565\timg/actors/90011.jpg\n9773\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826304\timg/actors/90005.jpg\n9773\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826287\timg/actors/90007.jpg\n9773\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.98262864\timg/actors/90006.jpg\n9773\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262835\timg/actors/10011.jpg\n9773\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826261\timg/actors/10005.jpg\n9773\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826261\timg/actors/10009.jpg\n9773\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262584\timg/actors/90009.jpg\n9773\t90012\tStacey Dash\tBronx, New York, United States\t0.9826257\timg/actors/90012.jpg\n9773\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826256\timg/actors/10007.jpg\n9773\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826256\timg/actors/90008.jpg\n9773\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262465\timg/actors/90003.jpg\n9773\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826243\timg/actors/10015.jpg\n9773\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826239\timg/actors/10004.jpg\n9773\t10010\tTom Hanks\tConcord, California, United States\t0.9826232\timg/actors/10010.jpg\n9773\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262304\timg/actors/10008.jpg\n9773\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826229\timg/actors/10002.jpg\n9773\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.98262286\timg/actors/90004.jpg\n9773\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826228\timg/actors/10003.jpg\n9773\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826228\timg/actors/90015.jpg\n9773\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.98262185\timg/actors/10013.jpg\n9773\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826212\timg/actors/90013.jpg\n9773\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98262095\timg/actors/90001.jpg\n9773\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826208\timg/actors/10014.jpg\n9773\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98262066\timg/actors/90002.jpg\n9773\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826204\timg/actors/10012.jpg\n9773\t10006\tTom Cruise\tSyracuse, New York, United States\t0.98261976\timg/actors/10006.jpg\n9773\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.98261964\timg/actors/10001.jpg\n9773\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.98261875\timg/actors/90014.jpg\n9773\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98261845\timg/actors/90010.jpg\n9773\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261714\timg/actors/90011.jpg\n10198\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826289\timg/actors/90005.jpg\n10198\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826272\timg/actors/90006.jpg\n10198\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826272\timg/actors/90007.jpg\n10198\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826268\timg/actors/10011.jpg\n10198\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826246\timg/actors/10005.jpg\n10198\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826246\timg/actors/10009.jpg\n10198\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262435\timg/actors/90009.jpg\n10198\t90012\tStacey Dash\tBronx, New York, United States\t0.9826243\timg/actors/90012.jpg\n10198\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826242\timg/actors/90008.jpg\n10198\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262405\timg/actors/10007.jpg\n10198\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262316\timg/actors/90003.jpg\n10198\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262274\timg/actors/10015.jpg\n10198\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826224\timg/actors/10004.jpg\n10198\t10010\tTom Hanks\tConcord, California, United States\t0.9826217\timg/actors/10010.jpg\n10198\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262155\timg/actors/10008.jpg\n10198\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.98262143\timg/actors/10002.jpg\n10198\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826214\timg/actors/90004.jpg\n10198\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826213\timg/actors/10003.jpg\n10198\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826213\timg/actors/90015.jpg\n10198\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.98262036\timg/actors/10013.jpg\n10198\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.98261976\timg/actors/90013.jpg\n10198\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98261946\timg/actors/90001.jpg\n10198\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826193\timg/actors/10014.jpg\n10198\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98261917\timg/actors/90002.jpg\n10198\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826189\timg/actors/10012.jpg\n10198\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826183\timg/actors/10006.jpg\n10198\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826182\timg/actors/10001.jpg\n10198\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.98261726\timg/actors/90014.jpg\n10198\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.982617\timg/actors/90010.jpg\n10198\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261565\timg/actors/90011.jpg\n10469\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.98262733\timg/actors/90005.jpg\n10469\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826257\timg/actors/90006.jpg\n10469\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826257\timg/actors/90007.jpg\n10469\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262537\timg/actors/10011.jpg\n10469\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826231\timg/actors/10009.jpg\n10469\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.98262304\timg/actors/10005.jpg\n10469\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262286\timg/actors/90009.jpg\n10469\t90012\tStacey Dash\tBronx, New York, United States\t0.98262274\timg/actors/90012.jpg\n10469\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826226\timg/actors/10007.jpg\n10469\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826226\timg/actors/90008.jpg\n10469\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826217\timg/actors/90003.jpg\n10469\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262125\timg/actors/10015.jpg\n10469\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826209\timg/actors/10004.jpg\n10469\t10010\tTom Hanks\tConcord, California, United States\t0.98262024\timg/actors/10010.jpg\n10469\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262\timg/actors/10008.jpg\n10469\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.98261994\timg/actors/10002.jpg\n10469\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826199\timg/actors/90004.jpg\n10469\t10003\tAl Pacino\tManhattan, New York, United States\t0.98261976\timg/actors/10003.jpg\n10469\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.98261976\timg/actors/90015.jpg\n10469\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826189\timg/actors/10013.jpg\n10469\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826182\timg/actors/90013.jpg\n10469\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.982618\timg/actors/90001.jpg\n10469\t10014\tJames Franco\tPalo Alto, California, United States\t0.98261774\timg/actors/10014.jpg\n10469\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9826177\timg/actors/90002.jpg\n10469\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98261744\timg/actors/10012.jpg\n10469\t10006\tTom Cruise\tSyracuse, New York, United States\t0.98261684\timg/actors/10006.jpg\n10469\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826167\timg/actors/10001.jpg\n10469\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.98261577\timg/actors/90014.jpg\n10469\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826155\timg/actors/90010.jpg\n10469\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261416\timg/actors/90011.jpg\n10921\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826268\timg/actors/90005.jpg\n10921\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826251\timg/actors/90006.jpg\n10921\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826251\timg/actors/90007.jpg\n10921\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262477\timg/actors/10011.jpg\n10921\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826225\timg/actors/10005.jpg\n10921\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826225\timg/actors/10009.jpg\n10921\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262227\timg/actors/90009.jpg\n10921\t90012\tStacey Dash\tBronx, New York, United States\t0.98262215\timg/actors/90012.jpg\n10921\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.982622\timg/actors/10007.jpg\n10921\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.982622\timg/actors/90008.jpg\n10921\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826212\timg/actors/90003.jpg\n10921\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262066\timg/actors/10015.jpg\n10921\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826203\timg/actors/10004.jpg\n10921\t10010\tTom Hanks\tConcord, California, United States\t0.98261964\timg/actors/10010.jpg\n10921\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98261946\timg/actors/10008.jpg\n10921\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826194\timg/actors/10002.jpg\n10921\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.98261935\timg/actors/90004.jpg\n10921\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826193\timg/actors/10003.jpg\n10921\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826192\timg/actors/90015.jpg\n10921\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826182\timg/actors/10013.jpg\n10921\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826176\timg/actors/90013.jpg\n10921\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98261744\timg/actors/90001.jpg\n10921\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826172\timg/actors/10014.jpg\n10921\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98261714\timg/actors/90002.jpg\n10921\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826169\timg/actors/10012.jpg\n10921\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826162\timg/actors/10001.jpg\n10921\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826162\timg/actors/10006.jpg\n10921\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826152\timg/actors/90014.jpg\n10921\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826149\timg/actors/90010.jpg\n10921\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261356\timg/actors/90011.jpg\n11905\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826299\timg/actors/90005.jpg\n11905\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826283\timg/actors/90006.jpg\n11905\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826283\timg/actors/90007.jpg\n11905\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826279\timg/actors/10011.jpg\n11905\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.98262566\timg/actors/10005.jpg\n11905\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826256\timg/actors/10009.jpg\n11905\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262537\timg/actors/90009.jpg\n11905\t90012\tStacey Dash\tBronx, New York, United States\t0.9826253\timg/actors/90012.jpg\n11905\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.98262525\timg/actors/90008.jpg\n11905\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826251\timg/actors/10007.jpg\n11905\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826243\timg/actors/90003.jpg\n11905\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826238\timg/actors/10015.jpg\n11905\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826234\timg/actors/10004.jpg\n11905\t10010\tTom Hanks\tConcord, California, United States\t0.98262286\timg/actors/10010.jpg\n11905\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262256\timg/actors/10008.jpg\n11905\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826225\timg/actors/10002.jpg\n11905\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826225\timg/actors/90004.jpg\n11905\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826223\timg/actors/10003.jpg\n11905\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826223\timg/actors/90015.jpg\n11905\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.98262143\timg/actors/10013.jpg\n11905\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.98262084\timg/actors/90013.jpg\n11905\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826206\timg/actors/90001.jpg\n11905\t10014\tJames Franco\tPalo Alto, California, United States\t0.98262036\timg/actors/10014.jpg\n11905\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98262024\timg/actors/90002.jpg\n11905\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98262\timg/actors/10012.jpg\n11905\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826194\timg/actors/10006.jpg\n11905\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826192\timg/actors/10001.jpg\n11905\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826183\timg/actors/90014.jpg\n11905\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98261803\timg/actors/90010.jpg\n11905\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261666\timg/actors/90011.jpg\n13397\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826302\timg/actors/90005.jpg\n13397\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826286\timg/actors/90006.jpg\n13397\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826286\timg/actors/90007.jpg\n13397\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262817\timg/actors/10011.jpg\n13397\t10009\tChazz Palminteri\tBronx, New York, United States\t0.98262596\timg/actors/10009.jpg\n13397\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826259\timg/actors/10005.jpg\n13397\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262566\timg/actors/90009.jpg\n13397\t90012\tStacey Dash\tBronx, New York, United States\t0.9826256\timg/actors/90012.jpg\n13397\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826255\timg/actors/10007.jpg\n13397\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826255\timg/actors/90008.jpg\n13397\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262453\timg/actors/90003.jpg\n13397\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826241\timg/actors/10015.jpg\n13397\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826237\timg/actors/10004.jpg\n13397\t10010\tTom Hanks\tConcord, California, United States\t0.98262304\timg/actors/10010.jpg\n13397\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262286\timg/actors/10008.jpg\n13397\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826228\timg/actors/10002.jpg\n13397\t10003\tAl Pacino\tManhattan, New York, United States\t0.98262274\timg/actors/10003.jpg\n13397\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.98262274\timg/actors/90004.jpg\n13397\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826226\timg/actors/90015.jpg\n13397\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.98262167\timg/actors/10013.jpg\n13397\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826211\timg/actors/90013.jpg\n13397\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98262084\timg/actors/90001.jpg\n13397\t10014\tJames Franco\tPalo Alto, California, United States\t0.98262066\timg/actors/10014.jpg\n13397\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9826205\timg/actors/90002.jpg\n13397\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826203\timg/actors/10012.jpg\n13397\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.98261964\timg/actors/10001.jpg\n13397\t10006\tTom Cruise\tSyracuse, New York, United States\t0.98261964\timg/actors/10006.jpg\n13397\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826186\timg/actors/90014.jpg\n13397\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98261833\timg/actors/90010.jpg\n13397\t90011\tAshley Judd\tGranada Hills, California, United States\t0.982617\timg/actors/90011.jpg\n14806\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826294\timg/actors/90005.jpg\n14806\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.98262787\timg/actors/90006.jpg\n14806\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262787\timg/actors/90007.jpg\n14806\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262745\timg/actors/10011.jpg\n14806\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826252\timg/actors/10009.jpg\n14806\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826251\timg/actors/10005.jpg\n14806\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262495\timg/actors/90009.jpg\n14806\t90012\tStacey Dash\tBronx, New York, United States\t0.9826249\timg/actors/90012.jpg\n14806\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826247\timg/actors/10007.jpg\n14806\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826247\timg/actors/90008.jpg\n14806\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826238\timg/actors/90003.jpg\n14806\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262334\timg/actors/10015.jpg\n14806\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.982623\timg/actors/10004.jpg\n14806\t10010\tTom Hanks\tConcord, California, United States\t0.9826224\timg/actors/10010.jpg\n14806\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262215\timg/actors/10008.jpg\n14806\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.982622\timg/actors/10002.jpg\n14806\t10003\tAl Pacino\tManhattan, New York, United States\t0.982622\timg/actors/10003.jpg\n14806\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.982622\timg/actors/90004.jpg\n14806\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826219\timg/actors/90015.jpg\n14806\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.98262095\timg/actors/10013.jpg\n14806\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826203\timg/actors/90013.jpg\n14806\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826201\timg/actors/90001.jpg\n14806\t10014\tJames Franco\tPalo Alto, California, United States\t0.98261994\timg/actors/10014.jpg\n14806\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9826198\timg/actors/90002.jpg\n14806\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826195\timg/actors/10012.jpg\n14806\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826189\timg/actors/10006.jpg\n14806\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.98261887\timg/actors/10001.jpg\n14806\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826179\timg/actors/90014.jpg\n14806\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826176\timg/actors/90010.jpg\n14806\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261625\timg/actors/90011.jpg\n17802\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826316\timg/actors/90005.jpg\n17802\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.98263\timg/actors/90006.jpg\n17802\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98263\timg/actors/90007.jpg\n17802\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826296\timg/actors/10011.jpg\n17802\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826274\timg/actors/10005.jpg\n17802\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826274\timg/actors/10009.jpg\n17802\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262715\timg/actors/90009.jpg\n17802\t90012\tStacey Dash\tBronx, New York, United States\t0.98262703\timg/actors/90012.jpg\n17802\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.982627\timg/actors/90008.jpg\n17802\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262686\timg/actors/10007.jpg\n17802\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262596\timg/actors/90003.jpg\n17802\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826255\timg/actors/10015.jpg\n17802\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826251\timg/actors/10004.jpg\n17802\t10010\tTom Hanks\tConcord, California, United States\t0.98262453\timg/actors/10010.jpg\n17802\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262435\timg/actors/10008.jpg\n17802\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.98262423\timg/actors/10002.jpg\n17802\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826242\timg/actors/10003.jpg\n17802\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826242\timg/actors/90004.jpg\n17802\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826241\timg/actors/90015.jpg\n17802\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826231\timg/actors/10013.jpg\n17802\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826225\timg/actors/90013.jpg\n17802\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98262227\timg/actors/90001.jpg\n17802\t10014\tJames Franco\tPalo Alto, California, United States\t0.98262215\timg/actors/10014.jpg\n17802\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98262197\timg/actors/90002.jpg\n17802\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826218\timg/actors/10012.jpg\n17802\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826211\timg/actors/10006.jpg\n17802\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.982621\timg/actors/10001.jpg\n17802\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826201\timg/actors/90014.jpg\n17802\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98261976\timg/actors/90010.jpg\n17802\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261845\timg/actors/90011.jpg\n17928\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.98263437\timg/actors/90005.jpg\n17928\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98263276\timg/actors/90007.jpg\n17928\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826327\timg/actors/90006.jpg\n17928\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826324\timg/actors/10011.jpg\n17928\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.98263013\timg/actors/10005.jpg\n17928\t10009\tChazz Palminteri\tBronx, New York, United States\t0.98263\timg/actors/10009.jpg\n17928\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262984\timg/actors/90009.jpg\n17928\t90012\tStacey Dash\tBronx, New York, United States\t0.9826297\timg/actors/90012.jpg\n17928\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262966\timg/actors/10007.jpg\n17928\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826296\timg/actors/90008.jpg\n17928\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826287\timg/actors/90003.jpg\n17928\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826283\timg/actors/10015.jpg\n17928\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826279\timg/actors/10004.jpg\n17928\t10010\tTom Hanks\tConcord, California, United States\t0.9826273\timg/actors/10010.jpg\n17928\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262703\timg/actors/10008.jpg\n17928\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826269\timg/actors/10002.jpg\n17928\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826269\timg/actors/90004.jpg\n17928\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826268\timg/actors/10003.jpg\n17928\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826268\timg/actors/90015.jpg\n17928\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.98262584\timg/actors/10013.jpg\n17928\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.98262525\timg/actors/90013.jpg\n17928\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.982625\timg/actors/90001.jpg\n17928\t10014\tJames Franco\tPalo Alto, California, United States\t0.98262477\timg/actors/10014.jpg\n17928\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98262465\timg/actors/90002.jpg\n17928\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98262453\timg/actors/10012.jpg\n17928\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826238\timg/actors/10006.jpg\n17928\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826237\timg/actors/10001.jpg\n17928\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.98262274\timg/actors/90014.jpg\n17928\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826225\timg/actors/90010.jpg\n17928\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98262113\timg/actors/90011.jpg\n18910\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826296\timg/actors/90005.jpg\n18910\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262805\timg/actors/90007.jpg\n18910\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.982628\timg/actors/90006.jpg\n18910\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262763\timg/actors/10011.jpg\n18910\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826254\timg/actors/10009.jpg\n18910\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.98262537\timg/actors/10005.jpg\n18910\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9826251\timg/actors/90009.jpg\n18910\t90012\tStacey Dash\tBronx, New York, United States\t0.9826251\timg/actors/90012.jpg\n18910\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.982625\timg/actors/90008.jpg\n18910\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262495\timg/actors/10007.jpg\n18910\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262405\timg/actors/90003.jpg\n18910\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826236\timg/actors/10015.jpg\n18910\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826232\timg/actors/10004.jpg\n18910\t10010\tTom Hanks\tConcord, California, United States\t0.9826226\timg/actors/10010.jpg\n18910\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9826223\timg/actors/10008.jpg\n18910\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826222\timg/actors/10002.jpg\n18910\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826222\timg/actors/90004.jpg\n18910\t10003\tAl Pacino\tManhattan, New York, United States\t0.98262215\timg/actors/10003.jpg\n18910\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.982622\timg/actors/90015.jpg\n18910\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826212\timg/actors/10013.jpg\n18910\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826206\timg/actors/90013.jpg\n18910\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826203\timg/actors/90001.jpg\n18910\t10014\tJames Franco\tPalo Alto, California, United States\t0.98262006\timg/actors/10014.jpg\n18910\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98262\timg/actors/90002.jpg\n18910\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98261976\timg/actors/10012.jpg\n18910\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826191\timg/actors/10006.jpg\n18910\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.98261905\timg/actors/10001.jpg\n18910\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.98261803\timg/actors/90014.jpg\n18910\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98261786\timg/actors/90010.jpg\n18910\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826164\timg/actors/90011.jpg\n19149\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.98262924\timg/actors/90005.jpg\n19149\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262763\timg/actors/90007.jpg\n19149\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826276\timg/actors/90006.jpg\n19149\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826273\timg/actors/10011.jpg\n19149\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.982625\timg/actors/10005.jpg\n19149\t10009\tChazz Palminteri\tBronx, New York, United States\t0.98262495\timg/actors/10009.jpg\n19149\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262477\timg/actors/90009.jpg\n19149\t90012\tStacey Dash\tBronx, New York, United States\t0.98262465\timg/actors/90012.jpg\n19149\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.98262453\timg/actors/90008.jpg\n19149\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826245\timg/actors/10007.jpg\n19149\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262364\timg/actors/90003.jpg\n19149\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826232\timg/actors/10015.jpg\n19149\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826228\timg/actors/10004.jpg\n19149\t10010\tTom Hanks\tConcord, California, United States\t0.98262215\timg/actors/10010.jpg\n19149\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9826219\timg/actors/10008.jpg\n19149\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826218\timg/actors/10002.jpg\n19149\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826218\timg/actors/90004.jpg\n19149\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826217\timg/actors/10003.jpg\n19149\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.98262167\timg/actors/90015.jpg\n19149\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826207\timg/actors/10013.jpg\n19149\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826201\timg/actors/90013.jpg\n19149\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826199\timg/actors/90001.jpg\n19149\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826197\timg/actors/10014.jpg\n19149\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98261964\timg/actors/90002.jpg\n19149\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98261935\timg/actors/10012.jpg\n19149\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826187\timg/actors/10006.jpg\n19149\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.98261863\timg/actors/10001.jpg\n19149\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.98261774\timg/actors/90014.jpg\n19149\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826174\timg/actors/90010.jpg\n19149\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826161\timg/actors/90011.jpg\n19186\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826294\timg/actors/90005.jpg\n19186\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826278\timg/actors/90006.jpg\n19186\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826278\timg/actors/90007.jpg\n19186\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262745\timg/actors/10011.jpg\n19186\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826252\timg/actors/10005.jpg\n19186\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826251\timg/actors/10009.jpg\n19186\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262495\timg/actors/90009.jpg\n19186\t90012\tStacey Dash\tBronx, New York, United States\t0.9826248\timg/actors/90012.jpg\n19186\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262477\timg/actors/10007.jpg\n19186\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826247\timg/actors/90008.jpg\n19186\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826238\timg/actors/90003.jpg\n19186\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262334\timg/actors/10015.jpg\n19186\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.982623\timg/actors/10004.jpg\n19186\t10010\tTom Hanks\tConcord, California, United States\t0.9826223\timg/actors/10010.jpg\n19186\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262215\timg/actors/10008.jpg\n19186\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.982622\timg/actors/10002.jpg\n19186\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.98262197\timg/actors/90004.jpg\n19186\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826219\timg/actors/10003.jpg\n19186\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826219\timg/actors/90015.jpg\n19186\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.98262095\timg/actors/10013.jpg\n19186\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.98262024\timg/actors/90013.jpg\n19186\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98262006\timg/actors/90001.jpg\n19186\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826199\timg/actors/10014.jpg\n19186\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9826198\timg/actors/90002.jpg\n19186\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826196\timg/actors/10012.jpg\n19186\t10006\tTom Cruise\tSyracuse, New York, United States\t0.98261887\timg/actors/10006.jpg\n19186\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826188\timg/actors/10001.jpg\n19186\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826179\timg/actors/90014.jpg\n19186\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826175\timg/actors/90010.jpg\n19186\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826163\timg/actors/90011.jpg\n19829\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826297\timg/actors/90005.jpg\n19829\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826281\timg/actors/90006.jpg\n19829\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826281\timg/actors/90007.jpg\n19829\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262775\timg/actors/10011.jpg\n19829\t10009\tChazz Palminteri\tBronx, New York, United States\t0.98262554\timg/actors/10009.jpg\n19829\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826255\timg/actors/10005.jpg\n19829\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262525\timg/actors/90009.jpg\n19829\t90012\tStacey Dash\tBronx, New York, United States\t0.9826252\timg/actors/90012.jpg\n19829\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.98262507\timg/actors/90008.jpg\n19829\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.982625\timg/actors/10007.jpg\n19829\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826242\timg/actors/90003.jpg\n19829\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262364\timg/actors/10015.jpg\n19829\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.98262334\timg/actors/10004.jpg\n19829\t10010\tTom Hanks\tConcord, California, United States\t0.9826227\timg/actors/10010.jpg\n19829\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826224\timg/actors/10002.jpg\n19829\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9826224\timg/actors/10008.jpg\n19829\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826223\timg/actors/90004.jpg\n19829\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826222\timg/actors/10003.jpg\n19829\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.98262215\timg/actors/90015.jpg\n19829\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826213\timg/actors/10013.jpg\n19829\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826206\timg/actors/90013.jpg\n19829\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826204\timg/actors/90001.jpg\n19829\t10014\tJames Franco\tPalo Alto, California, United States\t0.98262024\timg/actors/10014.jpg\n19829\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9826201\timg/actors/90002.jpg\n19829\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826199\timg/actors/10012.jpg\n19829\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826192\timg/actors/10006.jpg\n19829\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.98261917\timg/actors/10001.jpg\n19829\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826182\timg/actors/90014.jpg\n19829\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826179\timg/actors/90010.jpg\n19829\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826166\timg/actors/90011.jpg\n19901\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826284\timg/actors/90005.jpg\n19901\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262674\timg/actors/90007.jpg\n19901\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826267\timg/actors/90006.jpg\n19901\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262644\timg/actors/10011.jpg\n19901\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826241\timg/actors/10005.jpg\n19901\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826241\timg/actors/10009.jpg\n19901\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262393\timg/actors/90009.jpg\n19901\t90012\tStacey Dash\tBronx, New York, United States\t0.9826238\timg/actors/90012.jpg\n19901\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826237\timg/actors/90008.jpg\n19901\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262364\timg/actors/10007.jpg\n19901\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262274\timg/actors/90003.jpg\n19901\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826223\timg/actors/10015.jpg\n19901\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826219\timg/actors/10004.jpg\n19901\t10010\tTom Hanks\tConcord, California, United States\t0.9826213\timg/actors/10010.jpg\n19901\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9826211\timg/actors/10008.jpg\n19901\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.98262095\timg/actors/10002.jpg\n19901\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.98262095\timg/actors/90004.jpg\n19901\t10003\tAl Pacino\tManhattan, New York, United States\t0.98262084\timg/actors/10003.jpg\n19901\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.98262084\timg/actors/90015.jpg\n19901\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826199\timg/actors/10013.jpg\n19901\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826192\timg/actors/90013.jpg\n19901\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98261905\timg/actors/90001.jpg\n19901\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826188\timg/actors/10014.jpg\n19901\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98261875\timg/actors/90002.jpg\n19901\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98261845\timg/actors/10012.jpg\n19901\t10006\tTom Cruise\tSyracuse, New York, United States\t0.98261786\timg/actors/10006.jpg\n19901\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826178\timg/actors/10001.jpg\n19901\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826168\timg/actors/90014.jpg\n19901\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98261654\timg/actors/90010.jpg\n19901\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261523\timg/actors/90011.jpg\n20269\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826288\timg/actors/90005.jpg\n20269\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.98262715\timg/actors/90006.jpg\n20269\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262715\timg/actors/90007.jpg\n20269\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826268\timg/actors/10011.jpg\n20269\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.98262453\timg/actors/10005.jpg\n20269\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826245\timg/actors/10009.jpg\n20269\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9826243\timg/actors/90009.jpg\n20269\t90012\tStacey Dash\tBronx, New York, United States\t0.9826242\timg/actors/90012.jpg\n20269\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262405\timg/actors/10007.jpg\n20269\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.98262405\timg/actors/90008.jpg\n20269\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262316\timg/actors/90003.jpg\n20269\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262274\timg/actors/10015.jpg\n20269\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826223\timg/actors/10004.jpg\n20269\t10010\tTom Hanks\tConcord, California, United States\t0.98262167\timg/actors/10010.jpg\n20269\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262143\timg/actors/10008.jpg\n20269\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826213\timg/actors/10002.jpg\n20269\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.98262125\timg/actors/90004.jpg\n20269\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.98262125\timg/actors/90015.jpg\n20269\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826212\timg/actors/10003.jpg\n20269\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826203\timg/actors/10013.jpg\n20269\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826197\timg/actors/90013.jpg\n20269\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826194\timg/actors/90001.jpg\n20269\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826193\timg/actors/10014.jpg\n20269\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9826191\timg/actors/90002.jpg\n20269\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98261887\timg/actors/10012.jpg\n20269\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826182\timg/actors/10006.jpg\n20269\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826181\timg/actors/10001.jpg\n20269\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826172\timg/actors/90014.jpg\n20269\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98261696\timg/actors/90010.jpg\n20269\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826156\timg/actors/90011.jpg\n20599\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826281\timg/actors/90005.jpg\n20599\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826265\timg/actors/90006.jpg\n20599\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262644\timg/actors/90007.jpg\n20599\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826261\timg/actors/10011.jpg\n20599\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826238\timg/actors/10005.jpg\n20599\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826238\timg/actors/10009.jpg\n20599\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9826236\timg/actors/90009.jpg\n20599\t90012\tStacey Dash\tBronx, New York, United States\t0.98262346\timg/actors/90012.jpg\n20599\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262334\timg/actors/10007.jpg\n20599\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.98262334\timg/actors/90008.jpg\n20599\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262244\timg/actors/90003.jpg\n20599\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.982622\timg/actors/10015.jpg\n20599\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826216\timg/actors/10004.jpg\n20599\t10010\tTom Hanks\tConcord, California, United States\t0.982621\timg/actors/10010.jpg\n20599\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9826208\timg/actors/10008.jpg\n20599\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826207\timg/actors/10002.jpg\n20599\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.98262066\timg/actors/90004.jpg\n20599\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826206\timg/actors/10003.jpg\n20599\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.98262054\timg/actors/90015.jpg\n20599\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.98261964\timg/actors/10013.jpg\n20599\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826189\timg/actors/90013.jpg\n20599\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98261875\timg/actors/90001.jpg\n20599\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826185\timg/actors/10014.jpg\n20599\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98261845\timg/actors/90002.jpg\n20599\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826182\timg/actors/10012.jpg\n20599\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826175\timg/actors/10006.jpg\n20599\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826174\timg/actors/10001.jpg\n20599\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826165\timg/actors/90014.jpg\n20599\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826162\timg/actors/90010.jpg\n20599\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826149\timg/actors/90011.jpg\n21141\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.982629\timg/actors/90005.jpg\n21141\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262745\timg/actors/90007.jpg\n21141\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.98262733\timg/actors/90006.jpg\n21141\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262703\timg/actors/10011.jpg\n21141\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.98262477\timg/actors/10005.jpg\n21141\t10009\tChazz Palminteri\tBronx, New York, United States\t0.98262477\timg/actors/10009.jpg\n21141\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262453\timg/actors/90009.jpg\n21141\t90012\tStacey Dash\tBronx, New York, United States\t0.9826244\timg/actors/90012.jpg\n21141\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262435\timg/actors/10007.jpg\n21141\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826243\timg/actors/90008.jpg\n21141\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262346\timg/actors/90003.jpg\n21141\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.982623\timg/actors/10015.jpg\n21141\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.98262256\timg/actors/10004.jpg\n21141\t10010\tTom Hanks\tConcord, California, United States\t0.9826219\timg/actors/10010.jpg\n21141\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262167\timg/actors/10008.jpg\n21141\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826216\timg/actors/10002.jpg\n21141\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826216\timg/actors/90004.jpg\n21141\t10003\tAl Pacino\tManhattan, New York, United States\t0.98262143\timg/actors/10003.jpg\n21141\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.98262143\timg/actors/90015.jpg\n21141\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826205\timg/actors/10013.jpg\n21141\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826199\timg/actors/90013.jpg\n21141\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98261964\timg/actors/90001.jpg\n21141\t10014\tJames Franco\tPalo Alto, California, United States\t0.98261946\timg/actors/10014.jpg\n21141\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98261935\timg/actors/90002.jpg\n21141\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98261917\timg/actors/10012.jpg\n21141\t10006\tTom Cruise\tSyracuse, New York, United States\t0.98261845\timg/actors/10006.jpg\n21141\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826184\timg/actors/10001.jpg\n21141\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826175\timg/actors/90014.jpg\n21141\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826172\timg/actors/90010.jpg\n21141\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826158\timg/actors/90011.jpg\n21423\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.98262876\timg/actors/90005.jpg\n21423\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.98262715\timg/actors/90006.jpg\n21423\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826271\timg/actors/90007.jpg\n21423\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262674\timg/actors/10011.jpg\n21423\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826245\timg/actors/10005.jpg\n21423\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826245\timg/actors/10009.jpg\n21423\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262423\timg/actors/90009.jpg\n21423\t90012\tStacey Dash\tBronx, New York, United States\t0.9826242\timg/actors/90012.jpg\n21423\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262405\timg/actors/10007.jpg\n21423\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.98262405\timg/actors/90008.jpg\n21423\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826231\timg/actors/90003.jpg\n21423\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262274\timg/actors/10015.jpg\n21423\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.98262227\timg/actors/10004.jpg\n21423\t10010\tTom Hanks\tConcord, California, United States\t0.98262167\timg/actors/10010.jpg\n21423\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262143\timg/actors/10008.jpg\n21423\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826213\timg/actors/10002.jpg\n21423\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826213\timg/actors/90004.jpg\n21423\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826212\timg/actors/10003.jpg\n21423\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826212\timg/actors/90015.jpg\n21423\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.98262024\timg/actors/10013.jpg\n21423\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826197\timg/actors/90013.jpg\n21423\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826194\timg/actors/90001.jpg\n21423\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826192\timg/actors/10014.jpg\n21423\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98261905\timg/actors/90002.jpg\n21423\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826188\timg/actors/10012.jpg\n21423\t10006\tTom Cruise\tSyracuse, New York, United States\t0.98261815\timg/actors/10006.jpg\n21423\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826181\timg/actors/10001.jpg\n21423\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826172\timg/actors/90014.jpg\n21423\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98261696\timg/actors/90010.jpg\n21423\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826156\timg/actors/90011.jpg\n21619\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.98263025\timg/actors/90005.jpg\n21619\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826287\timg/actors/90006.jpg\n21619\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826287\timg/actors/90007.jpg\n21619\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826283\timg/actors/10011.jpg\n21619\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826261\timg/actors/10005.jpg\n21619\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826261\timg/actors/10009.jpg\n21619\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9826258\timg/actors/90009.jpg\n21619\t90012\tStacey Dash\tBronx, New York, United States\t0.9826257\timg/actors/90012.jpg\n21619\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826256\timg/actors/10007.jpg\n21619\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826256\timg/actors/90008.jpg\n21619\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826247\timg/actors/90003.jpg\n21619\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262423\timg/actors/10015.jpg\n21619\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826238\timg/actors/10004.jpg\n21619\t10010\tTom Hanks\tConcord, California, United States\t0.9826232\timg/actors/10010.jpg\n21619\t10008\tRobert De Niro\tManhattan, New York, United States\t0.982623\timg/actors/10008.jpg\n21619\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.98262286\timg/actors/10002.jpg\n21619\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.98262286\timg/actors/90004.jpg\n21619\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.98262286\timg/actors/90015.jpg\n21619\t10003\tAl Pacino\tManhattan, New York, United States\t0.98262274\timg/actors/10003.jpg\n21619\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826219\timg/actors/10013.jpg\n21619\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826212\timg/actors/90013.jpg\n21619\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.982621\timg/actors/90001.jpg\n21619\t10014\tJames Franco\tPalo Alto, California, United States\t0.98262084\timg/actors/10014.jpg\n21619\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9826206\timg/actors/90002.jpg\n21619\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826204\timg/actors/10012.jpg\n21619\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826198\timg/actors/10006.jpg\n21619\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.98261964\timg/actors/10001.jpg\n21619\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.98261875\timg/actors/90014.jpg\n21619\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98261845\timg/actors/90010.jpg\n21619\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261714\timg/actors/90011.jpg\n22945\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.98263067\timg/actors/90005.jpg\n22945\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826291\timg/actors/90006.jpg\n22945\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262906\timg/actors/90007.jpg\n22945\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826287\timg/actors/10011.jpg\n22945\t10009\tChazz Palminteri\tBronx, New York, United States\t0.98262644\timg/actors/10009.jpg\n22945\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826264\timg/actors/10005.jpg\n22945\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9826262\timg/actors/90009.jpg\n22945\t90012\tStacey Dash\tBronx, New York, United States\t0.9826261\timg/actors/90012.jpg\n22945\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.982626\timg/actors/90008.jpg\n22945\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262596\timg/actors/10007.jpg\n22945\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262507\timg/actors/90003.jpg\n22945\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826246\timg/actors/10015.jpg\n22945\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.98262423\timg/actors/10004.jpg\n22945\t10010\tTom Hanks\tConcord, California, United States\t0.9826236\timg/actors/10010.jpg\n22945\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9826234\timg/actors/10008.jpg\n22945\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826233\timg/actors/10002.jpg\n22945\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826232\timg/actors/90004.jpg\n22945\t10003\tAl Pacino\tManhattan, New York, United States\t0.98262316\timg/actors/10003.jpg\n22945\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.98262316\timg/actors/90015.jpg\n22945\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826222\timg/actors/10013.jpg\n22945\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826216\timg/actors/90013.jpg\n22945\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826213\timg/actors/90001.jpg\n22945\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826212\timg/actors/10014.jpg\n22945\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.982621\timg/actors/90002.jpg\n22945\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98262084\timg/actors/10012.jpg\n22945\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826202\timg/actors/10006.jpg\n22945\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.98262\timg/actors/10001.jpg\n22945\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826191\timg/actors/90014.jpg\n22945\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98261887\timg/actors/90010.jpg\n22945\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826175\timg/actors/90011.jpg\n23393\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.98262703\timg/actors/90005.jpg\n23393\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.98262537\timg/actors/90006.jpg\n23393\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262537\timg/actors/90007.jpg\n23393\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262507\timg/actors/10011.jpg\n23393\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.98262274\timg/actors/10005.jpg\n23393\t10009\tChazz Palminteri\tBronx, New York, United States\t0.98262274\timg/actors/10009.jpg\n23393\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262256\timg/actors/90009.jpg\n23393\t90012\tStacey Dash\tBronx, New York, United States\t0.9826225\timg/actors/90012.jpg\n23393\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826224\timg/actors/90008.jpg\n23393\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262227\timg/actors/10007.jpg\n23393\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262143\timg/actors/90003.jpg\n23393\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262095\timg/actors/10015.jpg\n23393\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826206\timg/actors/10004.jpg\n23393\t10010\tTom Hanks\tConcord, California, United States\t0.98262\timg/actors/10010.jpg\n23393\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9826197\timg/actors/10008.jpg\n23393\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.98261964\timg/actors/10002.jpg\n23393\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.98261964\timg/actors/90004.jpg\n23393\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826195\timg/actors/10003.jpg\n23393\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826195\timg/actors/90015.jpg\n23393\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826185\timg/actors/10013.jpg\n23393\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.982618\timg/actors/90013.jpg\n23393\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826176\timg/actors/90001.jpg\n23393\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826175\timg/actors/10014.jpg\n23393\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9826174\timg/actors/90002.jpg\n23393\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98261714\timg/actors/10012.jpg\n23393\t10006\tTom Cruise\tSyracuse, New York, United States\t0.9826165\timg/actors/10006.jpg\n23393\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.98261636\timg/actors/10001.jpg\n23393\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826155\timg/actors/90014.jpg\n23393\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.98261523\timg/actors/90010.jpg\n23393\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261386\timg/actors/90011.jpg\n23983\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.9826305\timg/actors/90005.jpg\n23983\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262894\timg/actors/90007.jpg\n23983\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826289\timg/actors/90006.jpg\n23983\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262846\timg/actors/10011.jpg\n23983\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826262\timg/actors/10005.jpg\n23983\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826262\timg/actors/10009.jpg\n23983\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262596\timg/actors/90009.jpg\n23983\t90012\tStacey Dash\tBronx, New York, United States\t0.98262596\timg/actors/90012.jpg\n23983\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826258\timg/actors/90008.jpg\n23983\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826257\timg/actors/10007.jpg\n23983\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826249\timg/actors/90003.jpg\n23983\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826244\timg/actors/10015.jpg\n23983\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.98262405\timg/actors/10004.jpg\n23983\t10010\tTom Hanks\tConcord, California, United States\t0.9826234\timg/actors/10010.jpg\n23983\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826231\timg/actors/10002.jpg\n23983\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9826231\timg/actors/10008.jpg\n23983\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.9826231\timg/actors/90004.jpg\n23983\t10003\tAl Pacino\tManhattan, New York, United States\t0.982623\timg/actors/10003.jpg\n23983\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826229\timg/actors/90015.jpg\n23983\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.982622\timg/actors/10013.jpg\n23983\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826214\timg/actors/90013.jpg\n23983\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.9826212\timg/actors/90001.jpg\n23983\t10014\tJames Franco\tPalo Alto, California, United States\t0.98262095\timg/actors/10014.jpg\n23983\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9826208\timg/actors/90002.jpg\n23983\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.98262066\timg/actors/10012.jpg\n23983\t10006\tTom Cruise\tSyracuse, New York, United States\t0.98262\timg/actors/10006.jpg\n23983\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826198\timg/actors/10001.jpg\n23983\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826189\timg/actors/90014.jpg\n23983\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826187\timg/actors/90010.jpg\n23983\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261726\timg/actors/90011.jpg\n24600\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.98262715\timg/actors/90005.jpg\n24600\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826256\timg/actors/90006.jpg\n24600\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826256\timg/actors/90007.jpg\n24600\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.98262525\timg/actors/10011.jpg\n24600\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.982623\timg/actors/10005.jpg\n24600\t10009\tChazz Palminteri\tBronx, New York, United States\t0.982623\timg/actors/10009.jpg\n24600\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.98262274\timg/actors/90009.jpg\n24600\t90012\tStacey Dash\tBronx, New York, United States\t0.9826226\timg/actors/90012.jpg\n24600\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826225\timg/actors/10007.jpg\n24600\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826225\timg/actors/90008.jpg\n24600\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.98262155\timg/actors/90003.jpg\n24600\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.98262113\timg/actors/10015.jpg\n24600\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826207\timg/actors/10004.jpg\n24600\t10010\tTom Hanks\tConcord, California, United States\t0.9826201\timg/actors/10010.jpg\n24600\t10008\tRobert De Niro\tManhattan, New York, United States\t0.98262\timg/actors/10008.jpg\n24600\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.9826198\timg/actors/10002.jpg\n24600\t10003\tAl Pacino\tManhattan, New York, United States\t0.98261976\timg/actors/10003.jpg\n24600\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.98261976\timg/actors/90004.jpg\n24600\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826197\timg/actors/90015.jpg\n24600\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.98261875\timg/actors/10013.jpg\n24600\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.98261815\timg/actors/90013.jpg\n24600\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98261786\timg/actors/90001.jpg\n24600\t10014\tJames Franco\tPalo Alto, California, United States\t0.9826177\timg/actors/10014.jpg\n24600\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.9826176\timg/actors/90002.jpg\n24600\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826174\timg/actors/10012.jpg\n24600\t10006\tTom Cruise\tSyracuse, New York, United States\t0.98261666\timg/actors/10006.jpg\n24600\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826166\timg/actors/10001.jpg\n24600\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.98261565\timg/actors/90014.jpg\n24600\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826154\timg/actors/90010.jpg\n24600\t90011\tAshley Judd\tGranada Hills, California, United States\t0.98261404\timg/actors/90011.jpg\n25094\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.982628\timg/actors/90005.jpg\n25094\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826264\timg/actors/90006.jpg\n25094\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.9826263\timg/actors/90007.jpg\n25094\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826261\timg/actors/10011.jpg\n25094\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.98262376\timg/actors/10005.jpg\n25094\t10009\tChazz Palminteri\tBronx, New York, United States\t0.9826237\timg/actors/10009.jpg\n25094\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9826235\timg/actors/90009.jpg\n25094\t90012\tStacey Dash\tBronx, New York, United States\t0.9826234\timg/actors/90012.jpg\n25094\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.9826233\timg/actors/10007.jpg\n25094\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.9826233\timg/actors/90008.jpg\n25094\t90003\tRosalind Allen\tWellington, New Zealand, New Zealand\t0.9826224\timg/actors/90003.jpg\n25094\t10015\tClive Owen\tCoventry, Warwickshire, England\t0.9826219\timg/actors/10015.jpg\n25094\t10004\tMorgan Freeman\tMemphis, Tennessee, United States\t0.9826216\timg/actors/10004.jpg\n25094\t10010\tTom Hanks\tConcord, California, United States\t0.9826209\timg/actors/10010.jpg\n25094\t10008\tRobert De Niro\tManhattan, New York, United States\t0.9826207\timg/actors/10008.jpg\n25094\t10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\t0.98262054\timg/actors/10002.jpg\n25094\t90004\tBobbie Phillips\tSalisbury, North Carolina, United States\t0.98262054\timg/actors/90004.jpg\n25094\t10003\tAl Pacino\tManhattan, New York, United States\t0.9826205\timg/actors/10003.jpg\n25094\t90015\tBarbara Niven\tPortland, Oregon, United States\t0.9826204\timg/actors/90015.jpg\n25094\t10013\tMark Wahlberg\tBoston, Massachusetts, United States\t0.9826195\timg/actors/10013.jpg\n25094\t90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\t0.9826189\timg/actors/90013.jpg\n25094\t90001\tLinda Blair\tSt. Louis, Missouri, United States\t0.98261863\timg/actors/90001.jpg\n25094\t10014\tJames Franco\tPalo Alto, California, United States\t0.98261845\timg/actors/10014.jpg\n25094\t90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\t0.98261833\timg/actors/90002.jpg\n25094\t10012\tJohnny Depp\tOwensboro, Kentucky, United States\t0.9826181\timg/actors/10012.jpg\n25094\t10006\tTom Cruise\tSyracuse, New York, United States\t0.98261744\timg/actors/10006.jpg\n25094\t10001\tLeonardo DiCaprio\tHollywood, California, United States\t0.9826174\timg/actors/10001.jpg\n25094\t90014\tGail O\u0027Grady\tDetroit, Michigan, United States\t0.9826165\timg/actors/90014.jpg\n25094\t90010\tTiffani Thiessen\tLong Beach, California, United States\t0.9826162\timg/actors/90010.jpg\n25094\t90011\tAshley Judd\tGranada Hills, California, United States\t0.9826149\timg/actors/90011.jpg\n25237\t90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\t0.98263013\timg/actors/90005.jpg\n25237\t90007\tAngell Conwell\tOrangeburg, South Carolina, United States\t0.98262846\timg/actors/90007.jpg\n25237\t90006\tTatyana Ali\tBrooklyn, New York, United States\t0.9826284\timg/actors/90006.jpg\n25237\t10011\tJohn Travolta\tEnglewood, New York, United States\t0.9826281\timg/actors/10011.jpg\n25237\t10009\tChazz Palminteri\tBronx, New York, United States\t0.98262584\timg/actors/10009.jpg\n25237\t10005\tJames Gandolfini\tWestwood, New Jersey, United States\t0.9826258\timg/actors/10005.jpg\n25237\t90009\tPam Grier\tWinstom-Salem, North Carolina, United States\t0.9826256\timg/actors/90009.jpg\n25237\t90012\tStacey Dash\tBronx, New York, United States\t0.9826255\timg/actors/90012.jpg\n25237\t10007\tDenzel Washington\tMount Vernon, New York, United States\t0.98262537\timg/actors/10007.jpg\n25237\t90008\tShannah Laumeister\tSan Francisco, California, United States\t0.98262537\timg/actors/90008.jpg\n\n\u003cfont color\u003dred\u003eResults are limited by 1000.\u003c/font\u003e"
      },
      "dateCreated": "Apr 17, 2016 7:53:45 PM",
      "dateStarted": "Jun 21, 2016 3:43:46 PM",
      "dateFinished": "Jun 21, 2016 3:44:04 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "text": "// import com.netflix.dyno.jedis._\n// import com.netflix.dyno.connectionpool.Host\n// import com.netflix.dyno.connectionpool.HostSupplier\n// import com.netflix.dyno.connectionpool.TokenMapSupplier\n// import com.netflix.dyno.connectionpool.impl.lb.HostToken\n// import com.netflix.dyno.connectionpool.exception.DynoException\n// import com.netflix.dyno.connectionpool.impl.ConnectionPoolConfigurationImpl;\n// import com.netflix.dyno.connectionpool.impl.ConnectionContextImpl\n// import com.netflix.dyno.connectionpool.impl.OperationResultImpl\n// import com.netflix.dyno.connectionpool.impl.utils.ZipUtils\n\n// //import scala.collection.JavaConverters._\n\n// import java.util.Collections\n// import java.util.Collection\n// import java.util.Set\n// import java.util.List\n\n// val localhostHost \u003d new Host(\"127.0.0.1\", Host.Status.Up)\n// val localhostToken \u003d new HostToken(100000L, localhostHost)\n\n// val localhostHostSupplier \u003d new HostSupplier() {\n//  @Override\n//  def getHosts(): Collection[Host] \u003d {\n//     Collections.singletonList(localhostHost)\n//  }\n// }\n\n// val localhostTokenMapSupplier \u003d new TokenMapSupplier() {\n//  @Override\n//  def getTokens(activeHosts: Set[Host]): List[HostToken] \u003d {\n// \tCollections.singletonList(localhostToken)\n//  }\n\n//  @Override\n//  def getTokenForHost(host: Host, activeHosts: Set[Host]): HostToken \u003d {\n//     return localhostToken\n//  }\n// }\n\n// val redisPort \u003d 6379                        \n// val dynoClient \u003d new DynoJedisClient.Builder()\n//              .withApplicationName(\"pipeline\")\n//              .withDynomiteClusterName(\"pipeline-dynomite\")\n//              .withHostSupplier(localhostHostSupplier)\n//              .withCPConfig(new ConnectionPoolConfigurationImpl(\"localhostTokenMapSupplier\")\n//                 .withTokenSupplier(localhostTokenMapSupplier))\n//              .withPort(redisPort)\n//              .build()\n\n// val recommendations \u003d enrichedRecommendationsDF.collect()\n\n// dynoClient.set(\"personalized-als\", recommendations.mkString(\",\"))    \n\n// val retrievedRecommenations \u003d dynoClient.get(\"personalized-als\")\n\n// dynoClient.stopClient()",
      "dateUpdated": "Jun 21, 2016 3:43:29 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala"
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465623520589_1668216997",
      "id": "20160611-053840_879401130",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": ""
      },
      "dateCreated": "Jun 11, 2016 5:38:40 AM",
      "dateStarted": "Jun 21, 2016 3:43:51 PM",
      "dateFinished": "Jun 21, 2016 3:44:04 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "text": "%md ## Bonus:  Storing the User and Item Factors (Referenced Later...)",
      "dateUpdated": "Jun 21, 2016 3:43:29 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/markdown",
        "editorHide": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1466129842555_-274065334",
      "id": "20160617-021722_1145491210",
      "result": {
        "code": "SUCCESS",
        "type": "HTML",
        "msg": "\u003ch2\u003eBonus:  Storing the User and Item Factors (Referenced Later\u0026hellip;)\u003c/h2\u003e\n"
      },
      "dateCreated": "Jun 17, 2016 2:17:22 AM",
      "dateStarted": "Jun 21, 2016 3:43:29 PM",
      "dateFinished": "Jun 21, 2016 3:43:30 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Show UserFactors Matrix",
      "text": "val userFactorsDF \u003d model.userFactors.map(row \u003d\u003e \n  (row.getInt(0), row.getSeq[Float](1).toArray.map(_.toDouble))\n).toDF(\"userId\", \"userFactors\")\n .sort($\"userId\" asc)\n .as(\"userFactors\")\n\nz.show(userFactorsDF)",
      "dateUpdated": "Jun 21, 2016 3:43:29 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 129.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "userFactors",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "userId",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "userFactors",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456873568687_1047705598",
      "id": "20160301-230608_2073461478",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "userId\tuserFactors\n666\tWrappedArray(0.2292724996805191, 0.9536073803901672, 0.3731963336467743, 0.7747964859008789, 0.07840844243764877)\n671\tWrappedArray(0.2292865663766861, 0.9536304473876953, 0.37319788336753845, 0.7747626900672913, 0.07841835916042328)\n2708\tWrappedArray(0.22929100692272186, 0.9536218643188477, 0.37318024039268494, 0.7747747898101807, 0.0784284919500351)\n2879\tWrappedArray(0.22925667464733124, 0.9535894393920898, 0.37316980957984924, 0.774830162525177, 0.07840589433908463)\n5980\tWrappedArray(0.22929374873638153, 0.9536360502243042, 0.3732149302959442, 0.774749219417572, 0.0784190371632576)\n5983\tWrappedArray(0.22928082942962646, 0.9536232948303223, 0.37315723299980164, 0.774782657623291, 0.0784265473484993)\n7467\tWrappedArray(0.22928662598133087, 0.9536012411117554, 0.3732120990753174, 0.774793267250061, 0.07840313762426376)\n7726\tWrappedArray(0.22927428781986237, 0.9536064267158508, 0.3731923997402191, 0.7747972011566162, 0.07841158658266068)\n9040\tWrappedArray(0.22929120063781738, 0.953616201877594, 0.3731895983219147, 0.7747796177864075, 0.07841724157333374)\n9773\tWrappedArray(0.2292863428592682, 0.9536274075508118, 0.3731984794139862, 0.7747660875320435, 0.07841978967189789)\n10198\tWrappedArray(0.2292894423007965, 0.9536187052726746, 0.37318679690361023, 0.774777889251709, 0.07842261344194412)\n10469\tWrappedArray(0.22928766906261444, 0.9536170363426208, 0.37316960096359253, 0.7747848033905029, 0.07842855155467987)\n10921\tWrappedArray(0.22927570343017578, 0.9536058902740479, 0.37317121028900146, 0.7748014330863953, 0.07841441035270691)\n11905\tWrappedArray(0.22928404808044434, 0.9536121487617493, 0.3732028901576996, 0.7747836112976074, 0.07840859144926071)\n13397\tWrappedArray(0.22928260266780853, 0.9536130428314209, 0.37319910526275635, 0.7747849225997925, 0.0784134492278099)\n14806\tWrappedArray(0.2292862981557846, 0.9536259770393372, 0.3731904625892639, 0.7747695446014404, 0.07842208445072174)\n17802\tWrappedArray(0.22928719222545624, 0.9536272883415222, 0.37321367859840393, 0.7747622728347778, 0.07841327786445618)\n17928\tWrappedArray(0.2292906641960144, 0.953635036945343, 0.37323635816574097, 0.7747471332550049, 0.07841047644615173)\n18910\tWrappedArray(0.2292867749929428, 0.953629195690155, 0.37319082021713257, 0.77476567029953, 0.07842233777046204)\n19149\tWrappedArray(0.22929584980010986, 0.9536292552947998, 0.37318962812423706, 0.7747618556022644, 0.07842940092086792)\n19186\tWrappedArray(0.22928407788276672, 0.9536285996437073, 0.3731885552406311, 0.7747679948806763, 0.07842060923576355)\n19829\tWrappedArray(0.22928856313228607, 0.9535985589027405, 0.37321099638938904, 0.774795413017273, 0.07840203493833542)\n19901\tWrappedArray(0.22929634153842926, 0.9536169767379761, 0.3731885254383087, 0.7747759819030762, 0.07842400670051575)\n20269\tWrappedArray(0.22928903996944427, 0.9536269903182983, 0.37318259477615356, 0.7747693061828613, 0.07842651754617691)\n20599\tWrappedArray(0.22927960753440857, 0.9536175727844238, 0.37317362427711487, 0.7747867703437805, 0.07842332869768143)\n21141\tWrappedArray(0.22930771112442017, 0.9536387324333191, 0.37318482995033264, 0.7747474312782288, 0.07843993604183197)\n21423\tWrappedArray(0.22929216921329498, 0.9536330699920654, 0.3731814920902252, 0.7747610807418823, 0.07842934876680374)\n21619\tWrappedArray(0.22929008305072784, 0.9536245465278625, 0.373201847076416, 0.7747671008110046, 0.07841748744249344)\n22945\tWrappedArray(0.22928370535373688, 0.953626275062561, 0.3732048273086548, 0.774766743183136, 0.07841275632381439)\n23393\tWrappedArray(0.22929412126541138, 0.9536356925964355, 0.3731594979763031, 0.7747631072998047, 0.07843837141990662)\n23983\tWrappedArray(0.22929923236370087, 0.9536311626434326, 0.37320056557655334, 0.7747562527656555, 0.0784275233745575)\n24600\tWrappedArray(0.22929206490516663, 0.9536357522010803, 0.373163640499115, 0.7747622132301331, 0.07843707501888275)\n25094\tWrappedArray(0.22928151488304138, 0.9536030888557434, 0.3731830418109894, 0.774800181388855, 0.07841464877128601)\n25237\tWrappedArray(0.22927923500537872, 0.9536065459251404, 0.3732030987739563, 0.7747925519943237, 0.07840562611818314)\n25475\tWrappedArray(0.22929805517196655, 0.9536230564117432, 0.3732181489467621, 0.7747612595558167, 0.07841621339321136)\n27981\tWrappedArray(0.2292807400226593, 0.953620195388794, 0.3731958568096161, 0.7747775316238403, 0.07841645181179047)\n28024\tWrappedArray(0.22929143905639648, 0.9536337852478027, 0.37316712737083435, 0.7747640609741211, 0.07843435555696487)\n28865\tWrappedArray(0.22928626835346222, 0.9536231756210327, 0.373187392950058, 0.7747741341590881, 0.07842320948839188)\n29428\tWrappedArray(0.2292901575565338, 0.9536247849464417, 0.3732108175754547, 0.7747654318809509, 0.07841506600379944)\n30205\tWrappedArray(0.2292856127023697, 0.9536223411560059, 0.3732098639011383, 0.7747699618339539, 0.0784127414226532)\n30699\tWrappedArray(0.22929218411445618, 0.953637957572937, 0.3732239305973053, 0.7747457027435303, 0.07841663807630539)\n30701\tWrappedArray(0.2292892187833786, 0.9536294341087341, 0.3732074499130249, 0.7747605443000793, 0.07841843366622925)\n31604\tWrappedArray(0.2292877584695816, 0.953623354434967, 0.37320855259895325, 0.7747678160667419, 0.07841411232948303)\n32831\tWrappedArray(0.22928644716739655, 0.9536035060882568, 0.37319567799568176, 0.7747945189476013, 0.07840953767299652)\n32940\tWrappedArray(0.22927558422088623, 0.9535901546478271, 0.3731814920902252, 0.7748181819915771, 0.07840664684772491)\n34091\tWrappedArray(0.2292913794517517, 0.9536171555519104, 0.373183012008667, 0.7747799158096313, 0.07842250168323517)\n34615\tWrappedArray(0.2292950600385666, 0.9536280632019043, 0.373218297958374, 0.7747573256492615, 0.07841543853282928)\n34638\tWrappedArray(0.22928860783576965, 0.9536213874816895, 0.37318727374076843, 0.7747747898101807, 0.07842337340116501)\n34643\tWrappedArray(0.22929182648658752, 0.9536318778991699, 0.3732253611087799, 0.7747529149055481, 0.0784129649400711)\n34830\tWrappedArray(0.22928504645824432, 0.9536237716674805, 0.373198926448822, 0.7747706770896912, 0.07841724157333374)\n34902\tWrappedArray(0.22927062213420868, 0.9535990357398987, 0.37316247820854187, 0.7748139500617981, 0.07841773331165314)\n35215\tWrappedArray(0.2292855978012085, 0.9536212086677551, 0.37317922711372375, 0.7747781872749329, 0.07842310518026352)\n35574\tWrappedArray(0.22928999364376068, 0.9536228179931641, 0.3731994926929474, 0.7747696042060852, 0.07841803133487701)\n35851\tWrappedArray(0.22928394377231598, 0.9536299705505371, 0.3732069432735443, 0.7747620940208435, 0.07841639965772629)\n36401\tWrappedArray(0.22927223145961761, 0.9536231756210327, 0.3731434643268585, 0.774789571762085, 0.0784282311797142)\n37597\tWrappedArray(0.22927269339561462, 0.9536096453666687, 0.373188853263855, 0.7747954726219177, 0.07841233164072037)\n38808\tWrappedArray(0.2292795032262802, 0.9536285996437073, 0.3731457591056824, 0.7747799158096313, 0.07843147218227386)\n39043\tWrappedArray(0.22928188741207123, 0.9536235332489014, 0.37319502234458923, 0.7747728824615479, 0.07841812819242477)\n39819\tWrappedArray(0.22928659617900848, 0.9536247253417969, 0.37318146228790283, 0.7747729420661926, 0.07842432707548141)\n40429\tWrappedArray(0.2292805016040802, 0.953609824180603, 0.37317100167274475, 0.7747962474822998, 0.07841849327087402)\n41802\tWrappedArray(0.22928430140018463, 0.953618586063385, 0.3731899559497833, 0.7747787833213806, 0.0784166157245636)\n42197\tWrappedArray(0.22928905487060547, 0.9535958766937256, 0.3731895089149475, 0.7748041152954102, 0.07840833067893982)\n42474\tWrappedArray(0.22928620874881744, 0.953611433506012, 0.37320879101753235, 0.7747825384140015, 0.07840835303068161)\n43016\tWrappedArray(0.22928903996944427, 0.9536229372024536, 0.3731856942176819, 0.7747730016708374, 0.07842598855495453)\n43026\tWrappedArray(0.22928112745285034, 0.9536123871803284, 0.3731837272644043, 0.7747889161109924, 0.07841654866933823)\n43287\tWrappedArray(0.22927305102348328, 0.9536219239234924, 0.3731515109539032, 0.7747888565063477, 0.07842621952295303)\n44433\tWrappedArray(0.22928375005722046, 0.9536256790161133, 0.3731996417045593, 0.7747684717178345, 0.07841721922159195)\n44807\tWrappedArray(0.22928619384765625, 0.953635036945343, 0.37316641211509705, 0.774764895439148, 0.07843156903982162)\n44954\tWrappedArray(0.22929218411445618, 0.953637957572937, 0.3732239305973053, 0.7747457027435303, 0.07841663807630539)\n45486\tWrappedArray(0.22927699983119965, 0.9535875916481018, 0.37314897775650024, 0.774827778339386, 0.07841356098651886)\n45929\tWrappedArray(0.22928060591220856, 0.9536178708076477, 0.37317532300949097, 0.7747854590415955, 0.0784214437007904)\n46843\tWrappedArray(0.22928102314472198, 0.9536193609237671, 0.3731798231601715, 0.7747822403907776, 0.07841908931732178)\n47366\tWrappedArray(0.22927802801132202, 0.9536282420158386, 0.3732236623764038, 0.7747624516487122, 0.07841033488512039)\n47948\tWrappedArray(0.2292943298816681, 0.9536290168762207, 0.3731979727745056, 0.7747611403465271, 0.07842420041561127)\n49153\tWrappedArray(0.22929318249225616, 0.9536275863647461, 0.37318122386932373, 0.7747672200202942, 0.07842806726694107)\n49906\tWrappedArray(0.22928902506828308, 0.9536274671554565, 0.37321704626083374, 0.7747606635093689, 0.07841351628303528)\n49992\tWrappedArray(0.22929561138153076, 0.9536303877830505, 0.37320172786712646, 0.7747579216957092, 0.07842507213354111)\n50171\tWrappedArray(0.22928297519683838, 0.9536207318305969, 0.3731837570667267, 0.7747787833213806, 0.07842115312814713)\n52654\tWrappedArray(0.2292845994234085, 0.9536306858062744, 0.3732028305530548, 0.7747620344161987, 0.07841771841049194)\n53395\tWrappedArray(0.2292802929878235, 0.9536178708076477, 0.37316739559173584, 0.774787187576294, 0.07842451333999634)\n53758\tWrappedArray(0.22928471863269806, 0.9536265134811401, 0.3731589913368225, 0.774777352809906, 0.07843334972858429)\n53817\tWrappedArray(0.22929240763187408, 0.9536350965499878, 0.37322041392326355, 0.7747496366500854, 0.07841923832893372)\n53980\tWrappedArray(0.22927533090114594, 0.9536097645759583, 0.37319880723953247, 0.7747920155525208, 0.0784100592136383)\n54570\tWrappedArray(0.2292640060186386, 0.9536103010177612, 0.37316998839378357, 0.7748022675514221, 0.07841315120458603)\n55425\tWrappedArray(0.22928407788276672, 0.9536299705505371, 0.37321242690086365, 0.7747607231140137, 0.0784134566783905)\n56770\tWrappedArray(0.2292809784412384, 0.9536189436912537, 0.37318333983421326, 0.7747816443443298, 0.07841619104146957)\n57052\tWrappedArray(0.2292860895395279, 0.9536298513412476, 0.3731708526611328, 0.7747694849967957, 0.07842933386564255)\n57462\tWrappedArray(0.22928868234157562, 0.9536294341087341, 0.37320318818092346, 0.7747621536254883, 0.07841803133487701)\n57606\tWrappedArray(0.22928927838802338, 0.9536239504814148, 0.37319013476371765, 0.7747711539268494, 0.07842179387807846)\n58436\tWrappedArray(0.22928698360919952, 0.9536166787147522, 0.3732014000415802, 0.7747777104377747, 0.07841329276561737)\n59047\tWrappedArray(0.2292921543121338, 0.9536262154579163, 0.37320661544799805, 0.7747634649276733, 0.07841844111680984)\n60009\tWrappedArray(0.22927622497081757, 0.9536259770393372, 0.3731745779514313, 0.7747769355773926, 0.07841973751783371)\n60365\tWrappedArray(0.22928759455680847, 0.953625500202179, 0.37319228053092957, 0.774769127368927, 0.0784226581454277)\n60555\tWrappedArray(0.22928404808044434, 0.9536099433898926, 0.3731955885887146, 0.7747889161109924, 0.07841546833515167)\n61945\tWrappedArray(0.2292800098657608, 0.9536176323890686, 0.3731400966644287, 0.7747938632965088, 0.07843147218227386)\n61982\tWrappedArray(0.22928209602832794, 0.9536224603652954, 0.37318986654281616, 0.774774968624115, 0.07841707766056061)\n62431\tWrappedArray(0.22928477823734283, 0.9535611271858215, 0.37318992614746094, 0.7748454809188843, 0.07839159667491913)\n62554\tWrappedArray(0.22929485142230988, 0.9536319375038147, 0.3731894791126251, 0.7747594714164734, 0.07842693477869034)\n62948\tWrappedArray(0.22928597033023834, 0.9536272287368774, 0.3731994330883026, 0.7747660875320435, 0.07841749489307404)\n63041\tWrappedArray(0.22927457094192505, 0.9536101222038269, 0.3731982409954071, 0.7747917771339417, 0.0784093588590622)\n64121\tWrappedArray(0.2292867749929428, 0.9536201357841492, 0.3731845021247864, 0.7747778296470642, 0.07842064648866653)\n64504\tWrappedArray(0.22928443551063538, 0.9536261558532715, 0.37320512533187866, 0.7747668623924255, 0.07841590791940689)\n65336\tWrappedArray(0.22928602993488312, 0.9536224603652954, 0.3731961250305176, 0.774772584438324, 0.07841968536376953)\n66348\tWrappedArray(0.2292858213186264, 0.9536230564117432, 0.3731934130191803, 0.7747719287872314, 0.07841649651527405)\n66907\tWrappedArray(0.22927136719226837, 0.9536033272743225, 0.37317585945129395, 0.7748062014579773, 0.07841432094573975)\n67581\tWrappedArray(0.22931084036827087, 0.9536406397819519, 0.3731921315193176, 0.7747417092323303, 0.07844123244285583)\n68641\tWrappedArray(0.22927476465702057, 0.9536206126213074, 0.3731580376625061, 0.774787962436676, 0.07842429727315903)\n68754\tWrappedArray(0.22927561402320862, 0.9536164402961731, 0.37318867444992065, 0.7747858762741089, 0.07841776311397552)\n68962\tWrappedArray(0.2292788326740265, 0.9536158442497253, 0.37319785356521606, 0.7747833728790283, 0.07841432839632034)\n69265\tWrappedArray(0.2292843461036682, 0.9536316394805908, 0.3732300102710724, 0.7747548222541809, 0.07841040939092636)\n69278\tWrappedArray(0.22928981482982635, 0.953628420829773, 0.37321680784225464, 0.77475905418396, 0.07841359078884125)\n69971\tWrappedArray(0.22928446531295776, 0.9536290168762207, 0.3731421232223511, 0.7747783064842224, 0.07843907922506332)\n70281\tWrappedArray(0.22927793860435486, 0.9536364078521729, 0.3731149137020111, 0.774779200553894, 0.0784451961517334)\n70370\tWrappedArray(0.22927749156951904, 0.9536131620407104, 0.37318798899650574, 0.774789035320282, 0.0784144178032875)\n71084\tWrappedArray(0.2292868047952652, 0.9536213278770447, 0.37319356203079224, 0.7747738361358643, 0.0784207433462143)\n72604\tWrappedArray(0.22927770018577576, 0.9536062479019165, 0.3731747269630432, 0.7747995853424072, 0.07841479778289795)\n72875\tWrappedArray(0.22929488122463226, 0.9536324739456177, 0.3731798231601715, 0.774760901927948, 0.07843103259801865)\n72996\tWrappedArray(0.22929181158542633, 0.9536291360855103, 0.3732183277606964, 0.7747575044631958, 0.07841354608535767)\n73942\tWrappedArray(0.22929541766643524, 0.9536193609237671, 0.3731898069381714, 0.7747735381126404, 0.07842279225587845)\n75370\tWrappedArray(0.2292875051498413, 0.9536224007606506, 0.37320950627326965, 0.7747692465782166, 0.07841359823942184)\n75826\tWrappedArray(0.22928330302238464, 0.9536216855049133, 0.373201459646225, 0.7747728228569031, 0.07841476798057556)\n76593\tWrappedArray(0.22929677367210388, 0.9536347389221191, 0.3732054829597473, 0.7747514247894287, 0.0784255787730217)\n76829\tWrappedArray(0.22928307950496674, 0.9536159038543701, 0.37316399812698364, 0.7747888565063477, 0.07842568308115005)\n77124\tWrappedArray(0.2292313128709793, 0.9535521864891052, 0.37316659092903137, 0.7748873233795166, 0.07838653773069382)\n77152\tWrappedArray(0.22927571833133698, 0.953614354133606, 0.37315043807029724, 0.7747970223426819, 0.07842697948217392)\n78512\tWrappedArray(0.22928740084171295, 0.9536264538764954, 0.37318047881126404, 0.7747708559036255, 0.07842563092708588)\n79230\tWrappedArray(0.22928465902805328, 0.9536241292953491, 0.37318336963653564, 0.7747742533683777, 0.07842057198286057)\n79491\tWrappedArray(0.2292899489402771, 0.953616201877594, 0.373187780380249, 0.7747797966003418, 0.07842050492763519)\n79568\tWrappedArray(0.22929446399211884, 0.9536277651786804, 0.3731881082057953, 0.7747647762298584, 0.07842674851417542)\n79586\tWrappedArray(0.22928790748119354, 0.9536166787147522, 0.373197466135025, 0.7747779488563538, 0.07841577380895615)\n80374\tWrappedArray(0.2292862981557846, 0.9536259770393372, 0.3731904625892639, 0.7747695446014404, 0.07842208445072174)\n81408\tWrappedArray(0.22927044332027435, 0.953600287437439, 0.3731629550457001, 0.774813175201416, 0.07841718941926956)\n81516\tWrappedArray(0.22928740084171295, 0.9536253809928894, 0.37319493293762207, 0.7747682929039001, 0.07841702550649643)\n81970\tWrappedArray(0.2292919158935547, 0.9536304473876953, 0.3732072710990906, 0.7747583985328674, 0.07842018455266953)\n82059\tWrappedArray(0.2292802780866623, 0.9536239504814148, 0.37314122915267944, 0.7747860550880432, 0.07843371480703354)\n84779\tWrappedArray(0.22928132116794586, 0.9536134600639343, 0.373199999332428, 0.7747836709022522, 0.07841083407402039)\n84891\tWrappedArray(0.2292892187833786, 0.9536294341087341, 0.3732074499130249, 0.7747605443000793, 0.07841843366622925)\n85152\tWrappedArray(0.22928954660892487, 0.9536265134811401, 0.3732035756111145, 0.7747644186019897, 0.07841761410236359)\n85274\tWrappedArray(0.22928935289382935, 0.9536226987838745, 0.3731605112552643, 0.7747790813446045, 0.07843131572008133)\n85504\tWrappedArray(0.22929255664348602, 0.9536299109458923, 0.37315884232521057, 0.7747706174850464, 0.07843554019927979)\n85990\tWrappedArray(0.22927804291248322, 0.9536236524581909, 0.3731791079044342, 0.7747783660888672, 0.07842206954956055)\n87124\tWrappedArray(0.22929111123085022, 0.9536229372024536, 0.37318888306617737, 0.7747717499732971, 0.07842198759317398)\n87193\tWrappedArray(0.22927622497081757, 0.9536259770393372, 0.3731745779514313, 0.7747769355773926, 0.07841973751783371)\n87267\tWrappedArray(0.2292858362197876, 0.9536252617835999, 0.3731805384159088, 0.7747728824615479, 0.07842458039522171)\n88190\tWrappedArray(0.22927896678447723, 0.9536109566688538, 0.3731904923915863, 0.7747899293899536, 0.07841206341981888)\n89887\tWrappedArray(0.22928756475448608, 0.9536178708076477, 0.37318870425224304, 0.7747793793678284, 0.07842061668634415)\n90120\tWrappedArray(0.22927802801132202, 0.9536282420158386, 0.3732236623764038, 0.7747624516487122, 0.07841033488512039)\n90162\tWrappedArray(0.22928255796432495, 0.9536266922950745, 0.3731729984283447, 0.7747743725776672, 0.0784248635172844)\n90438\tWrappedArray(0.22927650809288025, 0.9536135196685791, 0.37319034337997437, 0.7747889757156372, 0.07841264456510544)\n92475\tWrappedArray(0.2292868047952652, 0.9536223411560059, 0.3731690049171448, 0.7747790217399597, 0.07842755317687988)\n92584\tWrappedArray(0.22928206622600555, 0.9536137580871582, 0.37320536375045776, 0.7747830748558044, 0.07841183245182037)\n94460\tWrappedArray(0.22928431630134583, 0.9536290168762207, 0.3732115924358368, 0.7747617363929749, 0.0784139484167099)\n94486\tWrappedArray(0.22929561138153076, 0.9536316990852356, 0.3731643557548523, 0.7747656106948853, 0.07843784242868423)\n95421\tWrappedArray(0.229312002658844, 0.9536399245262146, 0.3731875717639923, 0.7747429609298706, 0.07844339311122894)\n96626\tWrappedArray(0.2292843461036682, 0.9536316394805908, 0.3732300102710724, 0.7747548222541809, 0.07841040939092636)\n96688\tWrappedArray(0.22927817702293396, 0.9536218047142029, 0.37315088510513306, 0.7747872471809387, 0.07842877507209778)\n97456\tWrappedArray(0.22930771112442017, 0.9536387324333191, 0.37318482995033264, 0.7747474312782288, 0.07843993604183197)\n97911\tWrappedArray(0.22928917407989502, 0.9536262154579163, 0.37320461869239807, 0.7747647762298584, 0.07841800153255463)\n98366\tWrappedArray(0.22928978502750397, 0.9536235928535461, 0.3732035160064697, 0.7747673392295837, 0.07841626554727554)\n98568\tWrappedArray(0.2292773276567459, 0.9536119103431702, 0.37319231033325195, 0.7747901678085327, 0.0784134715795517)\n98737\tWrappedArray(0.2292875051498413, 0.9536253809928894, 0.3731892704963684, 0.7747697830200195, 0.07842208445072174)\n98815\tWrappedArray(0.22928409278392792, 0.953610897064209, 0.37320199608802795, 0.7747853398323059, 0.07841087877750397)\n99693\tWrappedArray(0.22929136455059052, 0.9536235332489014, 0.37321412563323975, 0.7747647762298584, 0.0784139484167099)\n"
      },
      "dateCreated": "Mar 1, 2016 11:06:08 PM",
      "dateStarted": "Jun 21, 2016 3:44:04 PM",
      "dateFinished": "Jun 21, 2016 3:44:05 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Show ItemFactors Matrix",
      "text": "val itemFactorsDF \u003d model.itemFactors.map(row \u003d\u003e\n  (row.getInt(0), row.getSeq[Float](1).toArray.map(_.toDouble))\n).toDF(\"itemId\", \"itemFactors\")\n .sort($\"itemId\" asc)\n .as(\"itemFactors\")\n\nz.show(itemFactorsDF)",
      "dateUpdated": "Jun 21, 2016 3:43:30 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 314.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456865217092_774550692",
      "id": "20160301-204657_541485869",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "itemId\titemFactors\n10001\tWrappedArray(0.13193917274475098, 0.5487398505210876, 0.2147517204284668, 0.44579997658729553, 0.045125700533390045)\n10002\tWrappedArray(0.13194963335990906, 0.5487468242645264, 0.21473313868045807, 0.4458000957965851, 0.045138757675886154)\n10003\tWrappedArray(0.13194911181926727, 0.5487423539161682, 0.21473422646522522, 0.4458053708076477, 0.04513595625758171)\n10004\tWrappedArray(0.13194036483764648, 0.5487350225448608, 0.21473370492458344, 0.4458191394805908, 0.04513069987297058)\n10005\tWrappedArray(0.1319383829832077, 0.5487220287322998, 0.2147272527217865, 0.4458423852920532, 0.04512348771095276)\n10006\tWrappedArray(0.13193880021572113, 0.5487329363822937, 0.2147534191608429, 0.4458083212375641, 0.045121487230062485)\n10007\tWrappedArray(0.1319274604320526, 0.5487222671508789, 0.214726060628891, 0.4458453357219696, 0.045123323798179626)\n10008\tWrappedArray(0.13193155825138092, 0.5487347841262817, 0.21473760902881622, 0.4458197057247162, 0.045124124735593796)\n10009\tWrappedArray(0.13192138075828552, 0.5487341284751892, 0.21472014486789703, 0.44583603739738464, 0.04512267932295799)\n10010\tWrappedArray(0.13192537426948547, 0.5487301349639893, 0.21473535895347595, 0.44582900404930115, 0.04512062296271324)\n10011\tWrappedArray(0.13193340599536896, 0.5487400889396667, 0.2147103101015091, 0.4458317756652832, 0.045132867991924286)\n10012\tWrappedArray(0.1319391280412674, 0.5487391352653503, 0.21475011110305786, 0.44580286741256714, 0.045123275369405746)\n10013\tWrappedArray(0.1319304257631302, 0.5487366914749146, 0.21473997831344604, 0.44581523537635803, 0.04512231424450874)\n10014\tWrappedArray(0.13193374872207642, 0.5487203001976013, 0.21474936604499817, 0.4458291232585907, 0.04511667788028717)\n10015\tWrappedArray(0.1319044828414917, 0.548693835735321, 0.21472784876823425, 0.4458863437175751, 0.04510525241494179)\n90001\tWrappedArray(0.1319480538368225, 0.5487419366836548, 0.21474634110927582, 0.44579818844795227, 0.045133937150239944)\n90002\tWrappedArray(0.13195067644119263, 0.5487372875213623, 0.21475204825401306, 0.44580018520355225, 0.045132312923669815)\n90003\tWrappedArray(0.13195031881332397, 0.5487479567527771, 0.21472646296024323, 0.44580355286598206, 0.04514333978295326)\n90004\tWrappedArray(0.1319320946931839, 0.5487315058708191, 0.2147359400987625, 0.4458240270614624, 0.045126065611839294)\n90005\tWrappedArray(0.13192789256572723, 0.5487360954284668, 0.2146967500448227, 0.4458473026752472, 0.045133985579013824)\n90006\tWrappedArray(0.13193248212337494, 0.548747181892395, 0.21470001339912415, 0.44582808017730713, 0.04513940587639809)\n90007\tWrappedArray(0.1319333165884018, 0.5487416386604309, 0.2147035449743271, 0.44583332538604736, 0.045135945081710815)\n90008\tWrappedArray(0.1319408118724823, 0.5487366318702698, 0.2147212028503418, 0.44582489132881165, 0.04513496905565262)\n90009\tWrappedArray(0.13192899525165558, 0.5487257242202759, 0.21472109854221344, 0.4458428621292114, 0.04512763023376465)\n90010\tWrappedArray(0.13192984461784363, 0.54873126745224, 0.21475821733474731, 0.44580936431884766, 0.04511842504143715)\n90011\tWrappedArray(0.13193675875663757, 0.5487337112426758, 0.21476493775844574, 0.4457993507385254, 0.045118384063243866)\n90012\tWrappedArray(0.13193564116954803, 0.5487006306648254, 0.21474191546440125, 0.44586360454559326, 0.04510829597711563)\n90013\tWrappedArray(0.131934255361557, 0.5487223267555237, 0.21475151181221008, 0.4458259642124176, 0.04511694982647896)\n90014\tWrappedArray(0.13194052875041962, 0.5487309098243713, 0.21476376056671143, 0.44580450654029846, 0.045116618275642395)\n90015\tWrappedArray(0.1319395750761032, 0.5487332344055176, 0.21474401652812958, 0.44581592082977295, 0.0451236329972744)\n"
      },
      "dateCreated": "Mar 1, 2016 8:46:57 PM",
      "dateStarted": "Jun 21, 2016 3:44:05 PM",
      "dateFinished": "Jun 21, 2016 3:44:06 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Enriched ItemFactors Matrix",
      "text": "val enrichedItemFactorsDF \u003d itemFactorsDF\n  .join(itemsDF, $\"items.itemId\" \u003d\u003d\u003d $\"itemFactors.itemId\")\n  .select($\"items.itemId\", $\"title\", $\"tags\", $\"itemFactors\", $\"img\")\n  .sort($\"items.itemId\")\n  .as(\"enrichedItemFactors\")\n\nz.show(enrichedItemFactorsDF)",
      "dateUpdated": "Jun 21, 2016 3:43:30 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1461098265813_1981370856",
      "id": "20160419-203745_842155819",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "itemId\ttitle\ttags\titemFactors\timg\n10001\tLeonardo DiCaprio\tHollywood, California, United States\tWrappedArray(0.13193917274475098, 0.5487398505210876, 0.2147517204284668, 0.44579997658729553, 0.045125700533390045)\timg/actors/10001.jpg\n10002\tAnthony Hopkins\tPort Talbot, Glamorgan, Wales\tWrappedArray(0.13194963335990906, 0.5487468242645264, 0.21473313868045807, 0.4458000957965851, 0.045138757675886154)\timg/actors/10002.jpg\n10003\tAl Pacino\tManhattan, New York, United States\tWrappedArray(0.13194911181926727, 0.5487423539161682, 0.21473422646522522, 0.4458053708076477, 0.04513595625758171)\timg/actors/10003.jpg\n10004\tMorgan Freeman\tMemphis, Tennessee, United States\tWrappedArray(0.13194036483764648, 0.5487350225448608, 0.21473370492458344, 0.4458191394805908, 0.04513069987297058)\timg/actors/10004.jpg\n10005\tJames Gandolfini\tWestwood, New Jersey, United States\tWrappedArray(0.1319383829832077, 0.5487220287322998, 0.2147272527217865, 0.4458423852920532, 0.04512348771095276)\timg/actors/10005.jpg\n10006\tTom Cruise\tSyracuse, New York, United States\tWrappedArray(0.13193880021572113, 0.5487329363822937, 0.2147534191608429, 0.4458083212375641, 0.045121487230062485)\timg/actors/10006.jpg\n10007\tDenzel Washington\tMount Vernon, New York, United States\tWrappedArray(0.1319274604320526, 0.5487222671508789, 0.214726060628891, 0.4458453357219696, 0.045123323798179626)\timg/actors/10007.jpg\n10008\tRobert De Niro\tManhattan, New York, United States\tWrappedArray(0.13193155825138092, 0.5487347841262817, 0.21473760902881622, 0.4458197057247162, 0.045124124735593796)\timg/actors/10008.jpg\n10009\tChazz Palminteri\tBronx, New York, United States\tWrappedArray(0.13192138075828552, 0.5487341284751892, 0.21472014486789703, 0.44583603739738464, 0.04512267932295799)\timg/actors/10009.jpg\n10010\tTom Hanks\tConcord, California, United States\tWrappedArray(0.13192537426948547, 0.5487301349639893, 0.21473535895347595, 0.44582900404930115, 0.04512062296271324)\timg/actors/10010.jpg\n10011\tJohn Travolta\tEnglewood, New York, United States\tWrappedArray(0.13193340599536896, 0.5487400889396667, 0.2147103101015091, 0.4458317756652832, 0.045132867991924286)\timg/actors/10011.jpg\n10012\tJohnny Depp\tOwensboro, Kentucky, United States\tWrappedArray(0.1319391280412674, 0.5487391352653503, 0.21475011110305786, 0.44580286741256714, 0.045123275369405746)\timg/actors/10012.jpg\n10013\tMark Wahlberg\tBoston, Massachusetts, United States\tWrappedArray(0.1319304257631302, 0.5487366914749146, 0.21473997831344604, 0.44581523537635803, 0.04512231424450874)\timg/actors/10013.jpg\n10014\tJames Franco\tPalo Alto, California, United States\tWrappedArray(0.13193374872207642, 0.5487203001976013, 0.21474936604499817, 0.4458291232585907, 0.04511667788028717)\timg/actors/10014.jpg\n10015\tClive Owen\tCoventry, Warwickshire, England\tWrappedArray(0.1319044828414917, 0.548693835735321, 0.21472784876823425, 0.4458863437175751, 0.04510525241494179)\timg/actors/10015.jpg\n90001\tLinda Blair\tSt. Louis, Missouri, United States\tWrappedArray(0.1319480538368225, 0.5487419366836548, 0.21474634110927582, 0.44579818844795227, 0.045133937150239944)\timg/actors/90001.jpg\n90002\tShannon Whirry\tGreen Lake, Wisconsin, United States\tWrappedArray(0.13195067644119263, 0.5487372875213623, 0.21475204825401306, 0.44580018520355225, 0.045132312923669815)\timg/actors/90002.jpg\n90003\tRosalind Allen\tWellington, New Zealand, New Zealand\tWrappedArray(0.13195031881332397, 0.5487479567527771, 0.21472646296024323, 0.44580355286598206, 0.04514333978295326)\timg/actors/90003.jpg\n90004\tBobbie Phillips\tSalisbury, North Carolina, United States\tWrappedArray(0.1319320946931839, 0.5487315058708191, 0.2147359400987625, 0.4458240270614624, 0.045126065611839294)\timg/actors/90004.jpg\n90005\tKeshia Knight Pulliam\tNewark, New Jersey, United States\tWrappedArray(0.13192789256572723, 0.5487360954284668, 0.2146967500448227, 0.4458473026752472, 0.045133985579013824)\timg/actors/90005.jpg\n90006\tTatyana Ali\tBrooklyn, New York, United States\tWrappedArray(0.13193248212337494, 0.548747181892395, 0.21470001339912415, 0.44582808017730713, 0.04513940587639809)\timg/actors/90006.jpg\n90007\tAngell Conwell\tOrangeburg, South Carolina, United States\tWrappedArray(0.1319333165884018, 0.5487416386604309, 0.2147035449743271, 0.44583332538604736, 0.045135945081710815)\timg/actors/90007.jpg\n90008\tShannah Laumeister\tSan Francisco, California, United States\tWrappedArray(0.1319408118724823, 0.5487366318702698, 0.2147212028503418, 0.44582489132881165, 0.04513496905565262)\timg/actors/90008.jpg\n90009\tPam Grier\tWinstom-Salem, North Carolina, United States\tWrappedArray(0.13192899525165558, 0.5487257242202759, 0.21472109854221344, 0.4458428621292114, 0.04512763023376465)\timg/actors/90009.jpg\n90010\tTiffani Thiessen\tLong Beach, California, United States\tWrappedArray(0.13192984461784363, 0.54873126745224, 0.21475821733474731, 0.44580936431884766, 0.04511842504143715)\timg/actors/90010.jpg\n90011\tAshley Judd\tGranada Hills, California, United States\tWrappedArray(0.13193675875663757, 0.5487337112426758, 0.21476493775844574, 0.4457993507385254, 0.045118384063243866)\timg/actors/90011.jpg\n90012\tStacey Dash\tBronx, New York, United States\tWrappedArray(0.13193564116954803, 0.5487006306648254, 0.21474191546440125, 0.44586360454559326, 0.04510829597711563)\timg/actors/90012.jpg\n90013\tSofia Vergara\tBarranquilla, Atlantico, Colombia\tWrappedArray(0.131934255361557, 0.5487223267555237, 0.21475151181221008, 0.4458259642124176, 0.04511694982647896)\timg/actors/90013.jpg\n90014\tGail O\u0027Grady\tDetroit, Michigan, United States\tWrappedArray(0.13194052875041962, 0.5487309098243713, 0.21476376056671143, 0.44580450654029846, 0.045116618275642395)\timg/actors/90014.jpg\n90015\tBarbara Niven\tPortland, Oregon, United States\tWrappedArray(0.1319395750761032, 0.5487332344055176, 0.21474401652812958, 0.44581592082977295, 0.0451236329972744)\timg/actors/90015.jpg\n"
      },
      "dateCreated": "Apr 19, 2016 8:37:45 PM",
      "dateStarted": "Jun 21, 2016 3:44:06 PM",
      "dateFinished": "Jun 21, 2016 3:44:07 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Calculate Predicted Rating for a Given userId and ItemId - compare Prediction to above",
      "text": "import org.jblas.DoubleMatrix\n\n// User 21619\nval givenUserId \u003d 21619\nval givenUserFactors \u003d userFactorsDF.select($\"userId\", $\"userFactors\")\n  .where($\"userId\" \u003d\u003d\u003d givenUserId)\n  .map(row \u003d\u003e row.getSeq[Double](1).toArray)\n  .collect()(0)\n\n// Item 10006 - Tom Cruise\nval givenItemId \u003d 10006\nval givenItemFactors \u003d itemFactorsDF.select($\"itemId\", $\"itemFactors\")\n  .where($\"itemId\" \u003d\u003d\u003d givenItemId)\n  .map(row \u003d\u003e row.getSeq[Double](1).toArray)\n  .collect()(0)\n  \nval givenUserFactorsMatrix \u003d new DoubleMatrix(givenUserFactors)\nval givenItemFactorsMatrix \u003d new DoubleMatrix(givenItemFactors)\n\n\n// Take dot product of the User x Item vectors\n// This should equal the prediction value in the offline-generated matrix\nval prediction \u003d givenUserFactorsMatrix.dot(givenItemFactorsMatrix)",
      "dateUpdated": "Jun 21, 2016 3:43:32 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true,
        "editorHide": false
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1456954812726_1681075178",
      "id": "20160302-214012_540640872",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import org.jblas.DoubleMatrix\ngivenUserId: Int \u003d 21619\ngivenUserFactors: Array[Double] \u003d Array(0.22929008305072784, 0.9536245465278625, 0.373201847076416, 0.7747671008110046, 0.07841748744249344)\ngivenItemId: Int \u003d 10006\ngivenItemFactors: Array[Double] \u003d Array(0.13193880021572113, 0.5487329363822937, 0.2147534191608429, 0.4458083212375641, 0.045121487230062485)\ngivenUserFactorsMatrix: org.jblas.DoubleMatrix \u003d [0.229290; 0.953625; 0.373202; 0.774767; 0.078417]\ngivenItemFactorsMatrix: org.jblas.DoubleMatrix \u003d [0.131939; 0.548733; 0.214753; 0.445808; 0.045121]\nprediction: Double \u003d 0.9826197629992444\n"
      },
      "dateCreated": "Mar 2, 2016 9:40:12 PM",
      "dateStarted": "Jun 21, 2016 3:44:07 PM",
      "dateFinished": "Jun 21, 2016 3:44:13 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Save User and Item Factors in ElasticSearch",
      "text": "val esConfig \u003d Map(\"pushdown\" -\u003e \"true\", \"es.nodes\" -\u003e \"127.0.0.1\", \"es.port\" -\u003e \"9200\")\n\nuserFactorsDF.select($\"userId\", $\"userFactors\")\n .sort($\"userId\" asc)\n .write.format(\"org.elasticsearch.spark.sql\")\n .mode(\"overwrite\")\n .options(esConfig)\n .save(\"advancedspark/user-factors-als\")\n \nenrichedItemFactorsDF.select($\"itemId\", $\"title\", $\"itemFactors\", $\"tags\", $\"img\")\n .sort($\"itemId\" asc)\n .write.format(\"org.elasticsearch.spark.sql\")\n .mode(\"overwrite\")\n .options(esConfig)\n .save(\"advancedspark/item-factors-als\")",
      "dateUpdated": "Jun 21, 2016 3:43:32 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1465836378186_1867004843",
      "id": "20160613-164618_317111417",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "esConfig: scala.collection.immutable.Map[String,String] \u003d Map(pushdown -\u003e true, es.nodes -\u003e 127.0.0.1, es.port -\u003e 9200)\nwarning: there were 1 feature warning(s); re-run with -feature for details\nwarning: there were 1 feature warning(s); re-run with -feature for details\n"
      },
      "dateCreated": "Jun 13, 2016 4:46:18 PM",
      "dateStarted": "Jun 21, 2016 3:44:08 PM",
      "dateFinished": "Jun 21, 2016 3:44:33 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Save User And Item Factors In Redis",
      "text": "// import com.netflix.dyno.jedis._\n// import com.netflix.dyno.connectionpool.Host\n// import com.netflix.dyno.connectionpool.HostSupplier\n// import com.netflix.dyno.connectionpool.TokenMapSupplier\n// import com.netflix.dyno.connectionpool.impl.lb.HostToken\n// import com.netflix.dyno.connectionpool.exception.DynoException\n// import com.netflix.dyno.connectionpool.impl.ConnectionPoolConfigurationImpl;\n// import com.netflix.dyno.connectionpool.impl.ConnectionContextImpl\n// import com.netflix.dyno.connectionpool.impl.OperationResultImpl\n// import com.netflix.dyno.connectionpool.impl.utils.ZipUtils\n\n// import java.util.Collections\n// import java.util.Collection\n// import java.util.Set\n// import java.util.List\n\n// val localhostHost \u003d new Host(\"127.0.0.1\", Host.Status.Up)\n// val localhostToken \u003d new HostToken(100000L, localhostHost)\n\n// val localhostHostSupplier \u003d new HostSupplier() {\n//   @Override\n//   def getHosts(): Collection[Host] \u003d {\n//     Collections.singletonList(localhostHost)\n//   }\n// }\n\n// val localhostTokenMapSupplier \u003d new TokenMapSupplier() {\n//   @Override\n//   def getTokens(activeHosts: Set[Host]): List[HostToken] \u003d {\n// \tCollections.singletonList(localhostToken)\n//   }\n\n//   @Override\n//   def getTokenForHost(host: Host, activeHosts: Set[Host]): HostToken \u003d {\n//     return localhostToken\n//   }\n// }\n\n// val redisPort \u003d 6379                        \n// val dynoClient \u003d new DynoJedisClient.Builder()\n//               .withApplicationName(\"pipeline\")\n//               .withDynomiteClusterName(\"pipeline-dynomite\")\n//               .withHostSupplier(localhostHostSupplier)\n//               .withCPConfig(new ConnectionPoolConfigurationImpl(\"localhostTokenMapSupplier\")\n//                 .withTokenSupplier(localhostTokenMapSupplier))\n//               .withPort(redisPort)\n//               .build()\n\n// //val recommendations \u003d enrichedRecommendationsDF.collect()\n\n// TODO:  Save each \n// dynoClient.set(\"user-factors-als\", givenUserFactors.mkString(\",\"))\n// dynoClient.set(\"item-factors-als\", recommendations.mkString(\",\"))\n\n// dynoClient.stopClient()",
      "dateUpdated": "Jun 21, 2016 3:43:32 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1466127984927_-127542757",
      "id": "20160617-014624_1196430927",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": ""
      },
      "dateCreated": "Jun 17, 2016 1:46:24 AM",
      "dateStarted": "Jun 21, 2016 3:44:13 PM",
      "dateFinished": "Jun 21, 2016 3:44:33 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Save model in spark parquet format",
      "text": "model.save(s\"/root/pipeline/datasets/serving/live-recommendations/spark-1.6.1/als/${System.currentTimeMillis}.parquet\")",
      "dateUpdated": "Jun 21, 2016 3:43:32 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala",
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1463371290389_-1491857833",
      "id": "20160516-040130_1028627154",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": ""
      },
      "dateCreated": "May 16, 2016 4:01:30 AM",
      "dateStarted": "Jun 21, 2016 3:44:33 PM",
      "dateFinished": "Jun 21, 2016 3:44:34 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "dateUpdated": "Jun 21, 2016 3:43:33 PM",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "enabled": true,
        "editorMode": "ace/mode/scala"
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1466133872866_-1669203193",
      "id": "20160617-032432_1439652942",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT"
      },
      "dateCreated": "Jun 17, 2016 3:24:32 AM",
      "dateStarted": "Jun 21, 2016 3:44:34 PM",
      "dateFinished": "Jun 21, 2016 3:44:34 PM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    }
  ],
  "name": "Live Recs/02: User-to-Item Collaborative Filter Recs (ALS)",
  "id": "2AUYFSKXN",
  "angularObjects": {
    "2ARR8UZDJ": [],
    "2AS9P7JSA": [],
    "2AR33ZMZJ": []
  },
  "config": {
    "looknfeel": "default"
  },
  "info": {}
}