{
  "paragraphs": [
    {
      "title": "Import third party external libraries",
      "text": "%dep\nz.reset()\nz.addRepo(\"maven central\").url(\"search.maven.org\")\nz.load(\"com.datastax.spark:spark-cassandra-connector_2.10:1.4.0-M1\")\nz.load(\"org.elasticsearch:elasticsearch-spark_2.10:2.1.0\")\nz.load(\"org.apache.spark:spark-streaming-kafka-assembly_2.10:1.4.0\")\nz.load(\"com.databricks:spark-csv_2.10:1.2.0\")",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1443327817568_1439245278",
      "id": "20150927-042337_1342981118",
      "result": {
        "code": "ERROR",
        "type": "TEXT",
        "msg": "Must be used before SparkInterpreter (%spark) initialized"
      },
      "dateCreated": "Sep 27, 2015 4:23:37 AM",
      "dateStarted": "Sep 27, 2015 6:03:32 AM",
      "dateFinished": "Sep 27, 2015 6:03:32 AM",
      "status": "ERROR",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Create Temporary Tables for the Actress And Actor Reference Data",
      "text": "// create the actresses_temp table from the input JSON\nval actressesDF \u003d sqlContext.read.format(\"json\").load(\"file:/root/pipeline/datasets/hollywood/actresses.json\")\nactressesDF.registerTempTable(\"actresses_temp\")\n\n// create the actors_temp table from the input JSON\nval actorsDF \u003d sqlContext.read.format(\"json\").load(\"file:/root/pipeline/datasets/hollywood/actors.json\")\nactorsDF.registerTempTable(\"actors_temp\")",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1443327823000_1982141300",
      "id": "20150927-042343_1430520256",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "actressesDF: org.apache.spark.sql.DataFrame \u003d [count: bigint, name: string, results: struct\u003cpeople:array\u003cstruct\u003cbio:struct\u003ctext:string\u003e,hero:struct\u003calt:string,height:string,src:string,width:string\u003e,index:bigint,name:struct\u003ctext:string\u003e\u003e\u003e\u003e]\nactorsDF: org.apache.spark.sql.DataFrame \u003d [count: bigint, name: string, results: struct\u003cpeople:array\u003cstruct\u003cbio:struct\u003ctext:string\u003e,hero:struct\u003calt:string,height:string,src:string,width:string\u003e,index:bigint,name:struct\u003chref:string,text:string\u003e\u003e\u003e\u003e]\n"
      },
      "dateCreated": "Sep 27, 2015 4:23:43 AM",
      "dateStarted": "Sep 27, 2015 6:03:32 AM",
      "dateFinished": "Sep 27, 2015 6:03:32 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Create a Unified DataFrame from the Temp Tables",
      "text": "val actressesExplodedDF \u003d sqlContext.sql(\"SELECT (90000 + people.index) as id, people.name.text as name, people.bio.text as bio, people.hero.src as img FROM actresses_temp LATERAL VIEW EXPLODE (results.people) p AS people\")\n\nval actorsExplodedDF \u003d sqlContext.sql(\"SELECT (10000 + people.index) as id, people.name.text as name, people.bio.text as bio, people.hero.src as img FROM actors_temp LATERAL VIEW EXPLODE (results.people) p AS people\")\n\nval actressesAndActorsDF \u003d actressesExplodedDF.unionAll(actorsExplodedDF).cache()\nactressesAndActorsDF.show()",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1443333603558_15363978",
      "id": "20150927-060003_615751745",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "actressesExplodedDF: org.apache.spark.sql.DataFrame \u003d [id: bigint, name: string, bio: string, img: string]\nactorsExplodedDF: org.apache.spark.sql.DataFrame \u003d [id: bigint, name: string, bio: string, img: string]\nactressesAndActorsDF: org.apache.spark.sql.DataFrame \u003d [id: bigint, name: string, bio: string, img: string]\n+-----+--------------------+--------------------+--------------------+\n|   id|                name|                 bio|                 img|\n+-----+--------------------+--------------------+--------------------+\n|90001|         Linda Blair|From the age of f...|img/people/90001.jpg|\n|90002|      Shannon Whirry|Shannon Whirry is...|img/people/90002.jpg|\n|90003|      Rosalind Allen|Rosalind Allen (b...|img/people/90003.jpg|\n|90004|     Bobbie Phillips|Brains and beauty...|img/people/90004.jpg|\n|90005|Keshia Knight Pul...|                    |img/people/90005.jpg|\n|90006|         Tatyana Ali|On January 24, 19...|img/people/90006.jpg|\n|90007|      Angell Conwell|Born in the tiny ...|img/people/90007.jpg|\n|90008|  Shannah Laumeister|                    |img/people/90008.jpg|\n|90009|           Pam Grier|Pam Grier was bor...|img/people/90009.jpg|\n|90010|    Tiffani Thiessen|Tiffani-Amber Thi...|img/people/90010.jpg|\n|90011|         Ashley Judd|                    |img/people/90011.jpg|\n|90012|         Stacey Dash|Stacey Dash was b...|img/people/90012.jpg|\n|90013|       Sofía Vergara|Sofía Margarita V...|img/people/90013.jpg|\n|90014|        Gail O\u0027Grady|                    |img/people/90014.jpg|\n|90015|       Barbara Niven|                    |img/people/90015.jpg|\n|10001|   Leonardo DiCaprio|Few actors in the...|img/people/10001.jpg|\n|10002|     Anthony Hopkins|Anthony Hopkins w...|img/people/10002.jpg|\n|10003|           Al Pacino|One of the greate...|img/people/10003.jpg|\n|10004|      Morgan Freeman|With an authorita...|img/people/10004.jpg|\n|10005|    James Gandolfini|James Gandolfini ...|img/people/10005.jpg|\n+-----+--------------------+--------------------+--------------------+\n\n"
      },
      "dateCreated": "Sep 27, 2015 6:00:03 AM",
      "dateStarted": "Sep 27, 2015 6:03:33 AM",
      "dateFinished": "Sep 27, 2015 6:03:34 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Create a permanent table From the Unified DataFrame",
      "text": "import org.apache.spark.sql.SaveMode\n\nactressesAndActorsDF.write.mode(SaveMode.Overwrite).saveAsTable(\"actresses_and_actors_perm\")",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [],
          "values": [],
          "groups": [],
          "scatter": {}
        },
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1443333452329_157273380",
      "id": "20150927-055732_1007145749",
      "result": {
        "code": "SUCCESS",
        "type": "TEXT",
        "msg": "import org.apache.spark.sql.SaveMode\n"
      },
      "dateCreated": "Sep 27, 2015 5:57:32 AM",
      "dateStarted": "Sep 27, 2015 6:03:32 AM",
      "dateFinished": "Sep 27, 2015 6:03:33 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "title": "Show Permanent Table Created through DataFrame.saveAsTable()",
      "text": "%sql select * from actresses_and_actors_perm",
      "config": {
        "colWidth": 12.0,
        "graph": {
          "mode": "table",
          "height": 300.0,
          "optionOpen": false,
          "keys": [
            {
              "name": "id",
              "index": 0.0,
              "aggr": "sum"
            }
          ],
          "values": [
            {
              "name": "name",
              "index": 1.0,
              "aggr": "sum"
            }
          ],
          "groups": [],
          "scatter": {
            "xAxis": {
              "name": "id",
              "index": 0.0,
              "aggr": "sum"
            },
            "yAxis": {
              "name": "name",
              "index": 1.0,
              "aggr": "sum"
            }
          }
        },
        "title": true
      },
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1443325979203_-1051944493",
      "id": "20150927-035259_1214500991",
      "result": {
        "code": "SUCCESS",
        "type": "TABLE",
        "msg": "id\tname\tbio\timg\n10001\tLeonardo DiCaprio\tFew actors in the world have had a career quite as diverse as Leonardo DiCaprio\u0027s. DiCaprio has gone from relatively humble beginnings, as a supporting cast member of the sitcom Growing Pains and low budget horror movies, such as Critters 3, to a major teenage heartthrob in the 1990s, as the hunky lead actor in movies such as Romeo + Juliet and Titanic...\timg/people/10001.jpg\n10002\tAnthony Hopkins\tAnthony Hopkins was born on December 31, 1937, in Margam, Wales, to Muriel Anne (Yeats) and Richard Arthur Hopkins, a baker. His parents were both of half Welsh and half English descent. Influenced by Richard Burton, he decided to study at College of Music and Drama and graduated in 1957. In 1965, he moved to London and joined the National Theatre...\timg/people/10002.jpg\n10003\tAl Pacino\tOne of the greatest actors in all of film history, Al Pacino established himself during one of film\u0027s greatest decades, the 1970s, and has become an enduring and iconic figure in the world of American movies. Pacino was born on April 25, 1940, in the Bronx, New York, to an Italian-American family. His parents...\timg/people/10003.jpg\n10004\tMorgan Freeman\tWith an authoritative voice and calm demeanor, this ever popular American actor has grown into one of the most respected figures in modern US cinema. Morgan was born in June 1937 in Memphis, Tennessee, to Mayme Edna (Revere), a teacher, and Morgan Porterfield Freeman, a barber. The young Freeman attended...\timg/people/10004.jpg\n10005\tJames Gandolfini\tJames Gandolfini was born in Westwood, New Jersey, to Santa (Penna), a high school lunchlady, and James Joseph Gandolfini, Sr., a bricklayer and head school janitor. His parents were both of Italian origin. Gandolfini began acting in the New York theater. His Broadway debut was in the 1992 revival of \"A Streetcar Named Desire\" with Jessica Lange and Alec Baldwin...\timg/people/10005.jpg\n10006\tMarlon Brando\tMarlon Brando is widely considered the greatest movie actor of all time, rivaled only by the more theatrically oriented Laurence Olivier in terms of esteem. Unlike Olivier, who preferred the stage to the screen, Brando concentrated his talents on movies after bidding the Broadway stage adieu in 1949...\timg/people/10006.jpg\n10007\tDenzel Washington\tDenzel Hayes Washington, Jr. was born on December 28, 1954 in Mount Vernon, New York. He is the middle of three children of a beautician mother, Lennis (Lowe), from Georgia, and a Pentecostal minister father, Denzel Washington, Sr., from Virginia. After graduating from high school, Denzel enrolled at Fordham University...\timg/people/10007.jpg\n10008\tRobert De Niro\tRobert De Niro, thought of as one of the greatest American actors of all time, was born in New York City, to artists Virginia (Admiral) and Robert De Niro Sr. His paternal grandfather was of Italian descent, and his other ancestry is Irish, Dutch, English, French, and German. He was trained at the Stella Adler Conservatory and the American Workshop...\timg/people/10008.jpg\n10009\tChazz Palminteri\tBronx-born and raised Chazz Palminteri was a natural choice to continue the Italianate torch in film. In the tradition set forth in the 1970s by such icons as director Martin Scorsese and actors Robert De Niro, Al Pacino, John Cazale and Joe Pesci, Palminteri has brought grit, muscle and an evocative realism to the sidewalks of his New York neighborhood...\timg/people/10009.jpg\n10010\tTom Hanks\tThomas Jeffrey Hanks was born in Concord, California, to Janet Marylyn (Frager), a hospital worker, and Amos Mefford Hanks, an itinerant cook. His father had English, and some German, ancestry, while his mother\u0027s family, originally surnamed \"Fraga\", was entirely Portuguese. Tom grew up in what he has called a \"fractured\" family...\timg/people/10010.jpg\n10011\tJohn Travolta\tJohn Travolta was born in Englewood, New Jersey, one of six children of Helen Travolta (née Helen Cecilia Burke) and Salvatore Travolta. His father was of Italian descent and his mother was of Irish ancestry. His father owned a tire repair shop called Travolta Tires in Hillsdale, NJ. Travolta appeared in a local production of \"Who\u0027ll Save the Plowboy?\"...\timg/people/10011.jpg\n10012\tJohnny Depp\tJohnny Depp is perhaps one of the most versatile actors of his day and age in Hollywood. He was born John Christopher Depp II in Owensboro, Kentucky, on June 9, 1963, to Betty Sue (Wells), who worked as a waitress, and John Christopher Depp, a civil engineer. Depp was raised in Florida. He dropped out of school when he was 15...\timg/people/10012.jpg\n10013\tMark Wahlberg\tAmerican actor Mark Wahlberg is one of a handful of respected entertainers who successfully made the transition from teen pop idol to respected actor. A Best Supporting Actor Oscar nominee for The Departed who went on to receive positive critical reviews for his performance in The Fighter, Wahlberg also is a solid comedy actor, proven by his starring role in Ted...\timg/people/10013.jpg\n10014\tJames Franco\tKnown for his breakthrough starring role on Freaks and Geeks, James Franco was born in Palo Alto, California on April 19, 1978. His mother, Betsy Franco, is Jewish, and his father, Douglas Eugene \"Doug\" Franco, was of Portuguese and Swedish descent, and ran a Silicon Valley business. James\u0027s mother, a writer, has occasionally acted...\timg/people/10014.jpg\n10015\tClive Owen\tDarkly handsome British actor Clive Owen is one of a handful of stars best known for his art house films but how has handle more mainstream action films lately with equal measures of grace and skill. Owen typically is cast as characters whose primary traits are a balance of physical strength, intellect...\timg/people/10015.jpg\n90001\tLinda Blair\tFrom the age of five, Linda Blair had to get used to the spotlight, first as a child model and then as an actress, when out of 600 applicants she was picked for the role of Regan, the possessed child, in The Exorcist. Linda quickly rose to international fame, won the Golden Globe, and seemed to be set to take the Academy Award for that role...\timg/people/90001.jpg\n90002\tShannon Whirry\tShannon Whirry is not just a talented actress with girl-next-door looks, she captured a generation of viewers\u0027 imaginations by wishing that she actually was the girl-next-door. Born in Green Lake County, Wisconsin, Whirry graduated from high school and packed her bags for New York. She trained at the...\timg/people/90002.jpg\n90003\tRosalind Allen\tRosalind Allen (born Rosalind Ingledew) hails from New Zealand and studied acting there before coming to the United States. Her movie debut was in the film, Perfect, and she continues a long career in television \u0026 film. Famously remembered as the \"It girl\" in the Seinfeld episode, The Marine Biologist...\timg/people/90003.jpg\n90004\tBobbie Phillips\tBrains and beauty are two words that have been repeatedly used to describe Bobbie Phillips throughout her career. Graduating high school at 16 years old, Bobbie tried several different career paths. After taking college classes to become a litigation attorney, it was suggested she also take drama classes...\timg/people/90004.jpg\n90005\tKeshia Knight Pulliam\t\timg/people/90005.jpg\n90006\tTatyana Ali\tOn January 24, 1979, Tatyana Marisol Ali was born to Sonia, who was a nurse from Panama, and Sheriff Ali, a retired police officer from Trinidad. At the age of four she started singing and got a taste of fame when she begged her mother to take her to an audition for Sesame Street. She went on to perform in many productions in her native city...\timg/people/90006.jpg\n90007\tAngell Conwell\tBorn in the tiny town of Orangeburg, South Carolina, Angell Conwell began her journey at a very young age. After winning countless pageants locally, she signed with Wilhelmina\u0027s Kids Division in New York at the age of 10. Angell enjoyed modeling but yearned for more of a challenge. She begged for her parents permission to audition for a role in August Wilson\u0027s highly acclaimed...\timg/people/90007.jpg\n90008\tShannah Laumeister\t\timg/people/90008.jpg\n90009\tPam Grier\tPam Grier was born in Winston-Salem, NC, one of four children of Gwendolyn Sylvia (Samuels), a nurse, and Clarence Ransom Grier Jr., an Air Force mechanic. Pam has been a major African-American star from the early 1970s. Her career started in 1971, when Roger Corman of New World Pictures launched her with The Big Doll House...\timg/people/90009.jpg\n90010\tTiffani Thiessen\tTiffani-Amber Thiessen was born on January 23, 1974, in Long Beach, California, USA, to Frank Thiessen, a park designer, and Robyn Ernest, a homemaker. She grew up in Long Beach with her parents and her brothers, professional cyclist Todd (b. 1968) and Schuyler (b. 1977). When Tiffani was 8, her uncle...\timg/people/90010.jpg\n90011\tAshley Judd\t\timg/people/90011.jpg\n90012\tStacey Dash\tStacey Dash was born in the Bronx, New York. Stacy knew that she wanted to act, and from an early age began to act professionally. She made regular appearances on The Cosby Show, The Fresh Prince of Bel-Air, and also St. Elsewhere. At 21 she made her feature film debut in Enemy Territory, which was quickly followed by Moving...\timg/people/90012.jpg\n90013\tSofía Vergara\tSofía Margarita Vergara Vergara was born and raised in Barranquilla, Colombia. Her mother, Margarita Vergara Dávila de Vergara, is a housewife. Her father, Julio Enrique Vergara Robayo, provides cattle to the meat industry. She has five siblings. She was educated at a private bilingual Spanish/English school...\timg/people/90013.jpg\n90014\tGail O\u0027Grady\t\timg/people/90014.jpg\n90015\tBarbara Niven\t\timg/people/90015.jpg\n"
      },
      "dateCreated": "Sep 27, 2015 3:52:59 AM",
      "dateStarted": "Sep 27, 2015 6:03:32 AM",
      "dateFinished": "Sep 27, 2015 6:03:32 AM",
      "status": "FINISHED",
      "progressUpdateIntervalMs": 500
    },
    {
      "config": {},
      "settings": {
        "params": {},
        "forms": {}
      },
      "jobName": "paragraph_1443333812009_-93829734",
      "id": "20150927-060332_1619569798",
      "dateCreated": "Sep 27, 2015 6:03:32 AM",
      "status": "READY",
      "progressUpdateIntervalMs": 500
    }
  ],
  "name": "0. Setup",
  "id": "2B21W7UF6",
  "angularObjects": {},
  "config": {
    "looknfeel": "default"
  },
  "info": {}
}
