[{"id":1,"title":"Apache Cassandra","category":"Database","tags":["Database","NoSQL","Java","Eventually Consistent","Transactional"],"description":"The Apache Cassandra database is the right choice when you need scalability and high availability without compromising performance. Linear scalability and proven fault-tolerance on commodity hardware or cloud infrastructure make it the perfect platform for mission-critical data. Cassandra's support for replicating across multiple datacenters is best-in-class, providing lower latency for your users and the peace of mind of knowing that you can survive regional outages.  Cassandra's data model offers the convenience of column indexes with the performance of log-structured updates, strong support for denormalization and materialized views, and powerful built-in caching.","img":"img/software/cassandra.png"},{"id":2,"title":"Tachyon","category":"Distributed Cache","tags":["Distributed Cache","Object Store","S3","Swift","HDFS"],"description":"Tachyon is a memory-centric distributed storage system enabling reliable data sharing at memory-speed across cluster frameworks.","img":"img/software/tachyon.png"},{"id":3,"title":"Apache Ambari","category":"Cluster Provision","tags":["Cluster Provision","Hadoop","Cluster Monitoring","REST API","Metrics","Alerts"],"description":"The Apache Ambari project is aimed at making Hadoop management simpler by developing software for provisioning, managing, and monitoring Apache Hadoop clusters. Ambari provides an intuitive, easy-to-use Hadoop management web UI backed by its RESTful APIs.","img":"img/software/ambari.png"},{"id":4,"title":"Docker","category":"Container","tags":["Container","Linux","DevOps","Deployment"],"description":"Docker allows you to package an application with all of its dependencies into a standardized unit for software and provides an integrated technology suite that enables development and IT operations teams to build, ship, and run distributed applications anywhere.","img":"img/software/docker.png"},{"id":5,"title":"Microsft Azure","category":"Cloud Provider","tags":["Cloud Provider","Microsoft"],"description":"Microsoft Azure is a growing collection of integrated cloud services and analytics, computing, database, mobile, networking, storage, and web for moving faster, achieving more, and saving money.","img":"img/software/azure.png"},{"id":6,"title":"Apache Flink","category":"Data Processing","tags":["Data Processing","Java","Scala","SQL","DataFrame","Table","Streaming Analytics","Batch Analytics","Machine Learning","Graph Analytics","Approximations","Sampling"],"description":"Flink is a streaming dataflow engine that provides data distribution, communication, and fault tolerance for distributed computations over data streams.","img":"img/software/flink.png"},{"id":7,"title":"Apache Spark","category":"Data Processing","tags":["Data Processing","Java","Scala","SQL","R","Python","DataFrame","Table","DataStream","Streaming Analytics","Batch Analytics","Machine Learning","Graph Analytics","Approximations","Sampling","Lazy"],"description":"Apache Spark is fast and general compute engine for Hadoop data.  Spark provides a simple and expressive programming model that supports a wide range of applications, including ETL, machine learning, stream processing, and graph computation.","img":"img/software/spark.png"},{"id":8,"title":"Apache Flume","category":"Library","tags":["Library","Java","Log Collection"],"description":"Flume is a distributed, reliable, and available service for efficiently collecting, aggregating, and moving large amounts of log data. It has a simple and flexible architecture based on streaming data flows. It is robust and fault tolerant with tunable reliability mechanisms and many failover and recovery mechanisms. It uses a simple extensible data model that allows for online analytic application.","img":"img/software/flume.png"},{"id":9,"title":"Apache Giraph","category":"Library","tags":["Library","Java","Graph Analytics","Batch"],"description":"Apache Giraph is an iterative graph processing system built for high scalability.","img":"img/software/giraph.png"},{"id":10,"title":"Apache HDFS","category":"File System","tags":["File System","Hadoop","Java"],"description":" A distributed file system that provides high-throughput access to application data.","img":"img/software/hdfs.png"},{"id":11,"title":"Apache YARN","category":"Cluster Resource Manager","tags":["Cluster Resource Manager","Hadoop","Java"],"description":"A framework for job scheduling and cluster resource management.","img":"img/software/yarn.png"},{"id":12,"title":"Apache HBase","category":"Database","tags":["Database","Hadoop","NoSQL","Java","Eventually Consistent"],"description":"Use Apache HBase software when you need random, realtime read/write access to your Big Data. This project's goal is the hosting of very large tables -- billions of rows X millions of columns -- atop clusters of commodity hardware. HBase is an open-source, distributed, versioned, column-oriented store modeled after Google's Bigtable: A Distributed Storage System for Structured Data by Chang et al. Just as Bigtable leverages the distributed data storage provided by the Google File System, HBase provides Bigtable-like capabilities on top of Hadoop and HDFS.","img":"img/software/hbase.png"},{"id":13,"title":"Apache MapReduce","category":"Data Processing","tags":["Data Processing","Hadoop","Java","Python"],"description":"A YARN-based system for parallel processing of large data sets.","img":"img/software/mapreduce.png"},{"id":14,"title":"Apache Hive","category":"Data Processing","tags":["Data Processing","Hadoop","HiveQL","SQL","Query Processing","Java","MapReduce"],"description":"A data warehouse infrastructure that provides data summarization and ad hoc querying","img":"img/software/hive.png"},{"id":15,"title":"Hortonworks","category":"Distribution","tags":["Distribution","Hadoop","Spark","Kafka"],"description":"Hortonworks develops, distributes and supports HDP - the completely open-source Apache Hadoop data platform, architected for the enterprise.","img":"img/software/hortonworks.png"},{"id":16,"title":"Apache HUE","category":"UI","tags":["UI","Hadoop","Cloudera","Ad Hoc","HiveQL","SQL","Data Import","Java"],"description":"HUE is the Hadoop User Experience and is a Web interface for to load and analytze data with Apache Hadoop.,","img":"img/software/hue.png"},{"id":17,"title":"Apache Impala","category":"Data Processing","tags":["Data Processing","Query Processing","SQL","C++","Batch Analytics"],"description":"Achieve order-of-magnitude performance increase compared to alternatives for the only true interactive analytic solution native to Hadoop.","img":"img/software/impala.png"},{"id":18,"title":"Apache Kafka","category":"Message Broker","tags":["Message Broker","Java","C++","REST API","Messaging","Publish Subscribe","Producer Consumer"],"description":"Apache Kafka is publish-subscribe messaging system implementaed as a distributed commit log with a cluster centric design with string durability and fault tolerance guarantees.","img":"img/software/kafka.png"},{"id":19,"title":"Apache Lucene","category":"Library","tags":["Library","Search","Java","Python"],"description":"Lucene provides Java-based indexing and search technology, as well as spellchecking, hit highlighting and advanced analysis/tokenization capabilities.","img":"img/software/lucene.png"},{"id":20,"title":"Apache Solr","category":"Search Engine","tags":["Search Engine","Java","REST API","UI","Python","Ruby","XML","JSON"],"description":"High performance search engine built using Lucene Core, with XML/HTTP and JSON/Python/Ruby APIs, hit highlighting, faceted search, caching, replication, and a web admin interface.","img":"img/software/solr.png"},{"id":21,"title":"ElasticSearch","category":"Search Engine","tags":["Search Engine","Java","Python","REST API","Lucene","XML","JSON","Aggregations"],"description":"Elasticsearch is a distributed, open source search and analytics engine, designed for horizontal scalability, reliability, and easy management. It combines the speed of search with the power of analytics via a sophisticated, developer-friendly query language covering structured, unstructured, and time-series data.","img":"img/software/elasticsearch.png"},{"id":22,"title":"Apache Mahout","category":"Library","tags":["Library","Machine Learning","Java"],"description":"Apache Mahout is a project of the Apache Software Foundation to produce free implementations of distributed or otherwise scalable machine learning algorithms focused primarily in the areas of collaborative filtering, clustering and classification.","img":"img/software/mahout.png"},{"id":23,"title":"Apache Drill","category":"Data Processing","tags":["Data Processing","Query Processing","SQL","Aggregations","Joins","Batch Analytics"],"description":"Apache Drill is a distributed MPP query layer that supports SQL and alternative query languages against NoSQL and Hadoop data storage systems. It was inspired in part by Google's Dremel.","img":"img/software/drill.png"},{"id":24,"title":"Apache Mesos","category":"Cluster Resource Manager","tags":["Cluster Resource Manager","Docker","Container"],"description":"Apache Mesos is a cluster manager that provides efficient resource isolation and sharing across distributed applications, or frameworks. It can run Hadoop, MPI, Hypertable, Spark, and other frameworks on a dynamically shared pool of nodes.","img":"img/software/mesos.png"},{"id":25,"title":"Apache Parquet","category":"File Format","tags":["File Format","Columnar","Compression","Evolving Schema","Nested Schema","Java","C++","Python"],"description":"Apache Parquet is a columnar storage format available to any project in the Hadoop ecosystem, regardless of the choice of data processing framework, data model or programming language.","img":"img/software/parquet.png"},{"id":26,"title":"Apache ORC","category":"File Format","tags":["File Format","Columnar","Compression","Evolving Schema","Nested Schema"],"description":"ORC is a self-describing type-aware columnar file format designed for Hadoop workloads. It is optimized for large streaming reads, but with integrated support for finding required rows quickly. Storing data in a columnar format lets the reader read, decompress, and process only the values that are required for the current query.","img":"img/software/orc.png"},{"id":27,"title":"Apache Pig","category":"Data Processing","tags":["Data Processing","Hadoop","HiveQL","SQL","Query Processing","Java","Lazy"],"description":"Apache Pig is a platform for analyzing large data sets that consists of a high-level language for expressing data analysis programs, coupled with infrastructure for evaluating these programs. The salient property of Pig programs is that their structure is amenable to substantial parallelization, which in turns enables them to handle very large data sets.","img":"img/software/pig.png"},{"id":28,"title":"Apache ZooKeeper","category":"Distributed Coordinator","tags":["Distribured Coordinator","Paxos","RAFT","Hadoop","HiveQL","SQL","Query Processing","Java","Lazy"],"description":"Apache ZooKeeper server which enables highly reliable distributed coordination.","img":"img/software/zookeeper.png"},{"id":29,"title":"Stanford CoreNLP","category":"Library","tags":["Library","NLP","Java","Text Analytics"],"description":"Stanford CoreNLP provides a set of natural language analysis tools. It can give the base forms of words, their parts of speech, whether they are names of companies, people, etc., normalize dates, times, and numeric quantities, and mark up the structure of sentences in terms of phrases and word dependencies, indicate which noun phrases refer to the same entities, indicate sentiment, and extract open-class relations between mentions.","img":"img/software/corenlp.png"},{"id":30,"title":"Apache Tez","category":"Data Processing","tags":["Data Processing","Hadoop","YARN","Query Processing","Java","Lazy","HiveQL","Pig","SQL"],"description":"Tez aims build an application framework which allows for a complex directed-acyclic-graph of tasks for processing data.","img":"img/software/tez.png"},{"id":31,"title":"Apache Storm","category":"Streaming","tags":["Streaming","Java"],"description":"Stanford CoreNLP provides a set of natural language analysis tools. It can give the base forms of words, their parts of speech, whether they are names of companies, people, etc., normalize dates, times, and numeric quantities, and mark up the structure of sentences in terms of phrases and word dependencies, indicate which noun phrases refer to the same entities, indicate sentiment, and extract open-class relations between mentions.","img":"img/software/storm.png"},{"id":32,"title":"Apache Sqoop","category":"Data Import","tags":["Data Import","Hadoop","Java"],"description":"Sqoop is designed for efficiently transferring bulk data between Apache Hadoop and structured datastores such as relational databases.","img":"img/software/sqoop.png"},{"id":33,"title":"Apache Oozie","category":"Workflow","tags":["Workflow","Hadoop","Java","UI"],"description":"Oozie is a workflow scheduler system integrated with the rest of the Hadoop stack supporting several types of Hadoop jobs out of the box (such as Java map-reduce, Streaming map-reduce, Pig, Hive, Sqoop and Distcp) as well as system specific jobs (such as Java programs and shell script.","img":"img/software/oozie.png"},{"id":34,"title":"Apache Nifi","category":"Workflow","tags":["Workflow","Streaming","Message Broker","Java","UI"],"description":"Apache nifi supports powerful and scalable directed graphs of data routing, transformation, and system mediation logic.","img":"img/software/nifi.png"},{"id":35,"title":"NLTK","category":"Library","tags":["Library","NLP","Python","Text Analytics"],"description":"NLTK is a leading platform for building Python programs to work with human language data. It provides easy-to-use interfaces to over 50 corpora and lexical resources such as WordNet, along with a suite of text processing libraries for classification, tokenization, stemming, tagging, parsing, and semantic reasoning, wrappers for industrial-strength NLP libraries, and an active discussion forum.","img":"img/software/nltk.png"},{"id":36,"title":"Sci-Kit Learn","category":"Library","tags":["Library","Python","Machine Learning"],"description":"Simple and efficient tools for data mining and data analysis, accessible to everybody, reusable in various contexts, built on NumPy, SciPy, and matplotlib","img":"img/software/scikit-learn.png"},{"id":37,"title":"iPython/Jupyter","category":"Notebook","tags":["Notebook","Python","Java","Scala","R","Visualization","SQL"],"description":"The Jupyter Notebook is a web application that allows you to create and share documents that contain live code, equations, visualizations and explanatory text. Uses include: data cleaning and transformation, numerical simulation, statistical modeling, machine learning and much more.","img":"img/software/ipython.png"},{"id":38,"title":"Apache Zeppelin","category":"Notebook","tags":["Notebook","Python","Java","Scala","R","HiveQL","Cassandra","Visualization","SQL"],"description":"A web-based notebook that enables interactive data analytics.  You can make beautiful data-driven, interactive and collaborative documents with SQL, Scala and more.","img":"img/software/zeppelin.png"},{"id":39,"title":"Tableau","category":"BI","tags":["BI","UI","Visualization","SQL"],"description":"Tableau can help anyone see and understand their data. Connect to almost any database, drag and drop to create visualizations, and share with a click.","img":"img/software/tableau.png"},{"id":40,"title":"R","category":"Programming Language","tags":["Programming Language","Dynamic Typing","Interpreted"],"description":"R is a language and environment for statistical computing and graphics. It is a GNU project which is similar to the S language and environment which was developed at Bell Laboratories (formerly AT&T, now Lucent Technologies) by John Chambers and colleagues.  R provides a wide variety of statistical (linear and nonlinear modelling, classical statistical tests, time-series analysis, classification, and clustering) and graphical techniques, and is highly extensible.","img":"img/software/r.png"},{"id":41,"title":"SQL","category":"Programming Language","tags":["Programming Language","SQL","RDBMS","Interpreted"],"description":"is a special-purpose programming language designed for managing data held in a relational database management system (RDBMS), or for stream processing in a relational data stream management system (RDSMS)","img":"img/software/sql.png"},{"id":42,"title":"Scala","category":"Programming Language","tags":["Programming Language","Functional","Java","Static Typing","Compiled"],"description":"Scala began life in 2003, created by Martin Odersky and his research group at EPFL, next to Lake Geneva and the Alps, in Lausanne, Switzerland. Scala has since grown into a mature open source programming language, used by hundreds of thousands of developers, and is developed and maintained by scores of people all over the world. Have the best of both worlds. Construct elegant class hierarchies for maximum code reuse and extensibility, implement their behavior using higher-order functions. Or anything in-between.","img":"img/software/scala.png"},{"id":43,"title":"Java","category":"Programming Language","tags":["Programming Language","Object Oriented","Java","Static Typing","Compiled"],"description":"Java is a general-purpose computer programming language that is concurrent, class-based, object-oriented, and specifically designed to have as few implementation dependencies as possible.","img":"img/software/java.png"},{"id":44,"title":"Python","category":"Programming Language","tags":["Programming Language","Dynamic Typing","Interpreted"],"description":"Python is a widely used general-purpose, high-level programming language. Its design philosophy emphasizes code readability, and its syntax allows programmers to express concepts in fewer lines of code than would be possible in languages such as C++ or Java.","img":"img/software/python.png"},{"id":45,"title":"Presto","category":"Data Processing","tags":["Data Processing","Query Processing","Java","SQL","Machine Learning"],"description":"Presto, designed and written from the ground up for interactive analytics at scale, is an open source distributed SQL query engine for running interactive analytic queries against data sources of all sizes ranging from gigabytes to petabytes.","img":"img/software/presto.png"},{"id":46,"title":"MapR","category":"Distribution","tags":["Distribution","Hadoop","Spark","Kafka"],"description":"The MapR Converged Data Platform integrates the power of Hadoop and Spark with global event streaming, real-time database capabilities, and enterprise storage for developing and running innovative data applications. The MapR Platform is powered by the industry’s fastest, most reliable, secure, and open data infrastructure that dramatically lowers TCO and enables global real-time data applications.","img":"img/software/mapr.png"},{"id":47,"title":"Cloudera","category":"Distribution","tags":["Distribution","Hadoop","Spark","Kafka"],"description":"We provide the world’s fastest, easiest, and most secure data platform built on Hadoop. We help solve your most demanding business challenges with data.","img":"img/software/cloudera.png"},{"id":48,"title":"IBM BigInsights","category":"Distribution","tags":["Distribution","Hadoop","Spark","Kafka"],"description":"Apache™ Hadoop® is an open source software project that enables distributed processing of large data sets across clusters of commodity servers. It is designed to scale up from a single server to thousands of machines, with a very high degree of fault tolerance.","img":"img/software/biginsights.png"},{"id":49,"title":"Amazon Web Services","category":"Cloud Provider","tags":["Cloud Provider","AWS"],"description":"Amazon Web Services offers reliable, scalable, and inexpensive cloud computing services. Free to join, pay only for what you use.","img":"img/software/aws.png"},{"id":50,"title":"Google Cloud Platform","category":"Cloud Provider","tags":["Cloud Provider","Google"],"description":"Google Cloud Platform enables developers to build, test and deploy applications on Google’s highly-scalable and reliable infrastructure. Choose from computing, storage and application services for your web, mobile and backend solutions.","img":"img/software/googlecloud.png"},{"id":51,"title":"Redis","category":"Distributed Cache","tags":["Distributed Cache","Key Value Store","HyperLogLog","Approximations","Probabilistic Data Structures","UDAF"],"description":"Redis is an open source, in-memory Data Structure Store, used as a database, a caching layer for a message broker.","img":"img/software/redis.png"},{"id":52,"title":"JSON","category":"File Format","tags":["File Format","Key Value Store"],"description":"JSON is an open standard format that uses human-readable text to transmit data objects consisting of key value pairs.","img":"img/software/json.png"},{"id":53,"title":"XML","category":"File Format","tags":["File Format","Key Value Store"],"description":"XML, or Extensible Markup Language, is a markup language that defines a set of rules for encoding documents in a format which is both human-readable and machine-readable.","img":"img/software/xml.png"},{"id":54,"title":"MongoDB","category":"Database","tags":["Database","Document Store","Key Value Store","NoSQL","JSON","Eventually Consistent"],"description":"MongoDB is an open-source database developed by MongoDB, Inc. MongoDB stores data in JSON-like documents that can vary in structure. Related information is stored together for fast query access through the MongoDB query language. MongoDB uses dynamic schemas, meaning that you can create records without first defining the structure, such as the fields or the types of their values.","img":"img/software/mongodb.png"},{"id":55,"title":"On-Premise","category":"Cloud Provider","tags":["Cloud Provider","Data Center"],"description":"On-Premise implies that all compute, network, and storage are managed by a customer and contained within their own data centers.","img":"img/software/onpremise.png"},{"id":56,"title":"MicroStrategy","category":"BI","tags":["BI","UI","Visualization","SQL"],"description":"MicroStrategy is the only analytics platform that meets the needs of business and IT. It empowers organizations to make sense of large data volumes, get answers to their toughest business questions, build beautiful data visualizations, and ensure a single version of the truth–at any scale, on any device.","img":"img/software/microstrategy.png"},{"id":57,"title":"Knime","category":"Workflow","tags":["Workflow","UI","Machine Learning","Graph Processing","Visualization"],"description":"The KNIME Analytics Platform incorporates hundreds of processing nodes for data I/O, preprocessing and cleansing, modeling, analysis and data mining as well as various interactive views, such as scatter plots, parallel coordinates and others.  KNIME is based on the Eclipse platform and easily extensible through its modular API.","img":"img/software/knime.png"},{"id":59,"title":"Oracle","category":"Database","tags":["Database","SQL","RDBMS","Transactional"],"description":"Oracle helps you simplify your IT environment to save money, time, and resources and invest in innovation. Oracle provises a comprehensive and fully integrated stack of cloud applications, platform services, and engineered systems.","img":"img/software/oracle.png"},{"id":60,"title":"MySQL","category":"Database","tags":["Database","SQL","RDBMS","Transactional"],"description":"MySQL is an open-source, relational database management system (RDBMS) developed, distributed and supported by Oracle Corporation. MySQL stores data in tables and uses structured query language (SQL) for database access. In MySQL, you pre-define your database schema based on your requirements and set up rules to govern the relationships between fields in your tables. In MySQL, related information may be stored in separate tables, but associated through the use of joins.","img":"img/software/mysql.png"},{"id":61,"title":"Spark ML/MLlib","category":"Library","tags":["Library","Spark","Machine Learning"],"description":"MLlib is Spark’s machine learning (ML) library. Its goal is to make practical machine learning scalable and easy. It consists of common learning algorithms and utilities, including classification, regression, clustering, collaborative filtering, dimensionality reduction, as well as lower-level optimization primitives and higher-level pipeline APIs.","img":"img/software/spark-ml.png"},{"id":62,"title":"Spark Streaming","category":"Library","tags":["Library","Spark","Streaming"],"description":"Spark Streaming is an extension of the core Spark API that enables scalable, high-throughput, fault-tolerant stream processing of live data streams. Data can be ingested from many sources like Kafka, Flume, Twitter, ZeroMQ, Kinesis, or TCP sockets, and can be processed using complex algorithms expressed with high-level functions like map, reduce, join and window. Finally, processed data can be pushed out to filesystems, databases, and live dashboards.","img":"img/software/spark-streaming.png"},{"id":63,"title":"Spark SQL","category":"Library","tags":["Library","Spark","HiveQL","SQL"],"description":"Spark SQL is a Spark module for structured data processing. It provides a programming abstraction called DataFrames and can also act as distributed SQL query engine. Spark SQL can also be used to read data from an existing Hive installation.","img":"img/software/spark-sql.png"},{"id":64,"title":"CSV","category":"File Format","tags":["File Format"],"description":"A comma-separated values (CSV) file stores tabular data (numbers and text) in plain text. Each line of the file is a data record. Each record consists of one or more fields, separated by commas. The use of the comma as a field separator is the source of the name for this file format.","img":"img/software/csv.png"},{"id":65,"title":"Deep Learning 4J","category":"Library","tags":["Library","Deep Learning","Neural Networks"],"description":"Deeplearning4j is the first commercial-grade, open-source, distributed deep-learning library written for Java and Scala. Integrated with Hadoop and Spark, DL4J is designed to be used in business environments, rather than as a research tool.","img":"img/software/deeplearning4j.png"},{"id":66,"title":"Redshift","category":"Database","tags":["Database","Columnar","Data Warehouse","AWS","SQL"],"description":"Amazon Redshift is a fast, fully managed, petabyte-scale data warehouse that makes it simple and cost-effective to analyze all your data using your existing business intelligence tools.","img":"img/software/redshift.png"},{"id":67,"title":"Kinesis","category":"Library","tags":["Library","Streaming","AWS"],"description":"Amazon Kinesis is a platform for streaming data on AWS, offering powerful services to make it easy to load and analyze streaming data, and also providing the ability for you to build custom streaming data applications for specialized needs.","img":"img/software/kinesis.png"},{"id":68,"title":"DynamoDB","category":"Database","tags":["Database","NoSQL","AWS","SQL","Approximations","Eventually Consistent"],"description":"Amazon DynamoDB is a fast and flexible NoSQL database service for all applications that need consistent, single-digit millisecond latency at any scale. It is a fully managed cloud database and supports both document and key-value store models.","img":"img/software/dynamodb.png"},{"id":69,"title":"Spark GraphX","category":"Library","tags":["Library","Graph Analytics","Spark"],"description":"GraphX, Spark's API for graph and graph-parallel computation, unifies ETL, exploratory analysis, and iterative graph computation within a single system.","img":"img/software/spark-graphx.png"},{"id":70,"title":"SQL Server","category":"Database","tags":["Database","SQL","Microsoft","RDBMS","Transactional"],"description":"SQL Server is a relational database management system developed by Microsoft. As a database server, it is a software product with the primary function of storing and retrieving data as requested by other software applications which may run either on the same computer or on another computer across a network (including the Internet).","img":"img/software/sqlserver.png"},{"id":71,"title":"Elastic MapReduce","category":"Data Processing","tags":["Data Processing","MapReduce","Spark","HiveQL","Pig","AWS","Presto"],"description":"Amazon EMR simplifies big data processing, providing a managed Hadoop framework that makes it easy, fast, and cost-effective for you to distribute and process vast amounts of your data across dynamically scalable Amazon EC2 instances.","img":"img/software/emr.png"},{"id":72,"title":"Dato GraphLab Create","category":"Library","tags":["Library","UI","Graph Analytics","Machine Learning","Query Processing","Visualization"],"description":"Dato GraphLab Create is an extensible machine learning framework that enables developers and data scientists to easily build and deploy intelligent applications and services at scale. It includes distributed data structures and rich libraries for data transformation and manipulation, scalable task-oriented machine learning toolkits for creating, evaluating, and improving machine learning models, data and model visualization for all aspects of development.","img":"img/software/graphlab.png"},{"id":73,"title":"Memcached","category":"Distributed Cache","tags":["Distributed Cache","Key Value Store","Java","Python","C++"],"description":"Memcached is an in-memory key-value store for small chunks of arbitrary data (strings, objects) from results of database calls, API calls, or page rendering.","img":"img/software/memcached.png"},{"id":74,"title":"Neo4j","category":"Library","tags":["Library","Graph Analytics","Java"],"description":"Neo4j is an open-source graph database implemented in Java and accessible from software written in other languages using the Cypher Query Language through a transactional HTTP endpoint.[1][2][3] The developers describe Neo4j as an ACID-compliant transactional database with native graph storage and processing.","img":"img/software/neo4j.png"},{"id":75,"title":"Postgres","category":"Database","tags":["Database","SQL","RDBMS","Transactional"],"description":"PostgreSQL is a powerful, open source object-relational database system. It has more than 15 years of active development and a proven architecture that has earned it a strong reputation for reliability, data integrity, and correctness.","img":"img/software/postgres.png"},{"id":76,"title":"Protobuffers","category":"File Format","tags":["File Format","Evolving Schema","Nested Schema"],"description":"Protocol buffers are language-neutral, platform-neutral, extensible mechanism for serializing structured data - think XML, but smaller, faster, and simpler.","img":"img/software/protobuffers.png"},{"id":77,"title":"S3","category":"File System","tags":["File System","Object Store","AWS","Eventually Consistent"],"description":"Simple Storage Service (S3) provides developers and IT teams with secure, durable, highly-scalable object storage.","img":"img/software/s3.png"},{"id":78,"title":"Tensor Flow","category":"Data Processing","tags":["Data Processing","Deep Learning","Neural Networks"],"description":"TensorFlow is an open source software library for numerical computation using data flow graphs. Nodes in the graph represent mathematical operations, while the graph edges represent the multidimensional data arrays (tensors) communicated between them.","img":"img/software/tensorflow.png"},{"id":79,"title":"Titan GraphDB","category":"Database","tags":["Database","Graph","Graph Analytics","Java","Transactional"],"description":"Titan is a scalable graph database optimized for storing and querying graphs containing hundreds of billions of vertices and edges distributed across a multi-machine cluster.","img":"img/software/titandb.png"},{"id":80,"title":"Teradata","category":"Database","tags":["Database","Data Warehouse","SQL"],"description":"Teradata uses a shared nothing architecture, which means that each server node has its own memory and processing power.  Teradata also supports text analytics to track unstructured data, such as word processor documents, and semi-structured data, such as spreadsheets.","img":"img/software/teradata.png"},{"id":81,"title":"Vertica","category":"Database","tags":["Database","Data Warehouse","SQL"],"description":"Using a shared nothing architecture, Vertica is a cluster-based, column-oriented platform designed to manage large, fast-growing volumes of data and provide very fast query performance when used for data warehouses and other query-intensive applications.","img":"img/software/vertica.png"}]
