[{"id":1,"title":"Alan Jackson - Remember When","url":"http://www.anycountrymusiclyrics.com/lyrics/133030/Alan_Jackson/Remember_When","lyrics":"Remember when I was young and so were you  And time stood still and love was all we knew You were the first, so was I We made love and then you cried Remember when Remember when we vowed the vows and walked the walk Gave our hearts, made the start, it was hard We lived and learned, life threw curves There was joy, there was hurt Remember when Remember when old ones died and new were born And life was changed, disassembled, rearranged We came together, fell apart And broke each other's hearts Remember when  Remember when the sound of little feet was the music We danced to week to week Brought back the love, we found trust Vowed we'd never give up Remember when  Remember when thirty something seemed old Now lookin' back, it's just a steppin' stone To where we are, where we've been Said we'd do it all again Remember when  Remember when we said when we turned gray When the children grow up and move away We won't be sad, we'll be glad For all the life we've had And we'll remember when  Remember when Remember when"},{"id":2,"title":"Brooks & Dunn - Believe","url":"http://www.anycountrymusiclyrics.com/lyrics/133469/Brooks_&_Dunn/Believe","lyrics":"Old man Wrigley lived in that white house Down the street where i grew up Momma used to send me over with things We struck a friendship up I spent a few long summers out on his old porch swing  Says he was in the war when in the navy Lost his wife, lost his baby Broke down and asked him one time How ya keep from going crazy He said I'll see my wife and son in just a little while I asked him what he meant He looked at me and smiled, said  (Chorus) I raise my hands, bow my head I'm finding more and more truth in the words written in red They tell me that there's more to life than just what i can see Oh i believe  Few years later i was off at college  Talkin' to mom on the phone one night Getting all caught up on the gossip The ins and outs of the small town life She said oh by the way son, old man Wrigley's died.  Later on that night, i laid there thinkin' back Thought 'bout a couple long-lost summers I didn't know whether to cry or laugh If there was ever anybody deserved a ticket to the other side It'd be that sweet old man who looked me in the eye, said  (Chorus) I raise my hands, bow my head I'm finding more and more truth in the words written in red They tell me that there's more to life than just what i can see  I can't quote the book The chapter or the verse You can't tell me it all ends In a slow ride in a hearse You know I'm more and more convinced The longer that i live Yeah, this can't be No, this can't be No, this can't be all there is  (Chorus) When I raise my hands, bow my head I'm finding more and more truth in the words written in red They tell me that there's more to life than just what i can see I believe Oh, I I believe I believe I believe I believe I believe  "},{"id":3,"title":"Martina McBride - Concrete Angel","url":"http://www.anycountrymusiclyrics.com/lyrics/133199/Martina_McBride/Concrete_Angel","lyrics":"She walks to school with the lunch she packed Nobody knows what she's holdin' back Wearin' the same dress she wore yesterday She hides the bruises with linen and lace The teacher wonders but she doesn't ask It's hard to see the pain behind the mask Bearing the burden of a secret storm Sometimes she wishes she was never born  Through the wind and the rain She stands hard as a stone In a world that she can't rise above But her dreams give her wings And she flies to a place where she's loved Concrete angel  Somebody cries in the middle of the night The neighbors hear, but they turn out the lights A fragile soul caught in the hands of fate When morning comes it'll be too late  [Repeat Chorus]  A statue stands in a shaded place An angel girl with an upturned face A name is written on a polished rock A broken heart that the world forgot  [Repeat Chorus]"},{"id":4,"title":"Josh Turner - Your Man","url":"http://www.anycountrymusiclyrics.com/lyrics/133468/Josh_Turner/Your_Man","lyrics":"Baby lock the door and turn the light down low Put some music on that's soft and slow Baby we ain't got no place to go I hope you understand  I've been thinking 'bout this all day long Never felt a feeling quite this strong I can't believe how much it turns me on  Just to be your man  There's no hurry Don't you worry We can take out time Come a little closer Lets go over  What i had in mind  Baby lock the door and turn the light down low Put some music on that's soft and slow Baby we ain't got no place to go I hope you understand  I've been thinking 'bout this all day long Never felt a feeling quite this strong I can't believe how much it turns me on  Just to be your man  Ain't nobody ever love nobody  The way that i love you We're alone now You don't how  Long I've wanted to  Lock the door and turn the light down low Put some music on that's soft and slow Baby we ain't got no place to go I hope you understand  I've been thinking bout this all day long never felt a feeling that was quite this strong I can't believe how much it turns me on  Just to be your man I Can't believe how much it turns me on  Just to be your man    "},{"id":5,"title":"Carrie Underwood - Jesus, Take The Wheel","url":"http://www.anycountrymusiclyrics.com/lyrics/133435/Carrie_Underwood/Jesus,_Take_The_Wheel","lyrics":"She was driving last Friday on her way to Cincinnati On a snow white Christmas Eve Going home to see her Mama and her Daddy with the baby in the backseat Fifty miles to go and she was running low on faith and gasoline It would been a long hard year She had a lot on her mind and she didn't pay attention She was going way to fast Before she knew it she was spinning on a thin black sheet of glass She saw both their lives flash before her eyes She didn't even have time to cry She was sooo scared She threw her hands up in the air Jesus take the wheel Take it from my hands Cause I can't do this all on my own I'm letting go So give me one more chance To save me from this road I'm on Jesus take the wheel  It was still getting colder when she made it to the shoulder And the car came to a stop She cried when she saw that baby in the backseat sleeping like a rock And for the first time in a long time She bowed her head to pray She said I'm sorry for the way I've been living my life I know I've got to change So from now on tonight  Jesus take the wheel Take it from my hands Cause I can't do this all my own I'm letting go So give me one more chance To save me from this road I'm on  Oh, Jesus take the wheel Oh, I'm letting go So give me one more chance Save me from this road I'm on From this road I'm on Jesus take the wheel Oh, take it, take it from me Oh, why, oh "},{"id":6,"title":"Brad Paisley - When I Get Where I'm Going","url":"http://www.anycountrymusiclyrics.com/lyrics/133466/Brad_Paisley/When_I_Get_Where_I'm_Going","lyrics":"When I get where I'm going On the far side of the sky The first thing that I'm gonna do Is spread my wings and fly  I'm gonna land beside a lion And run my fingers through his mane Or I might find out what it's like To ride a drop of rain  (Chorus:) Yeah when I get where I'm going There'll be only happy tears I will shed the sins and struggles I have carried all these years And I'll leave my heart wide open I will love and have no fear Yeah when I get where I'm going Don't cry for me down here  I'm gonna walk with my grand daddy And he'll match me step for step And I'll tell him how I missed him Every minute since he left Then I'll hug his neck (Chorus:) Yeah when I get where I'm going There'll be only happy tears I will shed the sins and struggles I have carried all these years And I'll leave my heart wide open I will love and have no fear Yeah when I get where I'm going Don't cry for me down here  So much pain and so much darkness In this world we stumble through All these questions I can't answer So much work to do  But when I get where I'm going And I see my maker's face I'll stand forever in the light Of his amazing grace Yeah when I get where I'm going There'll be only happy tears Hallelujah I will love and have no fear When I get where I'm going Yeah when I get where I'm going"},{"id":7,"title":"Chris Cagle - Miss Me Baby","url":"http://www.anycountrymusiclyrics.com/lyrics/133465/Chris_Cagle/Miss_Me_Baby","lyrics":"Miss me baby When you hear our favorite song, Miss me baby And when you start to sing along Think about all the times that we danced In moonlight to it all night long, oh Then miss me baby. And want me honey, Like you did the night you told me that you loved me We couldn't wait anymore. Left the keys in the door, took my hand Pulled me down on the kitchen floor. Yeah, we were that crazy Then miss me baby.  Chorus: Because when he's holding you, Know that it's killing me, Let my memory be the reason girl That you can't sleep And everytime you feel his touch, I pray to God it's not enough And that I've touched your heart so deep Girl, you can't shake me Cause I love you, Yes I need you, Miss me baby.  Miss me baby, Until you can't take it no more Miss me baby Pack your bags and hit the door I'm a man, I was wrong, forgive me Come back home I'll be waiting Right here waiting Miss me baby.  Chorus: Because when he's holding you, Know that it's killing me, Let my memory be the reason girl That you can't sleep And everytime you feel his touch, I pray to God it's not enough And that I've touched your heart so deep Girl, you can't shake me Cause I love you, Yes I need you, Miss me baby.  Everytime you hear this song, Miss me baby..."},{"id":8,"title":"Miranda Lambert - Kerosene","url":"http://www.anycountrymusiclyrics.com/lyrics/133472/Miranda_Lambert/Kerosene","lyrics":"I'm waitin' on the sun to set cause yesterday aint over yet I started smoking cigarettes there's nothing else to do I guess Dusty roads aint made for walking, spinning tires aint made for stoppin' I'm giving up on love cause love's given up on me  I gave it everything I had and everything I got was bad Life aint hard but it's too long to live it like some country song Trade the truth in for a lie, cheating really aint a crime I'm giving up on love cause love's given up on me  Forget you high society, I'm soakin' it in Kereosne Light ïem up and watch them burn, teach them what they need to learn HA! Dirty hands aint made for shakin', aint a rule that aint worth breakin' Well I'm giving up on love cause love's given up on me  Now I don't hate the one who left You He's out there holding on to someone, I'm holding up my smoking gun I'll find somewhere to lay my blame the day she changes her last name Well I'm giving up on love cause love's given up on me Well I'm giving up on love HEY love's given up on me"},{"id":9,"title":"Keith Urban - Making Memories Of Us","url":"http://www.anycountrymusiclyrics.com/lyrics/133254/Keith_Urban/Making_Memories_Of_Us","lyrics":"I'm gonna be here for you baby I'll be a man of my word Speak the language in a voice that you have never heard I wanna sleep with you forever And I wanna die in your arms In a cabin by a meadow where the wild bees swarm And I'm gonna love you like nobody loves you And I'll earn your trust making memories of us  I wanna honor your mother I wanna learn from your pa I wanna steal your attention like a bad outlaw I wanna stand out in a crowd for you A man among men I wanna make your world better than it's ever been  And I'm gonna love you like nobody loves you And I'll earn your trust making memories of us  We'll follow the rainbow Wherever the four winds blow And there'll be a new day Comin' your way  I'm gonna be here for you from now on This you know somehow You've been stretched to the limits but it's alright now And I'm gonna make you a promise If there's life after this I'm gonna be there to meet you with a warm, wet kiss  And I'm gonna love you like nobody loves you And I'll earn your trust making memories of us I'm gonna love you like nobody loves you And I'll win your trust making memories of us "},{"id":10,"title":"Sugarland - Just Might (Make Me Believe)","url":"http://www.anycountrymusiclyrics.com/lyrics/133467/Sugarland/Just_Might_(Make_Me_Believe)","lyrics":"I got miles of trouble spreadin' far and wide Bill on the table gettin' higher and higher They just keep on comin', theres no end in sight I'm just holding on tight... I've got someone who loves me more then words can say And I'm thankful for that each and every day And if I count all my blessings, I get a smile on my face Still hard to find faith..  Chorus: But if you look in my eyes And tell me we'll be alright If you promise never to leave You just might make me believe  Its just day to day tryin' to make ends meet  What id give for an address on easy street  I need a deep margarita to help me unwind  Leave my troubles behind...  Chorus: But if you look in my eyes And tell me we'll be alright If you promise never to leave You just might make me believe  I used to believe in use  When times got tough  Lately I'm afraid that even love is not enough  Chorus: But if you can look in my eyes  And tell me we'll be alright  If you promise never to leave you just might make  Oh, you just might make me  You just might make me believe"},{"id":11,"title":"Kenny Chesney - Who You'd Be Today","url":"http://www.anycountrymusiclyrics.com/lyrics/133456/Kenny_Chesney/Who_You'd_Be_Today","lyrics":"Sunny days seem to hurt the most Wear the pain like a heavy coat I feel you everywhere I go See your smile, I see your face I hear you laughing in the rain Still can't believe your gone (Chorus:) It ain't fair you died to young Like a story that had just begun But death tore the pages all away God knows how I miss you All the hell that I've been through Just knowing, no one could take your place Sometimes I wonder, who you'd be today  Would you see the world Would you chase your dreams Settle down with a family I wonder what would you name your babies Someday's the sky's so blue I feel like I can talk to you And I know it might sound crazy  (Chorus)  Today [3x] Today [3x]  Sunny days seem to hurt the most I wear the pain like a heavy coat The only thing that gives me hope Is I know, I'll see you again someday  Someday, someday "},{"id":12,"title":"Lonestar - Amazed","url":"http://www.anycountrymusiclyrics.com/lyrics/133122/Lonestar/Amazed","lyrics":"Everytime our eyes meet This feeling inside me is almost more than i can take Baby when you touch me I can feel howmuch you love me And it just blows me away I've never been this close to anyone or anything I can hear your thoughts  i can see your dreams Chorus: I don't know how you do what you do I'm so in love with you, it just keeps getting better i wanna spend the rest of my life, with you by my side Forever and ever Every little thing that you do Baby i'm amazed by you  The smell of you skin the taste of your kiss the way you whisper in the dark your hair all around me, baby you surround me you touch every place in my heart oh, it feels like the first time everytime i wanna spend the whole night in your eyes  Chorus  Every little thing that you do i'm so nove with you  it just keeps getting better  I wanna spend the rest of my life, with you by my side forever and ever Every little thing that you do oh, every little thing that you do baby i'm amazed by you..."},{"id":13,"title":"Tim McGraw - My Old Friend","url":"http://www.anycountrymusiclyrics.com/lyrics/133471/Tim_McGraw/My_Old_Friend","lyrics":"My old friend, I recall The times we had hanging on my wall I wouldn't trade them for gold Cause they laugh and they cry me Somehow sanctify me Their woven in the stories I have told And tell again  My old friend, I apologize For the years that have passed Since the last time you and I Dusted off those memories But the running and the races The people and the places There's always somewhere else I had to be Time gets slim, my old friend  Don't know why, don't know why Don't know why, don't know why  My old friend, this song's for you Cause a few a few simple verses Was the least that I could do To tell the world that you were here Cause the love and the laughter Will live long after All of the sadness and the tears We'll meet again, my old friend  Goodbye, goodbye Goodbye, goodbye  My old friend, my old friend Goodbye, goodbye"},{"id":14,"title":"Keith Urban - Tonight I Wanna Cry","url":"http://www.anycountrymusiclyrics.com/lyrics/133248/Keith_Urban/Tonight_I_Wanna_Cry","lyrics":"Alone in this house again tonight I got the TV on, the sound turned down and a bottle of wine There's pictures of you and I on the walls around me The way that it was and could have been surrounds me I'll never get over you walkin' away Chorus: I've never been the kind to ever let my feelings show And I thought that bein' strong meant never losin' your self-control But I'm just drunk enough to let got of my pain To hell with my pride, let it fall like rain From my eyes Tonight I wanna cry  Would it help if I turned a sad song on \"All By Myself\" would sure hit me hard now that you're gone Or maybe unfold some old yellow lost love letters It's gonna hurt bad before it gets better But I'll never get over you by hidin' this way  Chorus: I've never been the kind to ever let my feelings show And I thought that bein' strong meant never losin' your self-control But I'm just drunk enough to let got of my pain To hell with my pride, let it fall like rain From my eyes Tonight I wanna cry  Chorus: I've never been the kind to ever let my feelings show And I thought that bein' strong meant never losin' your self-control But I'm just drunk enough to let got of my pain To hell with my pride, let it fall like rain From my eyes Tonight I wanna cry "},{"id":15,"title":"Faith Hill - Like We Never Loved At All","url":"http://www.anycountrymusiclyrics.com/lyrics/133457/Faith_Hill/Like_We_Never_Loved_At_All","lyrics":"You never looked so good as you did last night, underneath the city lights, there walking with your friend, laughing at the moon. I swear you looked right through me. But I'm still living with your goodbye, and you're just going on with your life. How can you just walk on by without one tear in your eye? Don't you have the slightest feelings left for me? Maybe that's just your way of dealing with the pain, forgetting everything between our rise and fall like we never loved at all.  You, I hear you're doing fine. Seems like you're doing well as far as I can tell. Time is leaving us behind, (time _ leaving us behind) another week has passed and still I haven't laughed yet. So tell me, what your secret is (I wanna know, I wanna know, I wanna know) to letting go, letting go like you did, like you did.  How can you just walk on by without one tear in your eye? Don't you have the slightest feelings left for me? Maybe that's just your way of dealing with the pain, forgetting everything between our rise and fall like we never loved at all.  Did you forget the magic? Did you forget the passion? Oh, and did you ever miss me, and long to kiss me? Oh baby, baby.  Maybe that's just your way of dealing with the pain, forgetting everything between our rise and fall like we never loved at all."},{"id":16,"title":"SugarLand - Baby Girl","url":"http://www.anycountrymusiclyrics.com/lyrics/133258/SugarLand/Baby_Girl","lyrics":"They say in this town, stars stay up all night, Well, I don't know, can't see ïem for the glow of the neon lights. An' it's a long way from here to the place where the home fires burn. Well it's two thousand miles and one left turn. \"Dear Mom and Dad, \"Please send money: I'm so broke that it ain't funny. \"Well, I don't need much; just enough to get me through. \"Please don't worry 'cause I'm all right, \"I'm playin' here at the bar tonight. \"Well, this time, I'm gonna make our dreams come true. \"Well, I love you more than anything in the world, \"Love, \"Your baby girl.\"  Black jack, blue sky: big town full of little white lies. Well, everybody's your friend: you can never be sure. They'll promise fancy cars an' diamond rings, an' all sorts of shiny things, But, girl, you'll remember what your knees are for.  \"Dear Mom and Dad, \"Please send money: I'm so broke that it ain't funny. \"Well, I don't need much; just enough to get me through. \"Please don't worry 'cause I'm all right, \"See, I'm playin' here at the bar tonight. \"Well, this time, I'm gonna make our dreams come true. \"Well, I love you more than anything in the world, \"Love, \"Your baby girl.\"  I know that I'm on my way. Well, I can tell every time I play. An' I know it's worth all the dues I pay, When I can write to you and say:  \"Dear Mom and Dad, \"I'll send money. I'm so rich that it ain't funny. \"Well it oughtta be more than enough to get you through. \"Please don't worry 'cause I'm all right, \"See, I'm stayin' here at the Ritz tonight \"Whaddya know, we made our dreams come true. \"An' there are fancy cars an' diamond rings, \"But you know that they don't mean a thing. \"Well, they all add up to nothin' compared to you. \"Well, remember me in ribbons an' curls. \"I still love you more than anything in the world: \"Love, \"Your baby girl.\"  Ah yeah.  Your baby girl. (\"Dear Mom and Dad, (\"Please send money: I'm so broke that it ain't funny.) (\"Don't need much; just enough to get me through.) Your baby girl.  (\"Please don't worry 'cause I'm all right, (\"Playin' here at the bar tonight.) (Ooh, ooh, ooh.) Dreams come true. "},{"id":17,"title":"Little Big Town - Boondocks","url":"http://www.anycountrymusiclyrics.com/lyrics/133439/Little_Big_Town/Boondocks","lyrics":"(Chorus:) I feel no shame I'm proud of where I came from I was born and raised in the boondocks One thing I know No matter where I go I keep my heart and soul in the boondocks And I can feel That muddy water running through my veins And I can hear that lullaby of a midnight train It sings to me and it sounds familiar  (Chorus:) I feel no shame I'm proud of where I came from I was born and raised in the boondocks One thing I know No matter where I go I keep my heart and soul in the boondocks  And I can taste That honeysuckle and it's still so sweet When it grows wild On the banks down at old camp creek Yeah, and it calls to me like a warm wind blowing  (Chorus:) I feel no shame I'm proud of where I came from I was born and raised in the boondocks One thing I know No matter where I go I keep my heart and soul in the boondocks  It's where I learned about living It's where I learned about love It's where I learned about working hard And having a little was just enough  It's where I learned about Jesus And knowing where I stand You can take it or leave it, this is me This is who I am  Give me a tin roof A front porch and a gravel road And that's home to me It feels like home to me  (Chorus:) I feel no shame I'm proud of where I came from I was born and raised in the boondocks One thing I know No matter where I go I keep my heart and soul in the boondocks  I keep my heart and soul in the boondocks  You get a line, I'll get a pole We'll go fishing in the crawfish hole Five-card poker on a Saturday night Church on Sunday morning  (2x) You get a line, I'll get a pole We'll go fishing in the crawfish hole (Down in the boondocks) Five-card poker on a Saturday night Church on Sunday morning  Say a little prayer for me"},{"id":18,"title":"Billy Currington - Must Be Doin' Somethin' Right","url":"http://www.anycountrymusiclyrics.com/lyrics/133459/Billy_Currington/Must_Be_Doin'_Somethin'_Right","lyrics":"A woman is a mystery A man just cant understand Sometimes all it takes to please her Is the touch of your hand N' Other times you got to take it slow And hold her all night long Heaven knows there's so many ways A man can go wrong *Chorus* Must be doin' somethin' right I just heard ya sigh N' Lean into my kiss And close those deep blue need to eyes Don't know what I did To earn a love like this But baby I must be doin' somethin' right  Anywhere you wanna go Baby show me the way I'm open to suggestions Mmm whatever you say Tonight's about givin' you what you want Whatever it takes Girl I hope i'm on the right road Judgin by the smile on your face  *Chorus* Must be doin' somethin' right I just heard ya sigh N' Lean into my kiss And close those deep blue need to eyes Don't know what I did To earn a love like this But baby I must be doin' somethin' right  *Chorus* Must be doin' somethin' right I just heard ya sigh N' Lean into my kiss And close those deep blue need to eyes Don't know what I did To earn a love like this But baby I must be doin' somethin' right"},{"id":19,"title":"Rascal Flatts - Skin","url":"http://www.anycountrymusiclyrics.com/lyrics/133255/Rascal_Flatts/Skin","lyrics":"Sarah Beth is scared to death To hear what the doctor will say She hasn't been well Since the day that she fell And the bruises just won't go away So she sits and see waits with her mother and dad Flips through an old magazine Till a the nurse with a smile Stands at the door And says will you please come with me Sarah Beth is scared to death Cause the doctor just told her the news Between the red cells and white Something's not right But we're gonna take care of you  Six chances in ten it won't come back again With the therapy were gonna try It's just been approved It's the strongest there is I think we caught it in time  Sarah Beth closes her eyes She dreams she's dancing Around and around without any cares And her very first love is holding her close And the soft wind in blowing her hair  Sarah Beth is scared to death As she sits holding her mom Says it would be a mistake For someone to take A girl with no hair to the prom  Oh, just this morning right there on her pillow Was the coolest of any surprise And she cried when she gathered it all in her hands The proof that she couldn't deny  Sarah Beth closes her eyes She dreams she's dancing Around and around without any cares "},{"id":20,"title":"Shania Twain - From This Moment","url":"http://www.anycountrymusiclyrics.com/lyrics/133083/Shania_Twain/From_This_Moment","lyrics":"(I do swear that I'll always be there. I'd give anything and everything and I will always care. through weakness and strength, happiness and sorrow, for better, for worse, I will love you with every beat of my heart.) From this moment life has begun From this moment you are the one Right beside you is where I belong From this moment on  From this moment I have been blessed I live only for your happiness And for your love I'd give my last breath From this moment on  I give my hand to you with all my heart Can't wait to live my life with you Can't wait to start You and I will never be apart My dreams came true because of you  From this moment as long as I live I will love you, I promise you this There is nothing I wouldn't give From this moment on  You're the reason I believe in love And you're the answer to my prrayers from up above All we need is just the two of us My dreams came true because of you  From this moment as long as I live I will love you, I promise you this There is nothing I wouldn't give From this moment- I will love you as long as I live From this moment on  "},{"id":21,"title":"Dierks Bentley - Come A Little Closer","url":"http://www.anycountrymusiclyrics.com/lyrics/133455/Dierks_Bentley/Come_A_Little_Closer","lyrics":"come a little closer baby i feel like layin you down an a bed of sweet surrender where we can work it all out there ain't nothin that love can't fix girl it's right here at our finger tips so come a little closer baby i feel like layin you down some a little closer baby i feel like lettin go of everything that stand between us and the love we used to know i wanna touch you like a crimson robe and let it wash all you hurt away so come a little closer baby i feel like lettin go if there's still a chance than take my hand and we'll steal away off into the night until we make things right the sun's gonna rise, on a better day  come a little closer baby i feel like strippin it down back to the basics of ou and me and what makes the world go round every inch of you accross my skin i wanna be stronger than we've ever been so come a little closer baby i feel like strippin it down  come a little closer baby just a little bit closer baby come a little closer baby i feel like layin you down"},{"id":22,"title":"Danielle Peck - I Don't","url":"http://www.anycountrymusiclyrics.com/lyrics/133442/Danielle_Peck/I_Don't","lyrics":"ooh.... VERSE 1 You say you're doin' better For your sake I hope it's true I wish you well But that's all that I can do Save your \"I'm sorry's\" Just leave 'em out the door You can't make me feel guilty anymore  CHORUS You say I should stay with you That Jesus forgives you You pray I will, but I won't The difference is Jesus loves you, I don't  VERSE 2 I know it sounds cruel And it's really not like me, but You've put me in a place I never thought I'd be These tears I'm crying Are just tears of goodbye I hope you find someone else Somewhere in your life Somewhere in your life  CHORUS You say I should stay with you That Jesus forgives you You pray I will, but I won't The difference is Jesus loves you, I don't  BRIDGE I don't wanna know you still want me Don't need to hear you can't sleep No I don't, no I don't  CHORUS You say I should stay with you That Jesus forgives you You pray I will, but I won't The difference is Jesus loves you, Oh I know Jesus loves you, I don't  mmhh....."},{"id":23,"title":"Lonestar - You're Like Coming Home","url":"http://www.anycountrymusiclyrics.com/lyrics/133460/Lonestar/You're_Like_Coming_Home","lyrics":"Ridin' restless under broken sky, Weary traveller, somethin' missin' inside, Always lookin' for a reason to turn around. Desperate for a little peace of mind. Just a little piece of what I left behind: Well, I found it now: you're like coming home. You're like a Sunday mornin', pleasin' my eyes; You're a midsummer's dream under a star-soaked sky. That peaceful easy feelin' at the end of a long, long road. You're like coming home; You're like coming home, all right.  Go head an' let your hair fall down. This wanderlust: it's gone now. I'm here in your arms; I'm safe from the road again. These are the days that can't be erased: Baby, there isn't a better place; You're like heaven: you're like coming home.  You're like a Sunday mornin', pleasin' my eyes; You're a midsummer's dream under a star-soaked sky. That peaceful easy feelin' at the end of a long, long road. You're like coming home;  You're that innocence, that serenity, That long-lost part of me.  You're like a Sunday mornin', pleasin' my eyes; A midsummer's dream under a star-soaked sky. That peaceful easy feelin' at the end of a long, long road.  You're like a Sunday mornin', pleasin' my eyes; You're a midsummer's dream under a star-soaked sky. That peaceful easy feelin' at the end of a long, long road. You're like coming home, yeah. You're like coming home; Baby, like coming home; You're like coming home.  "},{"id":24,"title":"Toby Keith - Get Drunk And Be Somebody","url":"http://www.anycountrymusiclyrics.com/lyrics/133470/Toby_Keith/Get_Drunk_And_Be_Somebody","lyrics":"Yeah the big boss man, he likes to crack that whip I ain't nothing but a number on his timecard slip, I give him 40 hours and a piece of my soul, Puts me somewhere at the bottom of his totem pole, Hell I don't even think he knows my name...  (Chorus) Well all week long I'm a real nobody, But I just punched out and its paycheck Friday, Weekends here, good God almighty, I'm going to get drunk and be somebody Yeah, yeah, yeah...  My baby cuts hair at a beauty boutique, Just blowin' and goin' till she dead on her feet, They walk right in and sit right down, She gives them what they want and then she spins them around, Hey I don't think they even know her name...  (Chorus) All week long she's a real nobody, but I just picked her up and its paycheck Friday, Weekends here, good God almighty, Baby lets get drunk and be somebody Yeah, yeah, yeah...  Well just average people, in an everyday bar, driving from work in our ordinary cars, and I like to come here with the regular Joes, drink all you want, be the star of the star of the show  (Chorus) All week long bunch of real nobodies, but we just punched out and its paycheck Friday, Weekends here, good God almighty, People lets get drunk (lets get drunk!) All week long we're some real nobodies, but we just punched out and its paycheck Friday, Weekends here, good God almighty, People lets get drunk and be somebody Yeah, yeah, yeah..."},{"id":25,"title":"George Strait - She Let Herself Go","url":"http://www.anycountrymusiclyrics.com/lyrics/133463/George_Strait/She_Let_Herself_Go","lyrics":"He wondered how she'd take it when he said goodbye. Thought she might do some cryin': lose some sleep at night. But he had no idea, when he hit the road, That without him in her life, she'd let herself go. Let herself go on a singles cruise, To Vegas once, then to Honolulu. Let herself go to New York City: A week at the Spa; came back knocked-out pretty. When he said he didn't love her no more, She let herself go.  She poured her heart an' soul into their three-bedroom ranch. Spent her days raisin' babies, ironin' his pants. Came home one day from the grocery store and found his note, And without him there to stop her, she let herself go.  Let herself go on her first blind-date: Had the time of her life with some friends at the lake. Let herself go, buy a brand new car, Drove down to the beach he always said was too far. Sand sure felt good between her toes:  She let herself go on a singles cruise, To Vegas once, then to Honolulu. Let herself go to New York City: A week at the Spa; came back knocked-out pretty. When he said he didn't love her no more, She let herself go.  To Vegas once: Honolulu, New York City. Came back knocked-out pretty.    "},{"id":26,"title":"Trace Adkins - Honky Tonk Badonkadonk","url":"http://www.anycountrymusiclyrics.com/lyrics/133458/Trace_Adkins/Honky_Tonk_Badonkadonk","lyrics":"Turn it up some Alright boys, this is her favorite song You know that right So, if we play it good and loud She might get up and dance again Ooh, she put her beer down Here she comes Here she comes Left left left right left Whoo Husslers shootin' eightball Throwin' darts at the wall Feelin' damn near 10 ft. tall Here she comes, Lord help us all Ol' T.W.'s girlfriend done slapped him outta his chair Poor ole boy, it ain't his fault It's so hard not to stare At that honky tonk badonkadonk Keepin' perfect rhythm Make ya wanna swing along Got it goin' on Like Donkey Kong And whoo-wee Shut my mouth, slap your grandma There outta be a law Get the Sheriff on the phone Lord have mercy, how's she even get them britches on That honky tonk badonkadonk (Aww son)  Now Honey, you can't blame her For what her mama gave her You ain't gotta hate her For workin' that money-maker Band shuts down at two But we're hangin' out till three We hate to see her go But love to watch her leave With that honky tonk badonkadonk Keepin' perfect rhythm Make ya wanna swing along Got it goin' on Like Donkey Kong And whoo-wee Shut my mouth, slap your grandma There outta be a law Get the Sheriff on the phone Lord have mercy, how's she even get them britches on With that honky tonk badonkadonk (Ooh, that's what I'm talkin' bout right there, honey)  We don't care bout the drinkin' Barely listen to the band Our hands, they start a shakin' When she gets the urge to dance Drivin' everybody crazy You think you fell in love Boys, you better keep your distance You can look but you can't touch That honkey tonk badonkadonk Keepin' perfect rhythm Make ya wanna swing along Got it goin' on Like Donkey Kong And whoo-wee Shut my mouth, slap your grandma There outta be a law Get the Sheriff on the phone Lord have mercy, how's she even get them britches on That honky tonk badonkadonk  That honky tonk badonkadonk Yeah, that honky tonk badonkadonk  (That's it, right there boys, that's why we do what we do It ain't for the money, it ain't for the glory, it ain't for the free whiskey It's for the badonkadonk)"},{"id":27,"title":"Montgomery Gentry - Gone","url":"http://www.anycountrymusiclyrics.com/lyrics/133275/Montgomery_Gentry/Gone","lyrics":"This ain't no temporary, typical, tearful good-bye, uh uh uh This ain't no breakin' up and wakin' up and makin' up one more time, uh uh uh This is gone (gone) gone (gone) gone (gone) gone Gone like a freight-train, gone like yesterday Gone like a soldier in the civil war, bang bang Gone like a '59 Cadillac Like all the good things that ain't never coming back She's gone (gone) gone (gone) gone (gone) gone, she's gone  This ain't no give it time, I'm hurtin' but maybe we can work it out, uh uh uh Won't be no champagne, red rose, romance, second chance, uh uh uh This is gone (gone) gone (gone) gone (gone) gone  Gone like a freight-train, gone like yesterday Gone like a soldier in the civil war, bang bang Gone like a '59 Cadillac Like all the good things that ain't never coming back She's gone (gone) gone (gone) gone (gone) gone She's gone  She's gone (gone) gone (gone) gone (gone) gone, she's gone  Gone like a freight-train, gone like yesterday Gone like a soldier in the civil war, bang bang Gone like a '59 Cadillac Like all the good things that ain't never coming back She's gone (gone) she's gone (gone) she's gone (gone) she's gone She's gone  Gone like a freight-train, gone like yesterday Gone like a soldier in the civil war, bang bang Gone like a '59 Cadillac Like all the good things Well, she's gone  Long gone, done me wrong Never comin' back, my baby's gone Lonely at home, sittin' all alone She's packed her bags and now she's gone Never comin' back, she's gone No no never, no no never, no never comin' back"},{"id":28,"title":"Zona Jones - Two Hearts","url":"http://www.anycountrymusiclyrics.com/lyrics/133474/Zona_Jones/Two_Hearts","lyrics":"I was born a dreamer, seemed like every day my mind came up with something new. But this time it's my heart, with a dream that's here to stay. There's a chance this one might come true.  I can see me being with you, for the rest of my life. Two hearts, one love. And I can see you loving me too, sure would be nice. Two hearts, one love . . . that's us.  I can see my lucky starts, when I gaze into your eyes. Twilight's shadows hold us tenderly. It's so easy to imagine, you here by my side as I turn out the lights and fall to sleep. I can see me being with you, for the rest of my life. Two hearts, one love.  And I can see you loving me too, sure would be nice. Two hearts, one love . . . that's us. I can see me being with you, for the rest of my life. Two hearts, one love. And I can see you loving me too, sure would be nice.  Two hearts, one love . . . that's us. Two hearts, one love. Two hearts, one love . . . that's us.  "},{"id":29,"title":"Tim McGraw - Live Like You Were Dying","url":"http://www.anycountrymusiclyrics.com/lyrics/133212/Tim_McGraw/Live_Like_You_Were_Dying","lyrics":"He said I was in my early forties  with a lot of life before me  when a moment came that stopped me on a dime  and I spent most of the next days looking at the x-rays  Talking bout the options  and talking bout sweet time I asked him when it sank in  that this might really be the real end  how's it hit you when you get that kinda news  man what'd you do and he said I went sky diving  I went Rocky Mountain climbing  I went 2.7 seconds on a bull named BluManchu  and I loved deeper and I spoke sweeter  and I gave forgiveness I'd been denying  and he said someday I hope you get the chance  to live like you were dying.  He said I was finally the husband  that most the time I wasn't  and I became a friend a friend would like to have  and all the sudden going fishin  wasn't such an imposition  and I went three times that year I lost my dad  well I finally read the good book  and I took a good long hard look  at what I'd do if I could do it all again  and then  I went sky diving  I went Rocky Mountain climbing  I went 2.7 seconds on a bull named BluManchu  and I loved deeper and I spoke sweeter  and I gave forgiveness I'd been denying  and he said someday I hope you get the chance  to live like you were dying.  Like tomorrow was a gift and you got eternity to think about  what'd you do with it what did you do with it  what did I do with it  what would I do with it'  Sky diving  I went Rocky Mountain climbing  I went 2.7 seconds on a bull named BluManchu  and then I loved deeper and I spoke sweeter  and I watched an eagle as it was flying  and he said someday I hope you get the chance  to live like you were dying. To live like you were dying  To live like you were dying To live like you were dying  To live like you were dying"},{"id":30,"title":"Garth Brooks - Good Ride Cowboy","url":"http://www.anycountrymusiclyrics.com/lyrics/133440/Garth_Brooks/Good_Ride_Cowboy","lyrics":"From the hills of Kaycee, Wyoming Where life's wooly and wild There's a Navy brat in a cowboy hat And that Copenhagen smile And from buckin' broncs to honky tonks He always sang a cowboy's song We were much too young, havin' too much fun As we all sang along We sang Life's a Highway There's only one way you're gonna get through it When she starts to twist be more like Chris Pull your hat down tight And just LeDoux it! When that whistle blows And that crowd explodes And them pickup men are at your side They tell you good ride cowboy, good ride  From gold buckles to gold records Once again he was spinnin' 'round Took the whole world on And he turned us on to that Western Underground And from Bareback Jack to This Cowboy's Hat The songs were stronger than his pain He would not slow down from town to town Like children running thru the rain  We sang Life's a Highway There's only one way you're gonna get through it When she starts to twist be more like Chris Pull your hat down tight And just LeDoux it! When that whistle blows And that crowd explodes And them pickup men are at your side They tell you good ride cowboy, good ride  We sang Life's a Highway There's only one way you're gonna get through it When she starts to twist be more like Chris Pull your hat down tight And just LeDoux it! When that whistle blows And that crowd explodes And them pickup men are at your side They tell you good ride cowboy, good ride  When we cross that river Jordan, With St Peter on the other side Singin' Good Ride Cowboy, Good Ride! Say Good Ride Cowboy, Good Ride! "},{"id":31,"title":"Montgomery Gentry - She Don't Tell Me To","url":"http://www.anycountrymusiclyrics.com/lyrics/133436/Montgomery_Gentry/She_Don't_Tell_Me_To","lyrics":"Every now an' then, on my home, I stop at a spot where the wild flowers grow, an' I pick a few, 'Cause she don't tell me to. I go out with my boys all right, But most of the time I call it a night before they do, 'Cause she don't tell me to. Sunday mornin', I'm in church, An' my butt an' my back an' necktie hurt, but I'm in the pew, She don't tell me to. Any other woman I know would have tried, To control me and it would be over. Plannin' on my goin' on my own way attitude. All of that stubborness melts away, When I wake with her head on my shoulder, An' I know I've got to love her, Until my life is through, 'Cause she don't tell me to.  Well, I got demons and I've got pride, But when I'm wrong, I apologize like she's mine to lose, 'Cause she don't tell me to. Well, I got dreams in this heart of mine, But nothin' that I wouldn't lay aside if she asked me to. 'Cause she don't tell me to. An' she don't even know, That she keeps lookin' for the next right thing to do, 'Cause she don't tell me to. Yeah, yeah.  Any other woman I know would have tried, To control me and it would be over. Plannin' on my goin' on my own way attitude. And all of that stubborness melts away, When I wake with her head on my shoulder, An' I know I've got to love her, Until my life is through, What else can I do? What else can I do? Whoa, I love her, 'Cause she don't tell me to. She don't tell me to.  Every now an' then, on my home, I stop at a spot where the wild flowers grow, an' I pick a few, Yes I do."},{"id":32,"title":"Brad Paisley - Alcohol","url":"http://www.anycountrymusiclyrics.com/lyrics/133394/Brad_Paisley/Alcohol","lyrics":"I can make anybody pretty I can make you believe any lie I can make you pick a fight with somebody twice your size. . . Well I've been known to cause a few breakups and I've been known to cause a few births I can make you new friends Or get you fired from work.  (Chorus) And since the day I left Milwaukee Lyncheburg Bourbon, France Been makin the bars With lots of big money and helpin white people dance I got you in trouble in high school and college now that was a ball you had some of the best times you'll never remember with me Alcohol, Alcohol  I got blamed at your wedding reception for your best man's embarrasing speech and also for those naked pictures of you at the beach I've influenced kings and world leaders I helped Hemingway write like he did and I`ll bet you a drink or two that I can make you put that lampshade on your head . .  And since the day I left Milwaukee Lyncheburg Bourbon, France Been makin a fool out of folks just like you and helpin white people dance I am medicine and I am poison I can help you up or make you fall you had some of the best times you'll never remember with me Alcohol  And since the day I left Milwaukee Lyncheburg Bourbon, France Been makin the bars With lots of big money (crowd:) and helpin white people dance I got you in trouble in high school and college now that was a ball you had some of the best times you'll never remember with me Alcohol, Alcohol"},{"id":33,"title":"Gretchen Wilson - I Don't Feel Like Loving You Today","url":"http://www.anycountrymusiclyrics.com/lyrics/133450/Gretchen_Wilson/I_Don't_Feel_Like_Loving_You_Today","lyrics":"I don't feel like loving you today, So don't you even try to change my mind, The best thing you can do right now, Is just go away, Cause I don't feel like loving you today, I don't wanna talk about last night, I'm angry and I haven't had much sleep, And I'm so tired and bloodshot, There's no tellin' what I'd say, I don't feel like loving you today,  But you know I will anyway, Even though we make it hard sometimes, I'll wind up forgiving and probably loving you, For the rest of my life, But I don't feel like loving you today, And I've got 16 hours left to go, I might tell you that I'm leaving, Even though you know I'll stay, Cause I don't feel like loving you today,  But you know I will anyway, Even though we make it hard sometimes, I'll wind up forgiving and probably loving you, For the rest of my life, But I don't feel like loving you today,  I just don't feel like loving you today"},{"id":34,"title":"Little Big Town - Good As Gone","url":"http://www.anycountrymusiclyrics.com/lyrics/133438/Little_Big_Town/Good_As_Gone","lyrics":"There's a cold feelin' Runnin' up and down my spine It seems to say \"We're Just Wastin' Time\" It's like a bad movie One I wish I'd never seen The plot gets old, Do you know what mean? Don't try to tell me it ain't what it is Chorus: I'm Good I'm good at seein' the signs I'm good at reading between the lines No use in hangin' on 'Cause you're good to go And baby I'm good as gone  On a lost highway I don't know how I got where I am Take the next splitsville exit ramp It's like a cheap vacation One I thought we planned very well Now we've checked out of the lovely love hotel Don't try to tell me it ain't what it is  Chorus: I'm Good I'm good at seein' the signs I'm good at reading between the lines No use in hangin' on 'Cause you're good to go And baby I'm good as gone  Don't try to tell me it ain't what it is  Chorus: I'm Good I'm good at seein' the signs I'm good at reading between the lines No use in hangin' on 'Cause you're good to go And baby I'm good as gone  Baby I'm gone, I'm gone"},{"id":35,"title":"Joe Nichols - Tequila Makes Her Clothes Fall Off","url":"http://www.anycountrymusiclyrics.com/lyrics/133454/Joe_Nichols/Tequila_Makes_Her_Clothes_Fall_Off","lyrics":"She said I'm going out with my girlfriends Marguerite is at the holiday inn Oh have mercy my only thought Was tequila makes her clothes fall off I told her put an extra layer on I know what happens when she drinks patron? Her closets missing half the things she bought Yea tequila makes her clothes fall off She'll start by kicking out of her shoes Lose an earring in her drink Leave her jacket in the bathroom stall Drop a contact down the sink  Them panty hose aint gonna last too long  If the dj puts bon jovi on She might come home in a table cloth Yea tequila makes her clothes fall off  She can handle any champagne brunch A bridal shower with Bacardi punch Jello shooters full of Smirnoff But tequila makes her clothes fall off  She'll start by kicking out of her shoes Lose an earring in her drink Leave her jacket in the bathroom stall Drop a contact down the sink  She don't mean nothing She just havin fun Tomorrow she say oh what have I done Her friends will joke about the stuff she lost Yea tequila makes her clothes fall off Oh tequila makes her clothes fall off Oh tequila makes her clothes fall off "},{"id":36,"title":"Shania Twain - Man I Feel Like A Woman","url":"http://www.anycountrymusiclyrics.com/lyrics/133086/Shania_Twain/Man_I_Feel_Like_A_Woman","lyrics":"Let's Go girls C'mon Im going out tonight Im feeling alright gonna let it all hang out Wanna make some noise, even raise my voice, yeah I wanna scream and shout No innovisions make no conditions get a little outta line I aint gonna act a little precorrect I only wanna have a good tiiiiime (Refrain) The best thing about being a woman Is the perogative to have a little fun yeah  (chorus) Oh Oh Oh go tottaly crazy forget Ima lady Men shirt short skirts oh oh oh oh Really go wild yeah doing it in style Oh Oh Oh Get in the action feel the attraction Color my hair do what I dare Oh Oh Oh I wanna be free yeah feel the way I feel MAN iI feel like a woman  The girls need a break tonight Im gonna take a chance to get out on the town  We don't need romance, we only wanna dance  we're gonna let our hair hang down  (Refrain)  (chorus) (refrain) (Chorus)  I get totally crazy  can you feel it come come come on baby Whooo whooo whooo  I FEEL LIKE A WOMAN"},{"id":37,"title":"Rascal Flatts - Bless The Broken Road","url":"http://www.anycountrymusiclyrics.com/lyrics/133263/Rascal_Flatts/Bless_The_Broken_Road","lyrics":"I set out on a narrow way many years ago Hoping I would find true love along the broken road But I got lost a time or two Wiped my brow and kept pushing through I couldn't see how every sign pointed straight to you Every long lost dream lead me to where you are Others who broke my heart they were like northern stars Pointing me on my way into your loving arms This much I know is true That God blessed the broken road That led me straight to you I think about the years I spent just passing through I'd like to have the time I lost and give it back to you But you just smile and take my hand You've been there you understand It's all part of a grander plan that is coming true  Every long lost dream lead me to where you are Others who broke my heart they were like northern stars Pointing me on my way into your loving arms This much I know is true That God blessed the broken road That led me straight to you "},{"id":38,"title":"Little Big Town - Boondocks","url":"http://www.anycountrymusiclyrics.com/lyrics/133462/Little_Big_Town/Boondocks","lyrics":"(Chorus:) I feel no shame I'm proud of where I came from I was born and raised in the boondocks One thing I know No matter where I go I keep my heart and soul in the boondocks And I can feel That muddy water running through my veins And I can hear that lullaby of a midnight train It sings to me and it sounds familiar  (Chorus:) I feel no shame I'm proud of where I came from I was born and raised in the boondocks One thing I know No matter where I go I keep my heart and soul in the boondocks  And I can taste That honeysuckle and it's still so sweet When it grows wild On the banks down at old camp creek Yeah, and it calls to me like a warm wind blowing  (Chorus:) I feel no shame I'm proud of where I came from I was born and raised in the boondocks One thing I know No matter where I go I keep my heart and soul in the boondocks  It's where I learned about living It's where I learned about love It's where I learned about working hard And having a little was just enough  It's where I learned about Jesus And knowing where I stand You can take it or leave it, this is me This is who I am  Give me a tin roof A front porch and a gravel road And that's home to me It feels like home to me  (Chorus)  I keep my heart and soul in the boondocks  You get a line, I'll get a pole We'll go fishing in the crawfish hole Five-card poker on a Saturday night Church on Sunday morning  (2x) You get a line, I'll get a pole We'll go fishing in the crawfish hole (Down in the boondocks) Five-card poker on a Saturday night Church on Sunday morning  Say a little prayer for me"},{"id":39,"title":"Blake Shelton - Some Beach","url":"http://www.anycountrymusiclyrics.com/lyrics/133234/Blake_Shelton/Some_Beach","lyrics":" driving down the interstate  running thirty minutes late singing margaritaville and minding my own some foriegn car driving dude with a road rage attitude  pulled up beside me talking on his cell phone he started yellin at me  like i did something wrong he flipped me the bird and then he was gone [chorus] some beach somewhere there's a big umbrella casting shade over an empty chair palm trees are growing warm breeze is blowing i picture myself right there on some beach somewhere  i circled the parking lot tryin to find a spot  just big enough i could park my old truck a man with a big cigar was gettin into his car i stopped an i waited for him to back up from out of no where a mercedes benz  came cruisin up and whipped right in  [chorus] some beach somewhere there's a big umbrella casting shade over an empty chair palm trees are growing warm breeze is blowing i picture myself right there on some beach somewhere  there's cold marguritas and hot senioritas waiting there  i sit in that waiting room it seemed like all afternoon  nurse finally said docs ready for you  but he stuck that needle down into my gum and he started drillin before it was numb  [chorus] some beach somewhere there's a big umbrella casting shade over an empty chair palm trees are growing warm breeze is blowing i picture myself right there on some beach somewhere  there's a beautiful sunset burnin up the atmosphere there's music  on some beach  somewhere"},{"id":40,"title":"Brad Paisley - Little Moments","url":"http://www.anycountrymusiclyrics.com/lyrics/133076/Brad_Paisley/Little_Moments","lyrics":"Well I'll never forget the first time that I heard that pretty mouth say that dirty word And I can't even remember now what she backed my truck into but she covered her mouth and her face got red and she just looked so darn cute That I couldn't Even act like I was mad Yeah I live for little moments like that That's like just last year on my birthday She lost all track of time and burnt the cake And every smoke detector in the house was going off And she was just about to cry until I took her in my arms And I tried not To let her see me laugh Yeah I live for little moments like that  I know she's not perfect but she tries so hard for me And I thank God that she isn't cause how boring would that be It's the little imperfections It's the sudden change of plans when she misreads the directions and we're lost but holding hands Yeah I live for little moments like that  When she's layin on my shoulder on the sofa in the dark and about the time she falls asleep so does my right arm and I want so bad to move it cause it's tingling and it's numb she looks so much like an angel that I don't wanna wake her up yeah I live for little moments when she steals my heart again and doesn't even know it Yeah I live for little moments like that "},{"id":41,"title":"Gretchen Wilson - California Girls","url":"http://www.anycountrymusiclyrics.com/lyrics/133444/Gretchen_Wilson/California_Girls","lyrics":"Well I ain't never had a problem with California There's a lot of good women, Sacramento to Corona But them Hollywood types, after a while wear on ya Strutin' around in their size zeros, Skinny little girls no meat on thier bones Never even heard of George Jones CHORUS Ain't you glad we ain't no California girls Ain't you glad there's still a few of us left, who know how to rock your world Ain't afraid to eat fried chicken and dirty dance to Merle Ain't you glad we ain't no California girls  There ain't nothing wrong with plastic surgery Well, Dolly Parton never looked so good to me Everybody oughta be exactly who they want to be But that Paris Hilton gets under my skin With her big fake smile and her painted on skin Never had a chance at a real man  CHORUS Ain't you glad we ain't no California girls Ain't you glad there's still a few of us left, who know how to rock your world Ain't afraid to eat fried chicken and dirty dance to Merle Ain't you glad we ain't no California girls  CHORUS Ain't you glad we ain't no California girls Ain't you glad there's still a few of us left, who know how to rock your world Ain't afraid to eat fried chicken and dirty dance to Merle Ain't you glad we ain't no California girls"},{"id":42,"title":"Nicholas Jonas - Dear God","url":"http://www.anycountrymusiclyrics.com/lyrics/133340/Nicholas_Jonas/Dear_God","lyrics":"Dear God I hat to be a bother, but I gotta say This world is getting crazier with every day I hope You'll hear me out now as I stop and pray Dear God People take Your words and try to twist ïem round I know You can't be happy with what's goin' down I'm searchin' for some answers, but they can't be found Can You help me out, dear God  Dear God, Just the other night I heard somebody say What's the use believin' in You anyway I guess it was just heartache talkin' through the pain It's a cryin' shame  Dear God, I know You're disappointed in the things we've done Can't they see the truth that they're all running from Try to preach You message with a loaded gun What they thinkin' of, Dear God  Everybody's searching for an easy solution They can't see beyond, the selfish world they're living in Your words of love get lost, in all the confusion But I still believe, someday You're gonna speak to me  Dear God, I know You've got a million other calls to take You're dealing with a lot of things that just won't wait But there is one request that I just gotta make  Dear God Won't You send a sign down, just to ease my doubt I'm trying to hear You, but the silence is so loud I think I see a rainbow from behind the clouds And I hear You now, dear God."},{"id":43,"title":"Martina McBride - In My Daughter's Eyes","url":"http://www.anycountrymusiclyrics.com/lyrics/133056/Martina_McBride/In_My_Daughter's_Eyes","lyrics":" Martina McBride - In My Daughter's Eyes Lyrics  In my daughter's eyes I am a hero I am strong and wise and I know no fear But the truth is plain to see She was sent to rescue me I see who I wanna be In my daughter's eyes In my daughter's eyes everyone is equal Darkness turns to light and the world is at peace This miracle God gave to me gives me strength when I am weak I find reason to believe In my daughter's eyes  And when she wraps her hand around my finger Oh it puts a smile in my heart Everything becomes a little clearer I realize what life is all about  It's hangin' on when your heart has had enough It's giving more when you feel like giving up I've seen the light It's in my daugter's eyes  In my daughter's eyes I can see the future A reflection of who I am and what will be Though she'll grow and someday leave Maybe raise a family When I'm gone I hope you see how happy she made me For I'll be there In my daughter's eyes"},{"id":44,"title":"Keith Urban - Better Life","url":"http://www.anycountrymusiclyrics.com/lyrics/133427/Keith_Urban/Better_Life","lyrics":"Friday night and the moon is high I'm wide-awake just watchin' you sleep And I promise you you're gonna have More than just the things that you need We ain't got much now, We're just startin' out But I know somehow paradise is comin' [Chorus:] Someday baby, You and I are gonna be the ones Good luck's gonna shine Someday baby you and I are gonna be the ones So hold on We're headed for a better life  Oh now there's a place for you and me Where we can dream as big as the sky I know it's hard to see it now But baby someday we're gonna fly This road we're on, you know it might be long But my faith is strong It's all that really matters  [Chorus:] Someday baby, You and I are gonna be the ones Good luck's gonna shine Someday baby you and I are gonna be the ones So hold on We're headed for a better life  So hold on, hold on C'mon baby, hold on  Yeah, we're gonna have it all And ooh  [Chorus:] Someday baby, You and I are gonna be the ones Good luck's gonna shine Someday baby you and I are gonna be the ones So hold on We're headed for a better life  [Chorus:] Someday baby, You and I are gonna be the ones Good luck's gonna shine Someday baby you and I are gonna be the ones So hold on We're headed for a better life  Oh, a better life Hey we're gonna leave this all behind us baby, wait and see We're headed for a better life, you and me We're gonna break the chains that bind and, finally we'll be free We're gonna be the ones that have it all, you and me Just hold on tight now baby"},{"id":45,"title":"Neal McCoy - Billy's Got His Beer Goggles On","url":"http://www.anycountrymusiclyrics.com/lyrics/133464/Neal_McCoy/Billy's_Got_His_Beer_Goggles_On","lyrics":"Awww Yah! Billy's at the bar, he's been there all night First ten beers he's had, since her goodbye HEY! HEY! She left him broke, in his new truck He don't smoke, but he lights one up Temporary fix, for his heartache He's hurting bad, but he's feeling great  He's on the dance floor yelling Freebird Singing off pitch but he knows every word Grabs him a girl and he holds on tight He's chasing everything in sight He'll fall apart when he gets home But right now his worries are gone Life looks good, good, good Billy's got his beer goggles on Hey!  Lot of drunks, get real mean They'll pick a fight, over anything Billy wants to laugh, that's why he's here You won't see him cry, unless you spill his beer  He's on the dance floor yelling Freebird Singing off pitch but he knows every word Grabs him another girl and he holds on tight Now he's chasing everything in sight He'll fall apart when he gets home Right now his worries are gone Life looks good, good, good Billy's got his beer goggles. on  He's on the dance floor yelling Freebird Singing off pitch but he knows every word Grabs him another girl he hold on tight He don't see ugly Through blood shot eyes He'll fall apart when he gets home But right now his worries are gone Cause life looks good, good, good So good, good, good, Life looks good, good, good Billy's got his beer goggles.on"},{"id":46,"title":"Gord Bamford - All About Her","url":"http://www.anycountrymusiclyrics.com/lyrics/133441/Gord_Bamford/All_About_Her","lyrics":"I used to wonder what they meant By walking the floor Now there's grooves under my boots And I don't wonder anymore All those simple country songs Have so much meaning since I lost her They go right through my heart Not in one ear and out the other Like when my Daddy spun that vinyl Of Hank Snow and Charlie Pride It always caught Momma's attention And she'd just break right down and cry But I'd just listen to the pickin' 'Cause that's the only part I liked I didn't understand the words Now they're all about her  We went out walkin' after midnight Now I do it alone It seems like one day she was with me And the next day she was gone There's a high lonesome sound And the melody is whistling I remember from my childhood When I didn't know what I was missing  Like when my Daddy spun that vinyl Of Kitty Wells and Loretta Lynn It always caught Momma's attention And she'd just break right down again But I'd just listen to the pickin' The only part that pulled me in I didn't understand the words Now they're all about her  Here's to pick-up trucks and good dogs And heartaches I'm gonna listen to what gets me through If that's what it takes  So now when I spin my records Of George Strait and Tim McGraw I close my eyes and let that lyric Catch me when I fall I still listen to the pickin' Yes I do but that's not all Now that I understand the words And they're all about her  They're all about her"},{"id":47,"title":"Gretchen Wilson - Skoal Ring","url":"http://www.anycountrymusiclyrics.com/lyrics/133446/Gretchen_Wilson/Skoal_Ring","lyrics":"[Chorus] Don't need no diamond ring Don't want a bunch of bling bling The only thin I really need Is a man with a SKOAL Ring Don't have to be wined and dined We can stay home every night I can do without anything Except a man with a SKOAL Ring  He works a ten hour shift and comes home right on time He don't complain a bit when I get out of line He ain't rich and he might have a little dirt on his hands But that worn-out circle on his jeans makes him my kind of man  [1/2 Chorus]  I've always been a bandit girl and he's a long cut man Somehow we still get along with different colored can's When that boy comes home from work smellin' like the farm That berryblend on his lips still turns me on  [Chorus]  Don't need no diamond ring Don't want a bunch of bling bling The only thin I really need Is a man with a SKOAL Ring Don't have to be wined and dined We can stay home every night I can do without anything Except a man with a SKOAL Ring  The one thing that gets to me is a man with a SKOAL Ring "},{"id":48,"title":"Kevin Fowler - Don't Touch My Willie","url":"http://www.anycountrymusiclyrics.com/lyrics/133434/Kevin_Fowler/Don't_Touch_My_Willie","lyrics":"She showed up at my house at half past nine In a low-cut dress with a bottle of wine She said this will be a night you won't forget She poured us some drinks to get us into the mood I reached for the lights, she reached for my tunes She pulled out that Red Headed Stranger, I stood up and said  Don't touch my Willie I don't know you that well Help yourself to some Haggard or some Jones Hell, or anybody else I don't know what you heard I ain't that kind of guy Yeah so don't touch my Willie, We'll get a long just fine  She said she never met a man like me in her life Who wouldn't share his Willie on the very first night I said it's nothing personal, don't take it so hard  I don't pull out my Willie for just anyone There's a lot of other records that you can choose from So let me make myself clear before you go too far  Don't touch my Willie I don't know you that well Help yourself to some Haggard or some Jones Hell, or anybody else I don't know what you heard I ain't that kind of guy Yeah so don't touch my Willie, We'll get a long just fine  Keep your hands off my Willie, We'll get along just fine "},{"id":49,"title":"Jimmy Wayne - I Love You This Much","url":"http://www.anycountrymusiclyrics.com/lyrics/133062/Jimmy_Wayne/I_Love_You_This_Much","lyrics":"He can't remember the times that he thought Does my daddy love me? Probably not But that didn't stop him from wishing that he did Didn't keep from wanting or worshiping him He guesses he saw him about once a year He could still feel the way he felt Standing in tears Stretching his arms out as far as they'd go Wispering daddy, I wan't you to know  Chorus I love you this much and I'm waiting on you To make up your mind, do you love me to? However long it takes I'm never giving up No matter what, I love you this much  He grew to hate him for what he had done 'Cause what kind of a father, could do that to his son He said 'damn you daddy', the day that he died The man didn't blink, but the little boy cried  Chorus  Half way through the service While the choir sand a hymn He looked up above the preacher And he sat and stared at him  He said \"Forgive me father\" When he realized That he hadn't been unloved or alone all his life His arms were stretched out as far as they'd go Nailed to the cross, for the whole world to know  Chorus"},{"id":50,"title":"LeAnn Rimes - Probably Wouldn't Be This Way","url":"http://www.anycountrymusiclyrics.com/lyrics/133273/LeAnn_Rimes/Probably_Wouldn't_Be_This_Way","lyrics":"Got a date a week from Friday with the Preacher's son, Everybody says he's crazy, I'll have to see I finally moved to Jackson when the summer came, I won't have to pay that boy to rake my leaves I'm probably going on and on it seems I'm doing more of that these days (Chorus:) I probably wouldn't be this way I probably wouldn't hurt so bad I never pictured every minute without you in it, Oh you left so fast, Sometimes I see you standing there Sometimes it's like I'm losing touch Sometimes I feel I'm so lucky to have had the chance to love this much God give me moments grace Cause if I'd nevber seen your face I probably wouldn't be this way  Momma says that I just shouldn't speak to you, Susan says that I should just move on, You oughta see the way these people look at me, When they see me 'round here talking to this stone, Everybody thinks I've lost my mind but I just take it day by day  (Chorus:) I probably wouldn't be this way I probably wouldn't hurt so bad I never pictured every minute without you in it, Oh you left so fast, Sometimes I see you standing there Sometimes it's like I'm losing touch Sometimes I feel I'm so lucky to have had the chance to love this much God give me moments grace Cause if I'd never seen your face I probably wouldn't be this way  I probably wouldn't be this way, I probably wouldn't hurt so bad, I never pictured every minute without you in it, Oh you left so fast, Sometimes I see you standing there, Sometimes I feel an angels touch Sometimes I feel that I'm so lucky to have had the chance to love this much God give me a moments grace Cause if I'd never see your face I probably woudln't be this way I probably wouldn't be this way  Got a date a week from a Friday with the Preacher's son, Everybody says I'm crazy, guess I'll have to see"},{"id":51,"title":"Shannon Brown - Corn Fed","url":"http://www.anycountrymusiclyrics.com/lyrics/133443/Shannon_Brown/Corn_Fed","lyrics":"We don't flip the bird, we don't cuss an' scream, When the cars don't move when the light turns green. We don't lock our doors when we leave the house, There ain't nobody here that we'd keep out. That's the way we do it in our town, yeah. You never hear me apologize, For growin' up strong, growin' up right. Livin' life by the Golden Rule. Say: \"Yes, Ma'am,\" \"Thank You.\" Green fields for miles an' miles, Ain't nothin' but country on the radio dial. I thank the good Lord I was born an' bred, Corn fed.  Ain't no burnin' flags on our Court House Square. You see Old Glory flyin' everywhere. There ain't no Valley joint with five-star atmosphere. Daddy's home-grown beet's what's for dinner here. An we wash it down with a tall, cold beer, yeah.  You never hear me apologize, For growin' up strong, growin' up right. Livin' life by the Golden Rule. Say: \"Yes, Ma'am,\" \"Thank You.\" Green fields for miles an' miles, Ain't nothin' but country on the radio dial. I thank the good Lord I was born an' bred, Corn fed.  Rooster crows, six a.m.; John Deere pulling that plow again. Spit on your face, hands in the dirt, Ain't nothin' better on God's great earth.  You never hear me apologize, For growin' up strong, growin' up right. Livin' life by the Golden Rule. Say: \"Yes, Ma'am,\" \"Thank You.\" Green fields for miles an' miles, Ain't nothin' but country on the radio dial. I thank the good Lord I was born an' bred; Well, I thank the good Lord I was born an' bred, Corn fed. Corn fed. Corn fed. Corn fed."},{"id":52,"title":"Rockie Lynne - Lipstick","url":"http://www.anycountrymusiclyrics.com/lyrics/133437/Rockie_Lynne/Lipstick","lyrics":"Well, enough Of this nonsense, baby We're bigger than this Let's get back to us And the thrill we felt with our first kiss You know the road can take us Out where we both feel so alive Let's go tonight You can put your lipstick on while I drive Chorus: We can go down to old El Paso Spend the night in New Orleans Go out to California like we've always dreamed Makin' love out in the desert I can watch the sunset in your eyes Let's go tonight You can put your lipstick on while I drive (You can put your lipstick on while I drive) (While I drive)  Well, I'm tired Of this life we're livin' Dreamin' dead-end dreams Like a worn-out ol' shag carpet frayin' at the seams You know we got to change it No waitin' 'til the time is right Let's go tonight You can put your lipstick on while I drive  Chorus: We can go down to old El Paso Spend the night in New Orleans Go out to California like we've always dreamed Makin' love out in the desert I can watch the sunset in your eyes Let's go tonight You can put your lipstick on while I drive (You can put your lipstick on while I drive) (While I drive)  Bridge: Let me touch you Let me love you Let your heart race next to mine  Chorus: We can go down to old El Paso Spend the night in New Orleans Go out to California like we've always dreamed Makin' love out in the desert I can watch the sunset in your eyes Let's go tonight You can put your lipstick on while I drive (You can put your lipstick on while I drive) (While I drive)"},{"id":53,"title":"Keith Urban - You'll Think Of Me","url":"http://www.anycountrymusiclyrics.com/lyrics/133125/Keith_Urban/You'll_Think_Of_Me","lyrics":"I woke up early this morning around 4am With the moon shining bright as headlights on the interstate I pulled the covers over my head and tried to catch some sleep But thoughts of us kept keeping me awake Ever since you found yourself in someone else's arms I've been tryin' my best to get along But that's OK There's nothing left to say, but Take your records, take your freedom Take your memories I don't need'em Take your space and take your reasons But you'll think of me And take your cat and leave my sweater 'Cause we have nothing left to weather In fact I'll feel a whole lot better But you'll think of me, you'll think of me  I went out driving trying to clear my head I tried to sweep out all the ruins that my emotions left I guess I'm feeling just a little tired of this And all the baggage that seems to still exist It seems the only blessing I have left to my name Is not knowing what we could have been What we should have been So  Take your records, take your freedom Take your memories I don't need'em Take your space and take your reasons But you'll think of me And take your cat and leave my sweater 'Cause we have nothing left to weather In fact I'll feel a whole lot better But you'll think of me  Someday I'm gonna run across your mind Don't worry, I'll be fine I'm gonna be alright While you're sleeping with your pride Wishing I could hold you tight I'll be over you  And on with my life  So take your records, take your freedom Take your memories I don't need'em And take your cat and leave my sweater 'Cause we have nothing left to weather In fact I'll feel a whole lot better But you'll think of me  So take your records, take your freedom Take your memories I don't need'em Take your space and all your reasons But you'll think of me And take your cat and leave my sweater 'Cause we got nothing left to weather In fact I'll feel a whole lot better But you'll think of me, you'll think of me, yeah  And you're gonna think of me Oh someday baby, someday"},{"id":54,"title":"Kenny Chesney - Some People Change","url":"http://www.anycountrymusiclyrics.com/lyrics/133169/Kenny_Chesney/Some_People_Change","lyrics":"His old man was a rebel yeller, that boy to the bone, and say can't trust a color feller, he judge em by the tone of their skin. He was raised to think like his dad narrow mind full of hate on the road to no where fast till the grace of god got in the way then he saw the light n hit he's knees n cried and said a prayer, rose up a brand new man n left the old one right there [Chorus:] Here's to the strong, thanks to the brave don't give up hope some people change against all odds, against the gray love finds a way, some people change  She was born with her mothers habit guess you can say its in her blood she hates it that she's gotta have it she fills a glass up n she love to kill that bottle but all she could think about is a better life, a second chance for everyone she's letting down she throws that bottle down  [Chorus:] Here's to the strong, thanks to the brave don't give up hope Some people change against all odds, against the gray love finds a way, some people change  Thank god for those who make it let them be the light  Some people change  Here's to the strong, thanks to the brave don't give up hope Some people change, against all odds against the gray, love finds a way, some people change  Some people change Some people change"},{"id":55,"title":"Toby Keith - Big Blue Note","url":"http://www.anycountrymusiclyrics.com/lyrics/133461/Toby_Keith/Big_Blue_Note","lyrics":"See that big blue note, Over there on the counter? You don't wanna read that thing, man, It's a real get-you-downer. But don't you dare say nothin' else, Bad about her: she's gone. No, no, no, no, don't, don't throw it away, 'Cause tonight, I might need it. It gets real lonely around here at night some times, An' I have to read read it. Besides, you can show it to the boys down town, They won't believe that she's gone.  There used to be a time I was all she ever wanted. All the man that she'll ever need. I come home to find, just like that, she's up an' vanished. An' the only thing she left behind for me:  Is this big blue note, Folded up in my pocket. Yeah, don't laugh: it's been two months; I still got it. Sometimes I have to read the sucker twice, Just to make sure I ain't forgot that she's gone.  You know, my psychiatrist said: \"Tell me, what do you see, \"When you look at these inkspots, \"Of, er, reds, yellows an' greens?\" You know, I looked at 'em all, But they all looked to me like big blue notes.  There used to be a time I was all she ever wanted. All the man that she'll ever need. I come home to find, just like that, she's up an' vanished. An' the only thing that's left to do for me:  Is stand high on this cliff, Overlooking the sea. With my big blue notepaper aeroplane, That I just set free. An' I'm gonna wait here a few more minutes, An' if it don't come back to me: You guessed it: she's gone.  Crash landing. Bye bye, baby."},{"id":56,"title":"Josh Gracin - Stay With Me (Brass Bed)","url":"http://www.anycountrymusiclyrics.com/lyrics/133385/Josh_Gracin/Stay_With_Me_(Brass_Bed)","lyrics":"Baby, the clock on the wall is lying It's not really that late  It's too cold outside to be walking around  the streets of this town Anywhere if you think you have to be can wait [chorus] (Baby) Why don't you stay with me  Share all your secrets tonight  We can make believe the morning sun never will rise  Come and lay your head on this big brass bed  And we'll be alright as long as you stay with me, yeah  Baby, there's just no use in hiding The way that I am feeling right now With you standing there baby I swear I can't help but stare  Girl you're wearing me out, wearing me out  [chorus] (Baby) So why donÕt you stay with me share all your secrets tonight  We can make believe  the morning sun never will rise  Come and lay your head on this big brass bed  We'll be alright as long as you stay with me  [Bridge] Baby don't go it looks like it's starting to rain  And it's so warm here in this apartment wrapped up in this blanket  [chorus] (Baby) Why don't you stay with me  Share all your secrets tonight  We can make believe the morning sun never will rise  Come and lay your head on this big brass bed  And we'll be alright as long as you stay with me, yeah  Stay with me"},{"id":57,"title":"Andy Griggs - If Heaven","url":"http://www.anycountrymusiclyrics.com/lyrics/133364/Andy_Griggs/If_Heaven","lyrics":"If Heaven was an hour, it would be twilight, When the fireflies start their dancin' on the lawn; An' supper's on the stove and Mamma's laughin', And everybodys workin' day is done. If Heaven was a town, it would be my town, Oh, on a summer day in 1985. An' everything I wanted was out there waitin', And everyone I loved was still alive.  Don't cry a tear for me, now, baby; There comes a time we all must say goodbye. And if that's what Heaven's made of, You know, I, I ain't afraid to die.  If Heaven was a pie, it'd be cherry, So cool and sweet an' heavy on the tongue. An' just one bite would satisfy your hunger, An' there'd always be enough for everyone.  If Heaven was a train, it sure would be a fast one, That could take this weary traveller around the bend. If Heaven was a tear, it'd be my last one, An' you'd be in my arms again.  Don't cry a tear for me, now, baby; There comes a time we all must say goodbye. And if that's what Heaven's made of, You know, I, I ain't afraid to die.  Yeah, if that's what Heaven's made of, You know, I, I ain't afraid to die."},{"id":58,"title":"Brad Paisley - Whiskey Lullaby","url":"http://www.anycountrymusiclyrics.com/lyrics/133196/Brad_Paisley/Whiskey_Lullaby","lyrics":"She put him out like the burnin' end of a midnight cigarette She broke his heart he spent his whole life tryin' to forget We watched him drink his pain away a little at a time But he never could get drunk enough to get her off his mind Until the night 1st Chorus He put that bottle to his head and pulled the trigger And finally drank away her memory Life is short but this time it was bigger Than the strength he had to get up off his knees We found him with his face down in the pillow With a note that said I'll love her till I die And when we buried him beneath the willow The angels sang a whiskey lullaby  (Sing lullaby)  The rumors flew but nobody know how much she blamed herself For years and years she tried to hide the whiskey on her breath She finally drank her pain away a little at a time But she never could get drunk enough to get him off her mind Until the night  2nd Chorus She put that bottle to her head and pulled the trigger And finally drank away is memory Life is short but this time it was bigger Than the strength she had to get up off her knees We found her with her face down in the pillow Clinging to his picture for dear life We laid her next to him beneath the willow While the angels sang a whiskey lullaby"},{"id":59,"title":"Sugarland - Something More","url":"http://www.anycountrymusiclyrics.com/lyrics/133376/Sugarland/Something_More","lyrics":"Monday, hard to wake up Fill my coffee cup, I'm out the door Yeah, the freeway's standing still today It's gonna make me late, and thats for sure I'm running out of gas and out of time Never gonna make it there by nine Chorus: There's gotta be something more Gotta be more than this I need a little less hard time I need a little more bliss I'm gonna take my chances Taking a chance I might Find what I'm looking for There's gotta be something more  Five years and there's no doubt That I'm burnt out, I've had enough So now boss man, here's my two weeks I'll make it short and sweet, so listen up I could work my life away, but why? I got things to do before die  Chorus: There's gotta be something more Gotta be more than this I need a little less hard time I need a little more bliss I'm gonna take my chances Taking a chance I might Find what I'm looking for There's gotta be something more  Some believe in destiny, and some believe in fate I believe that happiness is something we create You best belive that I'm not gonna wait 'Cause there's gotta be something more  I get home 7:30 the house is dirt, but it can wait Yeah, 'cause right now I need some downtime To drink some red wine and celebrate Armageddon could be knocking at my door  but I ain't gonna answer thats for sure. There's gotta be something more!"},{"id":60,"title":"Gretchen Wilson - Rebel Child","url":"http://www.anycountrymusiclyrics.com/lyrics/133451/Gretchen_Wilson/Rebel_Child","lyrics":"Rebel Child Rebel Child, won't you heed my warnin One of these days the rain'll come pourin' Some of thouse sunshine blue sky mornin's Might just turn to grey I understand why you do the thing you do There was a time when I was just like you I know right now you think you know it all There's no way that you can break No way you can fall  [Chorus 2]  Rebel Child, won't you heed my warnin' One of these days the rain'll come pourin' Some of thouse sunshine blue sky mornin's Might just turn to grey  I've been there and I know what you're thinking You're flying highbut one day you'll blink and THat cloud your're on will just startsinkin' Don't wait till it's too late Whoa oh rebel child  I know you can't learn from my mistakes You've got your own road you've gotta take And it might look like it's paved in gold Just remember that you'll have to reap All the seeds you sew  [repeat chorus 2]  Keep your feet on the ground And one eye one heaven do Do a lot of forgivin' But not much forgettin' And remember life is one big lesson  [Repeat Chorus 2]  Whoa oh Rebel Child Whoa oh Rebel Child"},{"id":61,"title":"Jason Aldean - Hicktown","url":"http://www.anycountrymusiclyrics.com/lyrics/133429/Jason_Aldean/Hicktown","lyrics":"You like the way that sounds? Little Jimmy Jackson is jackin' up his Bronco  He's gonna lay a little rubber later on at the truck pull  All the girls are getting' pretty sprayin' on the White Rain  Yeah they're gonna get a rowdy tonight down at the football game  Yeah  Chorus:  We let it rip when we got the money  Let it roll if we got the gas  It gets wild yeah but that's the way we get down  In a Hicktown  Well you can see the neighbors butt crack nailing on his shingles  And his woman's' smokin' Pall Mall's watchin' Laura Ingles  And Granny's getting' lit she's headin' out to bingo  Yeah my buddies and me are goin' muddin' down on Blue Hole Road  You know You know  Chorus:  We let it rip when we got the money  Let it roll if we got the gas  It gets wild yeah but that's the way we get down  In a Hicktown  (Bridge)  We hear folks in the city party in Martini Bars  And they like to show off in their fancy foreign cars  Out here in the boondocks we buy beer at Amoco  And crank our Kraco speakers with that country radio  Chorus  We let it rip when we got the money  Let it roll if we got the gas  It gets wild yeah but that's the way we get down  Oh Oh We let it rip when we got the money  Let it roll if we got the gas  Its buck wild yeah but that's the way we get down  In a Hicktown  In a Hicktown  It's the way we get down  In a Hicktown  Yeah in a Hicktown  Oh we aint finished yet  We got yer country boys and yer redneck girls  It's the party heard round the world  Right here in Hicktown  Yeah In Hicktown  The whole town's gettin' down"},{"id":62,"title":"Keith Anderson - Pickin' Wildflowers","url":"http://www.anycountrymusiclyrics.com/lyrics/133360/Keith_Anderson/Pickin'_Wildflowers","lyrics":"Hey baby whatcha doin' this evening? Can you meet me down at the railroad tracks? I got Tom Petty playin' in my Silverado, And I iced down a six-pack. Hey Daisy don't you worry 'bout your mama, Like 007 we can keep it covert. Undercover on the ground by the water Gonna get a little peace... on earth.  Chorus: Baby whatcha say we go pickin' wildflowers? Got a spot way back in the woods. Sneak away for a couple of hours, You and me baby, pickin' wildflowers.  Hey baby, Mother Nature is waitin' And love's bloomin' like a cherry tree. Let's buzz around, maybe do some pollenating, Dive on in like honey bees.  Chorus: Baby whatcha say we go pickin' wildflowers? Got a spot way back in the woods. Sneak away for a couple of hours, You and me baby, pickin' wildflowers.  Take a trail ride if you know what I mean. Hey baby won't you come with me?  Chorus: Baby whatcha say we go pickin' wildflowers? Got a spot way back in the woods. Sneak away for a couple of hours, You and me baby, pickin' wildflowers.  Chorus: Baby whatcha say we go pickin' wildflowers? Got a spot way back in the woods. Sneak away for a couple of hours, You and me baby, pickin' wildflowers."},{"id":63,"title":"Keith Anderson - XXL","url":"http://www.anycountrymusiclyrics.com/lyrics/133426/Keith_Anderson/XXL","lyrics":"Well, Mamma was exhausted after she had me. Took two nurses to hold me an' one nurse to slap me. Doctor turned Mamma an' he shook his head, Wiped the sweat off his brow an' then he said: \"This boy's way off the charts as far as I can tell. \"Ooh, brrr, Mamma: he's a double XL.\" By the second grade, I was five foot two; Fifth grade, I was wearin' a size 12 shoe. Eighth grade, I was shoppin' at the Big & Tall, An' the coaches had me playin' High School football. Uncle Roy said: \"Boy, you'll make the NFL: \"Ooh, brrr, son you're a double XL.\"  Double XL, double XL. Don't call me on the 'phone, just ring my dinner bell. Double XL, double XL. I'm a lean mean love machine that likes to be held. Ooh, brrr, baby: I'm a double XL.  Here we go. Country cuties in Texas, string bikinis in Florida; Barbie dolls drivin' Lexus' out in California: A skinny little pretty boy ain't what they wanna hold. They want a real man with meat on his bones. I'll yank their yankees, ring their southern bells: They say: \"Ooh, brrr, we love a double XL.\"  Double XL, double XL. Don't call me on the 'phone, just ring my dinner bell. Double XL, double XL. I'm a lean mean love machine that likes to be held. Ooh, brrr, baby: I'm a double XL.  Instrumental Break. (Double XL solo.)  Well, double XL, double XL. Don't call me on the 'phone, just ring my dinner bell. Double XL, double XL. I'm a lean mean love machine that likes to be held. Ooh, brrr, baby: I'm a double XL.  Well if you have any doubts, come see for yourself, Why all the girls love a double XL. Ooh, brrr, yeah: I'm a double XL. Yeah, oh whoa.  Triple X-L, too."},{"id":64,"title":"Rascal Flatts - Fast Cars And Freedom","url":"http://www.anycountrymusiclyrics.com/lyrics/133392/Rascal_Flatts/Fast_Cars_And_Freedom","lyrics":"Staring at you taking off your makeup Wondering why you even put it on I know you think you do, but baby, you don't need it Wish that you could see what I see when it's gone Chorus: I see a dust trail following an old red Nova Baby blue eyes and your head on my shoulder Wait, baby don't move, right there it is A T-shirt hanging off a dogwood branch That river was cold but we gave love a chance Yeah To me You don't look a day over fast cars and freedom That sunset, riverbank, first time feeling  Yeah smile and shake your head as if you don't believe me I'll just sit right here and let you take me back Got Cougar up on ten, Little Diddy 'Bout Jack and Diane You're laughing, singing with your feet up on the dash Remember that  Chorus: I see a dust trail following an old red Nova Baby blue eyes and your head on my shoulder Wait, baby don't move, right there it is A T-shirt hanging off a dogwood branch That river was cold but we gave love a chance Yeah To me You don't look a day over fast cars and freedom That sunset, riverbank, first time feeling"},{"id":65,"title":"Reba McEntire - My Sister","url":"http://www.anycountrymusiclyrics.com/lyrics/133371/Reba_McEntire/My_Sister","lyrics":"Hey girl it's me i just called to tell you hi Call me when you get this Haven't talked lately so hard to find the time Give the boys a big kiss Tell them that I miss them By the way I miss you too I was thinking just today About how we used to play Barbie dolls and make-up Tea parties dress up I remember how we'd fight We made up and laughed all night Wish we were kids again My sister my friend  Oh yeah before I forget I met someone I think I really like him I was wondering if I'm jumping the gun By going out on a limb And invite him home for Christmas To meet the family  Seem like just yesterday You brought home old what's his name He had been drinking What were you thinking After dinner he passed out We can laugh about it now We've learned a lot since then My sister my friend  Do you think you could come and see me sometime soon We could just hang out like we used to It's late and I should go But I can'y hang up the phone Until I tell you What I don't tell you enough Even though at times it seemed We were more like enemies I'd do it all again My sister my friend"},{"id":66,"title":"Tim McGraw - Back When","url":"http://www.anycountrymusiclyrics.com/lyrics/133260/Tim_McGraw/Back_When","lyrics":"Don't you remember The fizz in a pepper Peanuts in a bottle At ten, two and four A fried bologna sandwich With mayo and tomato Sittin' round the table Don't happen much anymore We got too complicated It's all way over-rated I like the old and out-dated Way of life  Back when a hoe was a hoe Coke was a coke And crack's what you were doing When you were cracking jokes Back when a screw was a screw The wind was all that blew And when you said I'm down with that Well it meant you had the flu I miss back when I miss back when I miss back when  I love my records Black, shiny vinyl Clicks and pops And white noise Man they sounded fine I had my favorite stations The ones that played them all Country, soul and rock-and-roll What happened to those times?  I'm readin' Street Slang For Dummies Cause they put pop in my country I want more for my money The way it was back then  Back when a hoe was a hoe Coke was a coke And crack's what you were doing When you were cracking jokes Back when a screw was a screw The wind was all that blew And when you said I'm down with that Well it meant you had the flu I miss back when I miss back when I miss back when  Give me a flat top for strumming I want the whole world to be humming Just keep it coming The way it was back then  Back when a hoe was a hoe Coke was a coke And crack's what you were doing When you were cracking jokes Back when a screw was a screw The wind was all that blew And when you said I'm down with that Well it meant you had the flu I miss back when I miss back when I miss back when"},{"id":67,"title":"Kacey Musgraves - Merry Go 'round","url":"http://www.anycountrymusiclyrics.com/lyrics/133480/Kacey_Musgraves/Merry_Go_'round","lyrics":"If you ain't got two kids by 21, You're probably gonna die alone At least that's what tradition told you.  And it don't matter if you don't believe, Come Sunday morning you best be there In the front row, like you're s'posed to.  Same hurt in every heart. Same trailer, different park.  Mamas hooked on Mary Kay Brothers hooked on Mary Jane And Daddies hooked on Mary two doors down.  Mary Mary quite contrary, We get bored so we get married And just like dust we settle in this town. On this broken merry go 'round and 'round and 'round we go, Where it stops nobody knows... And it ain't slowin' down, this merry go 'round...  We think the first time's good enough, So we hold on to high school love, Say we won't end up like our parents.  Tiny little boxes in a row, Ain't want you want it's what you know, Just happy in the shoes you're wearin'.  Same checks we're always cashin', To buy a little more distraction.  Cause Mamas hooked on Mary Kay Brothers hooked on Mary Jane Daddies hooked on Mary two doors down.  Mary Mary quite contrary, We get bored so we get married And just like dust we settle in this town. On this broken merry go 'round and 'round and 'round we go, Where we stop nobody knows... And it ain't slowin' down, this merry go 'round...  Mary Mary quite contrary, We're so bored until we're buried. And just like dust we settle in this town. On this broken merry go 'round... Merry go 'round...  Jack and Jill went up the hill, Jack burned out on booze and pills, And Mary had a little lamb, Mary just don't give a damn no more."},{"id":68,"title":"Blaine Larsen - How Do You Get That Lonely","url":"http://www.anycountrymusiclyrics.com/lyrics/133278/Blaine_Larsen/How_Do_You_Get_That_Lonely","lyrics":"It was just another story written on the second page Underneath the Tiger's football score It said he was only eighteen, a boy about my age They found him face down on the bedroom floor There'll be services on Friday at the Lawrence Funeral Home Then out on Mooresville highway, they'll lay him 'neath a stone...  (Chorus) How do you get that lonely, how do you hurt that bad To make you make the call, that havin' no life at all Is better than the life that you had How do you feel so empty, you want to let it all go How do you get that lonely... and nobody know  Did his girlfriend break up with him, did he buy or steal that gun? Did he lose a fight with drugs or alcohol? Did his Mom and Daddy forget to say I love you son? Did no one see the writing on the wall?  I'm not blamin' anybody, we all do the best we can I know hindsight's 20/20, but I still don't understand...  (Chorus) How do you get that lonely, how do you hurt that bad To make you make the call, that havin' no life at all Is better than the life that you had How do you feel so empty, you want to let it all go How do you get that lonely... and nobody know  It was just another story printed on the second page Underneath the Tiger's football score..."},{"id":69,"title":"Shooter Jennings - 4th Of July","url":"http://www.anycountrymusiclyrics.com/lyrics/133390/Shooter_Jennings/4th_Of_July","lyrics":"Alone with the morning burning red in the canvas in my head Painting a picture of you And me driving across country, in a dusty old RV Just the road and its majesty And I'm looking at you with the world in the rear view Chorus- You were pretty as can be, sitting in the front seat  Looking at me, telling me you love me ,and your happy to be,  With me on the 4th of July We sang Stranglehold to the stereo  Couldn't take no more of that rock n roll So we put on a little George Jones and just sang along     Those white lines get drawn into the sun if you aint got no one To keep you hanging on And there you were like a queen with your nightgown, riding shotgun from town to town  Staking a claim on the world we found And I'm singing to you, your singing to me ,you were out of the blue to a boy like me Chorus- You were pretty as can be, sitting in the front seat  Looking at me, telling me you love me ,and your happy to be,  With me on the 4th of July We sang Stranglehold to the stereo  Couldn't take no more of that rock n roll So we put on a little George Jones and just sang along and im looking for you in the silence that we share Chorus- You were pretty as can be, sitting in the front seat  Looking at me, telling me you love me ,and your happy to be,  With me on the 4th of July We sang Stranglehold to the stereo  Couldn't take no more of that rock n roll So we put on a little George Jones and just sang along "},{"id":70,"title":"Gretchen Wilson - Not Bad For A Bartender","url":"http://www.anycountrymusiclyrics.com/lyrics/133453/Gretchen_Wilson/Not_Bad_For_A_Bartender","lyrics":"I stood behing that bar till closing time I served cold beer, warm whiskey, and Rotgut Wine Now I'm up here on the stage Everybody knows my name And I can't believe how long they wait In my autograph line [Chorus]  Not bad for a bartender or an eighth grade education pretty good for a backwoods girl who had to make it on her own I'm on the stool side of the bar these days Buying everyone a round Ain't it funny how the tables turn Not bad for a bartender  Swingin' doors and cleanin' floors is all I'd ever known Out of nowhere somehow i found my yello brick road So when you're broke and paying dues Look at me I'm living proof And if there's hope for me Know there's hope for you.  [Repeat Chorus]  I'm on the stool side of the bars these days Buying everyone a round Ain't it funny how the tables turn Not bad for a bartender Ain't it funny how the tables turn Not bad for a bartender"},{"id":71,"title":"Kenny Chesney - There Goes My Life","url":"http://www.anycountrymusiclyrics.com/lyrics/133029/Kenny_Chesney/There_Goes_My_Life","lyrics":"All he could think about was: \"I'm too young for this. \"Got my whole life ahead. \"Hell, I'm just a kid myself: \"How 'm I gonna raise one?\"  All he could see were his dreams, Going up in smoke. So much for ditchin' this town, An' hangin' out on the coast. Oh well, those plans are long gone. And he said: \"There goes my life. \"There goes my future, my everything.  \"Might as well kiss it all good-bye: \"There goes my life.\"  A couple years of up all night, An' a few thousand diapers later. That mistake he thought he made, Covers up the refrigerator: Oh yeah, he loves that little girl.  An' Momma's waiting to tuck her in,  As she fumbles up those stairs. She smiles back at him, Dragging that teddy bear: \"Sleep tight.\" Blue eyes and bouncing curls.  An' he smiles: \"There goes my life \"There goes my future, my everything.\"  \"I love you, Daddy, goodnight.\" \"There goes my life.\"  She had that Honda loaded down, With Abercrombie clothes, An' and fifteen pairs of shoes, An' his American Express. He checked the oil and slammed the hood, Said: \"You're good to go.\" She hugged them both, An'd headed off to the west coast.  An' he cried: \"There goes my life. \"There goes my future, my everything.  \"I love you, baby, good-bye. \"There goes my life. \"There goes my life. \"Baby, good-bye.\"  Fades."},{"id":72,"title":"Alison Krauss - When You Say Nothing At All","url":"http://www.anycountrymusiclyrics.com/lyrics/133182/Alison_Krauss/When_You_Say_Nothing_At_All","lyrics":"It's amazing how you can speak right to my heart Without saying a word you can light up the dark Try as I may I could never explain What I hear when you don't say a thing The smile on your face lets me know that you need me There's a truth in your eyes saying you'll never leave me A touch of your hand says you'll catch me if ever I fall Now you say it best, when you say nothing at all  All day long I can hear people talking out loud But when you hold me near you drown out the crowd Old Mister Webster could never define What's being said between your heart and mine  The smile on your face lets me know that you need me There's a truth in your eyes saying you'll never leave me A touch of your hand says you'll catch me if ever I fall Now you say it best, when you say nothing at all  The smile on your face lets me know that you need me There's a truth in your eyes saying you'll never leave me A touch of your hand says you'll catch me if ever I fall Now you say it best, when you say nothing at all "},{"id":73,"title":"George Strait - You'll Be There","url":"http://www.anycountrymusiclyrics.com/lyrics/133391/George_Strait/You'll_Be_There","lyrics":"Hope is an anchor and love is a ship, time is the ocean and life is a trip You don't know where you're going, ïtill you know where you're at And if you can't read the stars, well you better have a map A compass and a conscience, so you don't get lost at sea Or on some lonely island, where no one wants to be From the beginning of creation, I think our maker had a plan For us to leave these shores and sail beyond the sand And let the good light guide us through the waves and the wind To the beaches in a world where we have never been And we'll climb up on a mountain, y'all we'll let our voices ring Those who've never tried it, they'll be the first to sing  Whoa, my, my I'll see you on the other side If I make it And it might be a long hard ride But I'm gonna take it Sometimes it seems that I don't have a prayer Let the weather take me anywhere But I know that I wanna go Where the streets are gold ïCause you'll be there Oh, my , my You don't bring nothing with you here And you can't take nothing back I ain't never seen a hearse, with a luggage rack So I've torn my knees up prayin' Scarred my back from fallin' down Spent so much time flying high, till I'm face first in the ground So if you're up there watchin' me, would you talk to God and say, Tell him I might need a hand to see you both someday  Whoa, my, my So I'll see you on the other side If I make it And it might be a long hard ride But I'm gonna take it Sometimes it seems that I don't have a prayer Let the weather take me anywhere But I know that I wanna go Where the streets are gold Cause you'll be there Oh, my , my Cause you'll be there Oh, my ,my "},{"id":74,"title":"Gretchen Wilson - Politically Uncorrect","url":"http://www.anycountrymusiclyrics.com/lyrics/133449/Gretchen_Wilson/Politically_Uncorrect","lyrics":"I'm for the low man on the totum pole And I'm for the underdog god bless his soul And I'm for the guys still pulling third shift and the single mom raising her kids And I'm for the preacher who stay on their knees And I'm for the sinner who finally believed And I'm For the farmer with dirt on his hands And the soldiers who fight for this land And I'm for the bible And I'm for the flag And I'm for the working man  Me and Ol' hag I'm just one of many who can't get no respect Politically Uncorrect  I guess my opinion is all out of style Don't get me started because i can get wild And I'll make a fight for the four father's plan (That's Right) Hell the world already knows where I stand  And I'm for the bible And I'm for the flag And I'm for the working man  Me and Ol' hag I'm just one of many who can't get no respect Politically Uncorrect  Nothing Wrong with the bible Nothing Wrong with the flag Nothing Wrong with the working man Me and Ol' Hag We're just some of many that can't get no respect  Politically Uncorrect Politically Uncorrect"},{"id":75,"title":"Lonestar - Mr. Mom","url":"http://www.anycountrymusiclyrics.com/lyrics/133225/Lonestar/Mr._Mom","lyrics":"Lost my job, came home mad Got a hug and kiss and that's too bad She said I can go to work until you find another job I thought I like the sound of that Watch TV and take long naps Go from a hand working dad to being Mr. Mom Well Pampers melt in a Maytag dryer Crayons go up one drawer higher Rewind Barney for the fifteenth time Breakfast, six naps at nine There's bubble gum in the baby's hair Sweet potatoes in my lazy chair Been crazy all day long and it's only Monday Mr. Mom  Football, soccer and ballet Squeeze in Scouts and PTA And there's that shopping list she left That's seven pages long How much smoke can one stove make The kids won't eat my charcoal cake It's more than any maid can take Being Mr. Mom  Well Pampers melt in a Maytag dryer Crayons go up one drawer higher Rewind Barney for the sixteenth time Breakfast, six naps at nine There's bubble gum in the baby's hair Sweet potatoes in my lazy chair Been crazy all day long and it's only Monday Mr. Mom  Before I fall in bed tonight If the dog didn't eat the classifieds I'm gonna look just one more time  'Cause Pampers melt in a Maytag dryer Crayons go up one drawer higher Rewind Barney for the eighteenth time Breakfast, six naps at nine There's bubble gum in the baby's hair Sweet potatoes in my lazy chair Been crazy all day long  Oh been crazy all day long and it's only Monday Mr. Mom  Balancin' checkbooks, juggling bills Thought there was nothing to it Baby, now I know how you feel What I don't know is how you do it"},{"id":76,"title":"Cledus T. Judd - I Love NASCAR","url":"http://www.anycountrymusiclyrics.com/lyrics/133261/Cledus_T._Judd/I_Love_NASCAR","lyrics":"We got owners, favorite drivers,  Boy, that Tony Stewart's a whiner.  An' we got rookies, advertisers,  **Like, let's say: Havoline, Target, xxxxx, Caterpiller, Exdale,  **Mountain Dew, Dupont Lows, Homebake, Poco, Kodak,  **M&Ms, UBF, Tired Old Tail, Gillette, Kelloggs, xxxxxx, Budweiser.  But the trophy girls still have my favorite parts.  Vroom, vroom, vroom, vroom, vroom, I love NASCAR. We got cautions, we got pitstops,  You can't hear a dang thing once the flag drops.  An' poor Cow Patty, an' swervin' Marlin, ha ha,  Are gonna find it tough to beat Mark Martin.  'Cause that Viagra car is always driven hard.  Vroom, vroom, vroom, vroom, vroom, I love NASCAR.  I love NASCAR, it's my kind of race.  Just watchin' Jeff Gordon fly up a wall,  Puts a smile on Dale junior's face.  No caviar. It's it's beer an Mohawks.  Vroom, vroom, vroom, vroom, vroom, I love NASCAR.  I like short tracks, you'll see more wrecks,  An' about a million screamin' rednecks.  An' ol' Jeff Burton, ha, an' poor Mike Skinner,  Well, they've done forgot what it's like to be a winner.  An' Ken Schrader still ain't sure who his sponsors are.  Vroom, vroom, vroom, vroom, vroom, I love NASCAR.  **\"Hey, that was a close one up there fellas.  **\"But I got into one end.  **\"I might pull over right up here next pitstop,  \"I want you to get two front tires.  \"I need a wedge on the left side to keep this windshield playin' on the gas.  \"An' you don't care, hand me a pair of underwear, I have messed all in my drawers.\"  I like football. (I like football.)  I like my wrestlin'.  I like a good game of air hockey,  I like some pinball now an' then.  How about you, Toby?  I love NASCAR, it's my kind of race.  Just to see Big E back on the track,  Would put a smile on every face.  No-one drove a car quite like Earnhardt.  Vroom, vroom, vroom, vroom, vroom, I love NASCAR.  Vroom, vroom, vroom: Gentlemen, start your engines:  I love NASCAR."},{"id":77,"title":"Josh Gracin - Nothin To Lose","url":"http://www.anycountrymusiclyrics.com/lyrics/133269/Josh_Gracin/Nothin_To_Lose","lyrics":"It was noon time, down time, break time, summer time, Miller time, anytime: She was looking pretty fine. Red light, green light, go: all fired upside, downtown: She was shaking me all around. I was tuned in, going nowhere, second wind, Jonesing, drooling, feeling good, if you would. Oh yeah, by the way she moves, She's got me rollin' in dirt: in a white t-shirt, Breaker, Breaker one-nine, she's a big ol' flirt. By now she's got me pretty tied up, tied down, Any way I choose, I got nothin' to lose.  In like Flynn, I was looking for the win, Just trying anything, hey, Baby, where you been? All my life I've been looking for someone like you. Falling head over heels, Hey what can I do?  Oh yeah, by the way she moves, She's got me rollin' in dirt: in a white t-shirt, Breaker, Breaker one-nine, she's a big ol' flirt. By now she's got me pretty tied up, tied down, Any way I choose, I got nothin' to lose.  Now, I'm in the fast lane goin' ninety-eight. By now, I know she can smooth operate me. I know now, she's no goody-two-shoes, But hey, I got myself nothin' to lose.  Instrumental break.  Oh yeah, by the way she moves, She's got me rollin' in dirt: in a white t-shirt, Breaker, Breaker one-nine, she's a big ol' flirt. By now she's got me pretty tied up, tied down, Any way I choose, I got nothin' to lose.  Oh yeah, by the way she moves, She's got me rollin' in dirt: in a white t-shirt, Breaker, Breaker one-nine, she's a big ol' flirt. By now she's got me pretty tied up, tied down, Any way I choose, I got nothin' to lose.  Noon time, down time, break time, summer time, Miller time, anytime: She was looking pretty fine. In like Flynn, I was looking for the win. (I got me nothin' to lose.) Just trying anything, hey baby where you been? All my life I've been looking for someone like you. Falling head over heels, Hey what can I do? I got nothin' to lose, yeah.  "},{"id":78,"title":"Martina McBride - God's Will","url":"http://www.anycountrymusiclyrics.com/lyrics/133283/Martina_McBride/God's_Will","lyrics":"I met God's Will on a Halloween night He was dressed as a bag of leaves It hid the braces on his legs at first His smile was as bright as the August sun When he looked at me As he struggled down the driveway It almost made me hurt  Will don't walk too good Will don't talk too good He won't do the things that the other kids do In our neighborhood  I've been searchin', wonderin', thinkin' Lost and lookin' all my life I've been wounded, jaded, loved and hated I've wrestled wrong and right He was a boy without a father And his mother's miracle I've been readin', writin', prayin', fightin' I guess I would be still Yeah, that was until I new God's Will  Will's mom had to work two jobs We'd watch him when she had to work late And we'd all laugh like I hadn't laughed Since I don't know when  \"Hey Jude\" was his favorite song At dinner, he'd ask to pray And then he'd pray for everybody in the world, but him  I've been searchin', wonderin', thinkin' Lost and lookin' all my life I've been wounded, jaded, loved and hated I've wrestled wrong and right He was a boy without a father And his mother's miracle I've been readin', writin', prayin', fightin' I guess I would be still Yeah, that was until I knew God's Will  Before they moved to California His mother said, \"They didn't think he'd live\" And she said, \"Each day that I have him, well, it's just another gift\" And I never got to tell her, that the boy showed me the truth In crayon red, on notebook paper He'd written, \"Me and God love you\"  I've been searchin', prayin', wounded, jaded I guess I would be still Yeah that was until... I met God's Will on a Halloween night He was dressed as a bag of leaves"},{"id":79,"title":"Dixie Chicks - Travelin' Soldier","url":"http://www.anycountrymusiclyrics.com/lyrics/133185/Dixie_Chicks/Travelin'_Soldier","lyrics":"Two days past eighteen He was waitin' for the bus in his army greens Sat down in a booth at a cafe there Gave his order to the girl with a bow in her hair He's a little shy so she gave him a smile So he said would you mind sittin' down for a while And talkin' to me I'm feelin' a little low She said I'm off in an hour and I know where we can go So they went down and they sat on the pier He said I bet you got a boyfriend but I don't care I've got no one to send a letter to Would you mind if I sent one back here to you?  CHORUS: I cried Never gonna hold the hand of another guy Too young for him they told her Waitin' for the love of the travelin' soldier Our love will never end Waitin' for the soldier to come back again Never more to be alone When the letter says a soldier's coming home  So the letters came From an army camp In California then Vietnam And he told his heart It might be love And all of the things he was so scared of Said when it's gettin kinda tough over here I think about that day sittin' down at the pier And close my eyes and see your pretty smile Now don't worry but I won't be able to write for a while  CHORUS  (Martie's fiddle break - Emily's dobro break)  One Friday night at a football game The Lord's Prayer said and the anthem sang A man said folks would you bow your heads For the list of local Vietnam dead Cryin' all alone under the stands Was the piccolo player in the marching band And one name read and no one really cared But a pretty little girl with a bow in her hair  CHORUS "},{"id":80,"title":"Kenny Chesney - Me And You","url":"http://www.anycountrymusiclyrics.com/lyrics/133167/Kenny_Chesney/Me_And_You","lyrics":"Ordinary no, really don't think so Not a love this true Common destiny We were meant to be Me and you Like a perfect scene from a movie screen Where every dream comes true Suited perfectly for eternity Me and you  Every day, I need you even more At the nighttime too There's no way I could ever let you go Even if I wanted to  Every day I live I try my best to give All I have to you I thank the stars above That we share this love Me and you  Every day, I need you even more At the nighttime too There's no way I could ever let you go Even if I wanted to  Ordinary no, I really don't think so Just a precious few Ever make it last Get as lucky as Me and you Me and you"},{"id":81,"title":"Terri Clark - She Didn't Have Time","url":"http://www.anycountrymusiclyrics.com/lyrics/133428/Terri_Clark/She_Didn't_Have_Time","lyrics":"He said goodbye from the edge of the porch like she'd been some casual friend he said \"your better off with out me i'm not what you need\" like her momma had said about him he started the car pulled out of the drive didn't waste any time lookin' back she watched him go thinkin' even a stranger  would show more compassion than that she could've cried but she didn't have time she had a baby to feed a pink blanket to find to rock their little one to sleep she could've laid in bed for hours giving misery the power but she didn't have time  she got a sitter, she got a job 'cause she had a promise to keep her day was a factory and evening survival at night was exhaustion and sleep sometimes she felt life was passing her by and watching was all she could do her friends said \"you gotta get outta the house and maybe you'll meet someone new\"  she could've tried but she didn't have time she had a five year old to feed she had ballet class, piano lessons and t-ball little league she could've laid awake for hours giving lonely nights the power but she didn't have the time  not time where would she find the time to trust a man again not time for that flat tire a crowded parking lot and then not time to just have coffee with the man who got her tired fixed she was thinking gosh he's handsome when he asked do you have kids  she could've lied  but she didnt have time all she said was \"she's five\" he said \"i saw the car seat I love kids does she have your eyes?\" and they sat and talked for hours giving destiny it's power she could've been afraid  to fall in love that night but she didn't have time  she could've been afraid to fall in love that night but she didn't have time"},{"id":82,"title":"Jamie O'Neal - Somebody's Hero","url":"http://www.anycountrymusiclyrics.com/lyrics/133425/Jamie_O'Neal/Somebody's_Hero","lyrics":"She's never pulled anyone from a burning building She's never rocked Central Park to a half a million fans, screaming out her name She's never hit a shot to win the game She's never left her footprints on the moon She's never made a solo hot air balloon ride, around the world, No, she's just your everyday average girl (but) She's somebody's hero A hero to her baby with a skinned up knee A little kiss is all she needs The keeper of the cheerios The voice that brings Snow White to life Bedtime stories every night And that smile lets her know She's somebody's hero  She didn't get a check every week like a nine-to fiver But she's been a waiter, and a cook and a taxi driver For twenty years, there at home, until the day her girl was grown Giving all her love to her was her life's ambition But now her baby's movin' on, and she'll soon be missin' her But not today, those are tears of joy runnin' down her face  She's somebody's hero A hero to her daughter in her wedding dress She gave her wings to leave the nest It hurts to let her baby go down the aisle she walks right by Looks back into her mother's eyes And that smile lets her know She's somebody's hero  Thirty years have flown right past Her daughters' starin' at all the photographs Of her mother, and she wishes she could be like that Oh, but she already is  She's somebody's hero A hero to her mother in a rockin' chair She runs a brush through her silver hair The envy of the nursing home She drops by every afternoon Feeds her mama with a spoon And that smile lets her know Her mother's smile lets her know She's somebody's hero  "},{"id":83,"title":"Toby Keith - Don't Leave, I Think I Love You","url":"http://www.anycountrymusiclyrics.com/lyrics/133038/Toby_Keith/Don't_Leave,_I_Think_I_Love_You","lyrics":"[Chorus:] Don't leave, I think I love you I just saw the rest of my life, honey you're in it Won't you hear what I say, give me a minute Don't leave, I think I love you I know you think I'm crazy, And you probably should I wouldn't make this up, I couldn't dream this good  Now baby Don't tell me that I missed my chance I haven't heard last call, would you like to dance? I've been sitting here waiting on you all night Why don't you give me that old good-to-go green light Am I coming on strong, baby movin' kinda fast I'm rushing along but at least I gotta ask I couldn't live with myself if you got away I'm a love sick puppy, baby what do you say?  [Chorus]  It's late and been a long night, you're tired I know Aw, don't break my heart, baby please don't go It Ain't the shikey talkin', ain't this neon light You see I've fallen stone-cold in love at first sight Gonna cut to the chase, baby get right to it I got a lot to say and a short time to do it Aw, Don't walk away honey I'm just trying to Aw... listen to me talkin', I'm a babblin' fool  [chorus]  Really baby, don't leave I think I love you I know you think I'm crazy, and you probably should I wouldn't make this up, I couldn't dream this good"},{"id":84,"title":"Craig Morgan - Redneck Yacht Club","url":"http://www.anycountrymusiclyrics.com/lyrics/133431/Craig_Morgan/Redneck_Yacht_Club","lyrics":"I'm meeting my buddies out on the lake  we're headin out to a special place  we love that just a few folks know  there's no signing up, no monthly dues  take your johnson, your mercury or your evinrude and fire it up  meet us out at party cove  come on in' the waters fine  just idle on over and toss us a line (Chorus) basstrackers, bayliners and a party barge,  strung together like a floating trailer park anchored out and gettin loud  all summer long side by side there's five houseboat front porches astroturf,  lawn chairs and tiki torches  regular joes rocking the boat that's us  the redneck yacht club  bermuda's' flip-flops and a tank top tan  popped his first top at ten a.m., thats bob  he's our president  we're checking out the girls on the upper deck rubbin' in 15 spf, its hot  everybody's jumpin' in  later on when the sun goes down  we'll pull out the jar and the old guitar  and pass'em around  (Chorus) basstrackers, bayliners and a party barge,  strung together like a floating trailer park anchored out and gettin loud  all summer long side by side there's five houseboat front porches astroturf,  lawn chairs and tiki torches  regular joes rocking the boat that's us  the redneck yacht club  when the party's over and we're all alone  well be making waves in a no wake zone  (Chorus) basstrackers, bayliners and a party barge,  strung together like a floating trailer park anchored out and gettin loud  all summer long side by side there's five houseboat front porches astroturf,  lawn chairs and tiki torches  regular joes rocking the boat that's us  the redneck yacht club   "},{"id":85,"title":"Rascal Flatts - These Days","url":"http://www.anycountrymusiclyrics.com/lyrics/133091/Rascal_Flatts/These_Days","lyrics":"Hey baby, is that you  Wow, your hair got so long  Yeah, yeah I love it, I really do  ñ Norma Jean,î ain't that the song we'd sing  In the car driving downtown  Top down, making the rounds  Checking out the bands on Doheny Avenue Yeah, life throws you curves  But you learned to swerve  Me, I swung and I missed  And the next thing you know, I'm reminiscing  Dreaming old dreams  Wishing old wishes  Like you would be back again  Chorus  I wake up in teardrops that fall down like rain  I put on that old song we danced to and then  I head off to my job, guess not much has changed  Punch the clock, head for home, check the phone just in case  Go to bed, dream of you  That's what I'm doing these days  Yeah, that's what I'm doing  Someone told me after college  You ran off to Vegas  You married a rodeo cowboy  Wow, that ain't the girl I knew  Me, I've been a few places  Mostly here and there once or twice  Still sorting out life but I'm doing alright  Yeah, it's good to see you too  Well hey girl you're late  And those planes, they don't wait  But if you ever come back around  This sleepy old town  Promise me you'll stop in  To see an old friend  And until then  (Repeat Chorus Twice)  I wake up in teardrops that fall down like rain  I put on that old song we danced to and then  I wake up in teardrops that fall down like rain  I put on that old song we danced to and then  I wake up in teardrops that fall down like rain  I put on that old song we danced to and then  (Fade)"},{"id":86,"title":"Lee Ann Womack - I Hope You Dance","url":"http://www.anycountrymusiclyrics.com/lyrics/133326/Lee_Ann_Womack/I_Hope_You_Dance","lyrics":"I hope you never lose your sense of wonder You get your fill to eat But always keep that hunger May you never take one single breath for granted God forbid love ever leave you empty handed I hope you still feel small When you stand by the ocean Whenever one door closes, I hope one more opens Promise me you'll give fate a fighting chance And when you get the choice to sit it out or dance I hope you dance I hope you dance  I hope you never fear those mountains in the distance Never settle for the path of least resistance Living might mean taking chances But they're worth taking Lovin' might be a mistake But it's worth making Don't let some hell bent heart Leave you bitter When you come close to selling out Reconsider Give the heavens above More than just a passing glance  And when you get the choice to sit it out or dance I hope you dance (Time is a wheel in constant motion always) I hope you dance (Rolling us along) I hope you dance (Tell me who) I hope you dance (Wants to look back on their years and wonder) (Where those years have gone)  I hope you still feel small When you stand by the ocean Whenever one door closes, I hope one more opens Promise me you'll give faith a fighting chance  And when you get the choice to sit it out or dance Dance I hope you dance I hope you dance (Time is a wheel in constant motion always) I hope you dance (Rolling us along) I hope you dance (Tell me who) (Wants to look back on their years and wonder) I hope you dance (Where those years have gone)  (Tell me who) I hope you dance (Wants to look back on their years and wonder) (Where those years have gone)"},{"id":87,"title":"Gretchen Wilson - Raining On Me","url":"http://www.anycountrymusiclyrics.com/lyrics/133452/Gretchen_Wilson/Raining_On_Me","lyrics":"I've been chasing rainbows all my life Still haven't found that pot of gold I send my prayers to heaven every night Just close my eyes and let them go Seems like everybody has got one up on me Someone tell me what I'm supposed to do [Chorus]  Why does the sun always shine On the other side, on the other side Why does it always have to be Oh raining Always raining on me  Seems like I've been standing under the clouds And it's always been that way There ain't no silver lining to be found Everywhere I look it's just another shade of grey And I don't know why  And I don't know when And I don't know where to begin  [Repeat Chorus]  I know there's a rainbow hiding just beyond the clouds So I'll keep on keeping on Ain't gonna let it get me down I won't let get me down  [Repeat Chorus]  Always raining on me Always raining on me Always raining on me "},{"id":88,"title":"Gary Allan - Songs About Rain","url":"http://www.anycountrymusiclyrics.com/lyrics/133104/Gary_Allan/Songs_About_Rain","lyrics":"Well this town has closed down way too early,  And there's nothing to do, So I'm driving around in circles,  And I'm thinking about you, Today I heard you got a new last name, Sure didn't know it was gonna hit me this way, And the radio just keeps on playing all these songs about rain Now there's all kind of songs about babies and love that goes right, But for some unknown reason nobody wants to play them tonight, Hey I hope it's sunny wherever you are, But that's sure not the picture tonight in my car,  And it sure ain't easing my pain all these songs like, Rainy Night In Georgia, and Kentucky Rain, Here Comes That Rainy Day Feeling Again,  Blue Eyes Crying In The early morning Rain, They go on and on, And there's no two the same,  Oh it would be easy to blame all these songs about rain, Well I thought I was over you but I guess maybe I'm not, Cause when I let you go looks like lonely is all that I got, Guess I'll never know what could have been, Sure ain't helping this mood that I'm in, If their gonna keep on playing me songs like,  Rainy Night In Georgia, and Kentucky Rain, Here Comes That Rainy Day Feeling Again,  Blue Eyes Crying In The early morning Rain, They go on and on, And there's no two the same,  Oh how I wish I could blame all these songs about rain, All these songs about rain, Songs about rain......."},{"id":89,"title":"Rascal Flatts - Skin","url":"http://www.anycountrymusiclyrics.com/lyrics/133381/Rascal_Flatts/Skin","lyrics":"Sarah Beth is scared to death  To hear what the doctor will say  She hasn't been well  Since the day that she fell  And the bruises just won't go away  So she sits and see waits with her mother and dad  Flips through an old magazine  Till a the nurse with a smile  Stands at the door  And says will you please come with me Sarah Beth is scared to death  Cause the doctor just told her the news  Between the red cells and white  Something's not right  But we're gonna take care of you  Six chances in ten it won't come back again  With the therapy were gonna try  It's just been approved  It's the strongest there is  I think we caught it in time  Sarah Beth closes her eyes  She dreams she's dancing  Around and around without any cares  And her very first love is holding her close  And the soft wind in blowing her hair  Sarah Beth is scared to death  As she sits holding her mom  Says it would be a mistake  For someone to take  A girl with no hair to the prom  Oh, just this morning right there on her pillow  Was the coolest of any surprise  And she cried when she gathered it all in her hands  The proof that she couldn't deny  Sarah Beth closes her eyes  She dreams she's dancing  Around and around without any cares "},{"id":90,"title":"Kenny Chesney - Anything But Mine","url":"http://www.anycountrymusiclyrics.com/lyrics/133171/Kenny_Chesney/Anything_But_Mine","lyrics":"Walking alone beneath the lights of that miracle mile, he n Mary making her way into the night, you can here the cries from the carnival rides, the pin ball bills, ski ball slides, watching the summer sun fall out of scent, there's a warm wind coming in from off of the ocean making its way past the hotel wall to fill the streets Mary is holding both of her shoes in her hands said she likes to feel the sand beneath her feet And in the morning I'm leaving n making my way back to Cleveland so tonight I hope I would do just fine, and I don't see how you could ever be anything but mine  There's a local band playing at the sea side pavilion and I got just enough cash to get us in and as we are dancing Mary's wrapping her arms around me and I cant feel the sting on summer on my neck in the mist of the music I tell her I love her, we both laugh cause it isn't true but Mary there is a summer drawing to tonight there's so much I'm longing to do to you  And in the morning I'm leaving n making my way back to Cleveland so to night I hope I would do just fine n I don't see how you could ever be anything but mine  Ooooooooo..  And in the morning I'm leaving n making my way back to Cleveland so to night I hope I would do just fine n I don't see how you could ever be anything but mine  Mary I don't see how you could ever be anything but mine  Ooooooooooo...ooooooooooooooo...  ...And in the morning I'm leaving n making my way back to Cleveland so to night I hope I would do just fine n I don't see how you could ever be anything but mine  "},{"id":91,"title":"Montgomery Gentry - Something To Be Proud Of","url":"http://www.anycountrymusiclyrics.com/lyrics/133432/Montgomery_Gentry/Something_To_Be_Proud_Of","lyrics":"There's a story that my daddy tells religiously Like clockwork every time he sees an opening In a conversation about the way things used to be Well I'd just roll my eyes and make a bee-line for the door But I'd always wind up starry-eyed, cross-legged on the floor Hanging on to every word Man, the things I heard It was harder times and longer days Five miles to school, uphill both ways We were cane switch raised, and dirt floor poor 'Course that was back before the war Yeah, your uncle and I made quite a pair Flying F-15's through hostile air He went down but they missed me by a hair He'd always stop right there and say...  That's something to be proud of That's a life you can hang your hat on That's a chin held high as the tears fall down A gut sucked in, a chest stuck out Like a small town flag a-flyin' Or a newborn baby cryin' In the arms of the woman that you love That's something to be proud of  So I'm graduatin' college, that was mama's dream But I was on my way to anywhere else when I turned 18 Cuz when you gotta fast car you think you've got everything I learned quick those GTO's don't run on faith I ended up broken down in some town north of L.A. Working maximum hours for minimum wage Well, I fell in love, next thing I know The babies came, the car got slow I sure do miss that old hot rod But you sure save gas in them foreign jobs Dad, I wonder if I ever let you down If you're ashamed how I turned out Well, he lowered his voice, then he raised his brow Said, lemme tell ya right now  That's something to be proud of That's a life you can hang your hat on You don't need to make a million Just be thankful to be workin' If you're doing what you're able And putting food there on the table And providing for the family that you love That's something to be proud of  And if all you ever really do is the best you can Well, you did it man  That's something to be proud of That's a life you can hang your hat on That's a chin held high as the tears fall down A gut sucked in, a chest stuck out Like a small town flag a-flyin' Or a newborn baby cryin' In the arms of the woman that you love That's something to be proud of That's something to be proud of Yeah, that's something to be proud of That's something to be proud of Now that's something to be proud of"},{"id":92,"title":"Billy Gilman - Coming Home","url":"http://www.anycountrymusiclyrics.com/lyrics/133399/Billy_Gilman/Coming_Home","lyrics":"When you change the way you look at things The things you look at change I can see the world so differently Seeing things your way There's a path that's right in front of me That's been calling me for days And I know that when you walk with me It will be for always You give me everything I have Everything I need You are the reason Why I believe  C H O R U S: All my love I want to give to you All my life I want to see you In my dreams you opened up my eyes To a world that I have never seen I'm coming home  When I see the way the early dawn drives the night away To reveal a world that's holding on To see a brighter day I can only hope for everyone To feel the way I do Live their life to love someone The way that I love you You give me everything I have Everything I need you are the reason why I believe  2nd C H O R U S All my love I want to give to you All my life I want to see you In my dreams you opened up a world That I have never seen For always I will remain faithful To the faith you have in me Can't believe how much I have grown With you I'm finally Coming Home  Through you I see the fight that will take me home All the days of my life  For always I will remain faithful To the faith you have in me Can't believe how much I have grown With you I'm finally Coming Home  "},{"id":93,"title":"Alan Jackson - Monday Morning Church","url":"http://www.anycountrymusiclyrics.com/lyrics/133266/Alan_Jackson/Monday_Morning_Church","lyrics":"You left your Bible on the dresser So I put it in the drawer 'Cause I can't seem to talk to God without yelling anymore And when I sit at your piano I can almost hear those hymns The keys are just collecting dust But I can't close the lid [Chorus]  You left my heart as empty As a Monday morning church It used to be so full of faith and now it only hurts And I can heart the devil whisper \"Things are only getting worse\" You left my heart as empty As a Monday morning church  The preacher came by Sunday Said he missed me at the service He told me Jesus loves me But I'm not sure I deserve it 'Cause the faithful man that you loved Is nowhere to be found Since they took all that he believed And laid it in the ground  [Chorus]  You left my heart as empty As a Monday morning church It used to be so full of faith and now it only hurts And I can heart the devil whisper \"Things are only getting worse\" You left my heart as empty As a Monday morning church  I still believe in Heaven And I'm sure you've made it there But as for me without your love, girl I don't have a prayer  [Chorus]  You left my heart as empty As a Monday morning church It used to be so full of faith and now it only hurts And I can heart the devil whisper \"Things are only getting worse\" You left my heart as empty As a Monday morning church  You left your Bible on the dresser So I put it in the drawer"},{"id":94,"title":"Gretchen Wilson - One Bud Wiser","url":"http://www.anycountrymusiclyrics.com/lyrics/133448/Gretchen_Wilson/One_Bud_Wiser","lyrics":"[Chorus] Well I'm one bud wiser than I was a minute ago I found an equalizer that makes his memory a no show And I won't be jonesin' for his loving anymore Cause I'm one bud wiser than I was a minute ago  I dropped a quarter played \"Golded Ring\" on the juke box Placed my order with the guy behind the bar And when he handed me a cold one, I said \"Keep the change, Darlin'\" And as I drank it down I felt the healing start.  [Repeat Chorus]  When he left me he took my brand new Silverado I started thumbin' and I finally hitched a ride I just came in here to drink a beer and watch the rednecks fight Now I don't feel so bad going home alone tonight  [Repeat chorus]  And I won't be jonesin' for his lovin' any more 'Cause I'm one bud wiser than I was a minute ago Yes I'm one bud wiser..."},{"id":95,"title":"Martina McBride - How Far","url":"http://www.anycountrymusiclyrics.com/lyrics/133198/Martina_McBride/How_Far","lyrics":"There's a boat, I could sail away There's the sky, I could catch a plane There's a train, there's the tracks I could leave and I could choose to not come back Oh never come back There you are, giving up the fight Here I am begging you to try Talk to me, let me in But you just put your wall back up again Oh when's it gonna end  [Chorus:] How far do I have to go to make you understand I wanna make this work so much it hurts, but I just can't Keep on giving, go on living with the way things are So I'm gonna walk away And it's up to you to say how far  There's a chance I could change my mind But I won't, not till you decide What you want, what you need Do you even care if I stay or leave Oh, what's it gonna be  [Chorus]  Out of this chair, or just across the room Halfway down the block or halfway to the moon  How far do I have to go to make you understand I wanna make this work so much it hurts, but I just can't Keep on giving, go on living with the way things are So I'm gonna walk away And it's up to you to say YeahI'm gonna walk away And it's up to you to say how far"},{"id":96,"title":"Josh Turner - Long Black Train","url":"http://www.anycountrymusiclyrics.com/lyrics/133111/Josh_Turner/Long_Black_Train","lyrics":"There's a long black train  Coming down the line  Feeding off the souls that are lost and crying  Tails of sin only evil remains  Watch out brother for that long Black Train Look to the heavens  You can look to the skies  You can find redemption  staring back into your eyes  There is protection and there is  peace the same burn in your ticket for that  Long Black Train  cause theres victory in the lord i say  Victory in the lord  Cling to the father and his holy name  and dont go riding on that long Black Train  Theres a engine there on that Long Black Train  making you wonder if your ride is worth the pain  hes just a waitin on your heart to say  let me ride on that long black train  but u know theres victory in the lord i say  victory in the lord  Cling to the father and his holy name  and dont go riding on that long Black Train  Well i can hear the whistle from a mile away  it sounds so good  but i must stay away  that train is a beauty making everybody stare  but its only destination is the middle of nowhere  But u know theres victory in the lord i say  victory in the lord  Cling to the father and his holy name  and dont go riding on that long Black Train  i said cling to the father and his holy name and dont go ridin on that black train  yes watch out brother for that long black train  the devils a ridin that long black train. "},{"id":97,"title":"George Strait - She'll Leave You With A Smile","url":"http://www.anycountrymusiclyrics.com/lyrics/133060/George_Strait/She'll_Leave_You_With_A_Smile","lyrics":"At first she's gonna come on strong Like She'll love you all night long Like it's going out of style Then she'll leave you with a smile Well you can't help but wonder Why you can't help but love her But you can't help love her And all that hurtin' was more than worth it It's written all over your face  One day you'll pass her on the street With that guy you used to be She'll say hello and walk on by Then she'll leave you with a smile  Well you can't help but wonder Why you can't help but love her But you can't help love her And all that hurtin' was more than worth it It's written all over your face At first she's gonna come on strong Like She'll love you all night long Like it's going out of style Then she'll leave you with a smile  Ah, she's gonna love you She gonna leave you with a smile Ah, she's gonna love you She gonna leave you with a smile"},{"id":98,"title":"Gretchen Wilson - Redneck Woman","url":"http://www.anycountrymusiclyrics.com/lyrics/133242/Gretchen_Wilson/Redneck_Woman","lyrics":"Well I aint never  been the barbie doll type  no I can't swig that sweet champagne  I'd rather drink beer all night  In a tavern or in a honky tonk  I want a 4 wheel drive tailgate  I've got posters on my wall of Skynard, Kid and Straight  Some people look down on my  But I don't give a rip  I stand barefooted in my own front yard with a baby in on my hip Cause I'm redneck woman  I aint no high class broad  I'm just a product of my rasin'  And I say \"hey y'all\" and \"Yee Haw\"  And I keep my christmas lights on my front porch all year long  And I know all the words to every Charle Daniels song  So here's to all my sisters out there keeping it country  Let me get a big \"Hell Yea\" from the redneck girls like me  Hell Yeah  Hell Yeah  Victoria's Secret  Well their stuff's real nice  Oh but I can buy the same damn thing on a Wal*Mart shelf half price  And still look sexy  Just as sexy  As those models on tv  No I don't need no designer tag to make my men want me  You might think I'm trashy  A little too hard core  But get in my neck of the woods  I'm just the girl next door  Hey I'm redneck woman  I aint no high class broad  I'm just a product of my rasin'  And I say \"hey y'all\" and \"Yee Haw\"  And I keep my christmas lights on my front porch all year long  And I know all the words to every Tanya Tucker song  So here's to all my sisters out there keeping it country  Let me get a big \"Hell Yea\" from the redneck girls like me  Hell Yeah  Hell Yeah  I'm redneck woman  I aint no high class broad  I'm just a product of my rasin'  And I say \"hey y'all\" and \"Yee Haw\"  And I keep my christmas lights on my front porch all year long  And I know all the words to every Ol' Bo Seafus song  So here's to all my sisters out there keeping it country  Let me get a big \"Hell Yea\" from the redneck girls like me  Hell Yeah  Hell Yeah  Hell Yeah  Hell Yeah  Hell Yeah  Hell Yeah  I Said Hell Yeah"},{"id":99,"title":"Chris Cagle - What a Beautiful Day","url":"http://www.anycountrymusiclyrics.com/lyrics/133057/Chris_Cagle/What_a_Beautiful_Day","lyrics":"Day One  I stumbled through hello on 5th avenue Day Two We grabbed a bite to eat and talked all afternoon Caught a movie on day Fourteen And day sixty-seven she said I love you to me Chorus: Oh what a feeling What a wonderful emotion Yeah what a life Counting my blessings and knowing.... Ooh we had our ups and downs All along the way She had a chance to leave but chose to stay  What a beautiful day (x2)  Day One Sixteen I asked her what she was doing for the rest of my life Day One Eighty Nine Oh I almost lost that girl to my Foolish pride But she said I do on day Four Eighty Two and gave me a son on day Seven Sixty One  Chorus  What a beautiful Day  Day Eighteen Thousand Two hundred and Fifty Three Well honey thats fifty years Yeah heres to you and me  Chorus  What a beautiful day (x2)  Day one I thank god i said hello on 5th avenue"},{"id":100,"title":"Trisha Yearwood - Georgia Rain","url":"http://www.anycountrymusiclyrics.com/lyrics/133383/Trisha_Yearwood/Georgia_Rain","lyrics":"1st Verse Barefoot in the bed 'a your truck On a blanket lookin' up Half a moon peekin' down at us From underneath the clouds Teenage kids sneakin' out again Heard the thunder rollin' in We were fallin' the moment when It all came pourin' down  1st Chorus  The Georgia rain On the Jasper County clay Couldn't wash away What I felt for you that day Just you and me down an old dirt road Nothin' in our way Except for the Georgia rain  2nd Verse  Cotton fields remember when Flash 'a lightnin' drove us in We were soaked down to the skin By the time we climbed inside And I don't remember what was poundin' more Heart in my chest or the hood of that Ford As the sky fell in, the storm clouds poured Worlds away outside  2nd Chorus  The Georgia rain On the Jasper County clay Couldn't wash away All the love we made Just you and me down that old dirt road No one saw a thing Except for the Georgia rain  3rd Verse  Screen door flappin' in the wind Same ol' house I grew up in Can't believe I'm back again After all these years away You fixed your Daddy's house up nice I saw it yesterday when I drove by Looks like you've made yourself a real good life What else can I say  Tag Chorus  The Georgia rain On the Jasper County clay Couldn't wash away The way I loved you to this day The ol' dirt road's paved over now Nothin' here's the same Except for the Georgia rain"}]